{"0-legal-notice": "Legal warning - Hey, thanks for using Remotive's API, we appreciate it! Please note that API documentation and access is granted so that developers can share our jobs further. Please do not submit Remotive jobs to third Party websites, including but not limited to: Jooble, Neuvoo, Google Jobs, LinkedIn Jobs. Please link back to the URL found on Remotive AND mention Remotive as a source in order to Remotive to get traffic from your listing. If you don't do that, we'll terminate your API access, sorry! Jobs displayed are delayed by 24 hours, the goal being that jobs are attributed to Remotive on various platforms. Displaying our jobs in order to collect signups/email addresses to show a listing constitutes a breach of our terms of services. We offer a private, paid-for API, please email us at hello(at)remotive(dot)io for more information (starting budget is $5k/mo). Please find out terms of services on https://remotive.io/api-documentation. Please note that there is absolutely no need to request Remotive Job data too frequently. Typically, you only need to GET Remotive job data through this API a couple of times a day (we advise max. 4 times a day). Our data is not changing much faster than that anyway. Note that excessive requests will be blocked. Many thanks (Rodolphe & the Remotive team!)", "job-count": 46, "jobs": [{"id": 1017289, "url": "https://remotive.io/remote-jobs/all-others/research-associate-1017289", "title": "Research Associate", "company_name": "UC Hastings", "category": "All others", "tags": [], "job_type": "contract", "publication_date": "2021-12-04T05:41:16", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>RESEARCH ASSOCIATE (Postdoctoral position)</strong></p>\n<p><strong>Center for WorkLife Law</strong></p>\n<p><strong>Classification:</strong> Level 1 / Class Code 2038 / Exempt / Full-Time / Benefited</p>\n<p><strong>Hiring Salary Range: </strong>$70,000</p>\n<p><strong>ABOUT THE CENTER FOR WORKLIFE LAW</strong></p>\n<p>The <a href=\"http://worklifelaw.org/\" rel=\"nofollow\">Center for WorkLife Law</a> (WLL), housed at the University of California, Hastings College of the Law, is one of the nation's leading nonprofit research organizations devoted to advancing gender and racial equality in the workplace and in education. WorkLife Law's current initiatives include:</p>\n<ul>\n<li>Research on how gender bias differs by race and research on  bias in the legal profession, STEM, and other industries;</li>\n<li><a href=\"http://www.biasinterrupters.org/\" rel=\"nofollow\">Bias Interrupters</a>, an innovative metrics-based approach to workplace diversity;</li>\n<li>Programs and best practices for advancing women in the workplace (<a href=\"http://www.womensleadershipedge.org/\" rel=\"nofollow\">Women's Leadership Edge</a> and <a href=\"http://www.worklifelaw.org/law\" rel=\"nofollow\">Hastings Leadership Academy for Women</a>); and,</li>\n<li>The Pregnant Scholar initiative to increase pregnant and student parents' access to higher education; and</li>\n<li>The Pregnant at Work initiative to provide pregnant and post-partum employees and their doctors and lawyers with critical information to prevent workplace discrimination.</li>\n</ul>\n<p>WorkLife Law's COVID-19 initiative supports the economic security and health of vulnerable workers—particularly low-wage earners, people of color, people with disabilities, and mothers—by helping them understand and access their rights to leave, income replacement, and job security during the pandemic. To learn more about the Helpline, visit <a href=\"http://www.worklifelaw.org/Covid19\" rel=\"nofollow\">worklifelaw.org/Covid19</a>. To learn more about some of the workers we assist, see our <a href=\"https://www.nytimes.com/2020/08/06/opinion/mothers-discrimination-coronavirus.html\" rel=\"nofollow\" target=\"_blank\">recent New York Times Op-Ed</a>.</p>\n<p><strong>THE ROLE</strong></p>\n<p>The Center for WorkLife Law is hiring a Research Associate who will lead a series of experiments aimed at testing effective strategies for mitigating gender and racial bias in the business systems of a group of 6-8 companies. This position is a particularly good fit for people with advanced degrees who are interested in gender justice, workers' rights, and equity issues and are transitioning from academia to non-academic positions.</p>\n<p>The Research Associate will take the lead on a grant-funded project to run 6-8 experiments within organizations. The Research Associate will be in charge of the relationships with the organizations, as well as conducting the research experiments, analyzing the data, and generating insights.</p>\n<p><strong>This is a two-year appointment.</strong></p>\n<p><strong>This position can be remote or in-person based in our San Francisco office.</strong></p>\n<p><strong>RESPONSIBILITIES</strong></p>\n<ul>\n<li><strong>Project management</strong> – act as primary point of contact for experiments, which may include managing deadlines, communicating tasks and priorities effectively, editing final products (articles, reports, PowerPoints, etc.), and managing distribution strategies.</li>\n<li><strong>Research</strong> – run research studies from conceptualization through the entire research process, ending with the publication of findings.</li>\n<li><strong>Statistics </strong>– plan and carry out statistical analyses for each experiment.</li>\n<li><strong>IRB </strong>– obtain IRB approval for experiments before launching.</li>\n<li><strong>Materials </strong>– Design and implement survey instruments, prepare and conduct focus groups/interviews, and create any necessary materials for the experiments.</li>\n<li><strong>Writing </strong>– co-author academic articles and/or articles in the business and popular press about the results of the experiments.</li>\n</ul>\n<p><strong>REQUIREMENTS</strong></p>\n<p><strong>EDUCATION AND EXPERIENCE</strong></p>\n<p>MBA, Ph.D., or ABD (“all but dissertation”) in psychology, sociology, organizational behavior, or related field</p>\n<p><strong>KNOWLEDGE, SKILLS &amp; ABILITIES</strong>  </p>\n<ul>\n<li>Ability to independently plan and execute social psychological experiments</li>\n<li>Experience obtaining IRB approval for studies</li>\n<li>Expertise in designing and implementing surveys on platforms such as Qualtrics or Survey Monkey</li>\n<li>Ability to plan and execute statistical analysis of survey and experimental data using programs such as SPSS, STATA, or R</li>\n<li>Experience running multiple studies simultaneously strongly preferred</li>\n<li>Strong verbal and written communication skills; adept at communicating complex statistical/data concepts in layman's terms</li>\n<li>Proven ability to conduct thorough and accurate literature reviews</li>\n<li>Research experience or expertise in bias and discrimination issues (based on gender or race) is a plus</li>\n<li>Experience using qualitative research methods such as focus groups and interviews is a plus; working knowledge with qualitative analytical tools such as Dedoose is a plus</li>\n<li>Ability to credibly, clearly, professionally, and reliably communicate with colleagues and individuals outside of the organization</li>\n<li>A commitment to WLL's values</li>\n</ul>\n<p><strong>BENEFITS </strong></p>\n<p><strong>Health and Welfare Benefits</strong></p>\n<ul>\n<li>Comprehensive medical, dental and vision insurance coverage</li>\n<li>Flexible Spending Accounts for transportation-related, healthcare and dependent care expenses</li>\n<li>Employee Assistance Program</li>\n</ul>\n<p><strong>For your Financial Future</strong></p>\n<ul>\n<li>Life Insurance, Disability Insurance, and Legal Insurance</li>\n<li>University of California Retirement Plan (a defined benefit plan)</li>\n<li>Deferred Compensation Plans/Pre-tax Retirement Savings Programs</li>\n</ul>\n<p><strong>For your Work/Life Balance</strong></p>\n<ul>\n<li>Fifteen paid holidays per year</li>\n<li>Generous vacation and sick leave</li>\n<li>Commuter Benefits Program</li>\n</ul>\n<p><strong>THE HIRING PROCESS</strong></p>\n<p>Your cover letter should explain why you would like to work for the Center for WorkLife Law, and highlight relevant experience you have, particularly including any related to independent research projects, gender or racial equity, experience working with corporations, and/or data analysis.<strong><br></strong></p>\n<p><strong>This position has been designated as “sensitive” and requires a pre-employment background check. </strong></p>\n<p><em>Federal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please contact Human Resources if you require a reasonable accommodation to apply for a job. Examples of reasonable accommodation include making a change to the application process, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment. </em></p>\n<p><strong>WHAT TO EXPECT</strong></p>\n<p>Applicants who meet the position requirements will be competitively evaluated to identify the individuals whose breadth and depth of experience and education most closely relate to the stated requirements and the needs of the College. Depending on the quality and number of the applications received, only the better qualified applicants may be contacted for an interview. <strong>The position is open until filled. </strong></p>\n<p>The skills listed above are comprehensive, and we understand there are great candidates who possess only a subset of those skills, or who have other important skills. If you match some of these skills, please do not hesitate to apply.</p>\n<p><em>UC Hastings College of the Law is an equal opportunity employer. UC Hastings strives to provide a diverse and inclusive educational environment that fosters cultural awareness, mutual understanding and respect. UC Hastings College of the Law is interested in candidates who will contribute to diversity and equal opportunity in higher education through their teaching. Qualified women and members of underrepresented minority groups are strongly encouraged to apply.</em></p>\n"}, {"id": 1009229, "url": "https://remotive.io/remote-jobs/all-others/ux-ui-teaching-assistant-1009229", "title": "UX/UI Teaching Assistant", "company_name": "Memorisely", "category": "All others", "tags": [], "job_type": "part_time", "publication_date": "2021-12-03T01:42:39", "candidate_required_location": "USA Only", "salary": "", "description": "<p>As a Memorisely teaching assistant, you'll be working with super students around the world to help them thrive during our live Bootcamps. From answering questions on slack via Loom to giving students feedback on their case studies in Notion and Figma. As a teaching assistant, you'll be stepping in to run office hours, design crits, and fun one-off workshops for students to level up in Figma or Notion! When you have time, we'd love you to record the odd Loom video to help students continually learn. Working for Memorisely is all about culture, and every team member does their best to share life behind the scenes on socials, so be ready to say <em>cheeesse</em> 🧀!</p>\n<p>As a Memorisely part-time teaching assistant, you'll be working <strong>two days a week (Tuesday &amp; Thursday).</strong> We don't ask for teaching experience and prefer you to follow our values of community, authenticity, diversity, and importantly positive energy! With these values in place, you'll be on our teaching track to progress from a teaching assistant to a lead teacher running one of our remote Live Bootcamps! We've got a lot planned for Memorisely as a remote company and are always wanting dedicated folks to join our mission!</p>\n<div class=\"h3\"><br>Responsibilities</div>\n<ul>\n<li>Engage and answer students questions in slack via Loom</li>\n<li>Welcome new students in slack</li>\n<li>Give students feedback on their case studies in Notion and Figma</li>\n<li>Comfortably facilitate office hours for students to ask questions and learn together</li>\n<li>Comfortably facilitate design crits for students to give feedback</li>\n<li>Open to having 1:1 sessions with students who need help</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Fluent in English - <em>It's the language we teach in.<br></em></li>\n<li><em>Available to work two full days a week on <strong>Tuesday</strong> &amp; <strong>Thursday</strong> </em></li>\n<li><em>Based in America as you'll be supporting Bootcamps in this timezone</em></li>\n<li>Confident in recording feedback Loom videos for students</li>\n<li>Confident in giving feedback for UX/UI Design</li>\n<li>Confident in using Notion and Figma to teach students cool tips and tricks to optimize their work</li>\n<li>Strong organizational skills along with the ability to collate students' work</li>\n<li>Positive self-starter with ambition and desire to help others learn 🥳</li>\n<li>Open to progressing into a remote teacher who travels the world sharing their knowledge and designing 🎉</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Competitive daily salary</li>\n<li>Work with a super friendly team around the world</li>\n<li>Fully remote role; travel is very much encouraged!</li>\n</ul>\n"}, {"id": 1009621, "url": "https://remotive.io/remote-jobs/all-others/project-data-assistant-1009621", "title": "Project Data Assistant", "company_name": "Everlight Solar", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-12-01T17:40:46", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Everlight Solar is seeking a data-minded individual to be an assistant to our Solar Project Manager. Our project managers and assistants oversee and coordinate the entire process for company projects, assisting customers, team members, and contractors, ensuring that each project is completed in a timely manner with high-quality results. This will be a full-time, work-from-home \"remote\" position.</p>\n<p><strong>This is a role for Apple power-users, must know iWork and be skilled with iOS and macOS.</strong></p>\n<p>Everlight Solar is a rapidly growing company and the leader of solar energy in Wisconsin. We offer a unique experience that fosters individual growth and rewards performance. Our culture at Everlight is extremely important to us. The work environment is fast-paced and dynamic. We value teamwork, quality, innovation, and customer success. Our ideal candidate is self-motivated, detail-oriented, has excellent problem-solving abilities, is passionate about delivering results on-time, exceeding expectations, and ensuring success for our teams.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Validates expectations with customers before, during, and after project completion.</li>\n<li>Exceeds customer expectations on a regular basis while performing excellent customer service.</li>\n<li>Successfully manages multiple projects through all phases.</li>\n<li>Ability to work independently under pressure, to organize and prioritize workloads, and to keep several projects progressing to completion with little or no direction.</li>\n<li>Ability to weigh options, foresee consequences, and employ good judgment.</li>\n<li>Serves as a liaison between field technicians, department management, government bodies, and customers.</li>\n<li>Use independent judgment to handle and troubleshoot all inquiries, questions, and complaints.</li>\n<li>Proactively completes projects on time.</li>\n<li>Reviews and oversees completed plans and project documentation for accuracy.</li>\n<li>Monitors equipment production to ensure product integrity.</li>\n<li>Consistently meets the overall project deadlines in a timely manner.</li>\n<li>Builds trust and confidence with contractors and the Project Management Team.</li>\n<li>Assists with managing multiple subcontractors across multiple states.</li>\n<li>Recruits and develops business relationships with new subcontractors.</li>\n<li>Drives sales and profitability through effective and efficient project execution.</li>\n<li>Understands principles and methods for showing, promoting, and selling products or services. This includes marketing strategy and tactics, product demonstration, sales techniques, and sales control systems.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Excellent organizational and time management skills.</li>\n<li>Excellent communication and interpersonal skills; both written and verbal.</li>\n<li>Extraordinary commitment to the highest level of customer service.</li>\n<li>Ability to work well with customers in verbal and in written communication.</li>\n<li>Remains calm when dealing with an upset or angry customer and listens to their concerns/questions.</li>\n<li>Positive, outgoing, energetic team player that enjoys working in a collaborative team environment.</li>\n<li>Must be fluent with the Apple ecosystem of software (iOS, macOS, iWork, etc.).</li>\n<li>Proven ability to function in all phases of the project development, from sales proposals and design, through project completion and closeout.</li>\n<li>Knowledge/Proficiency in Microsoft Office programs.</li>\n<li>Knowledge /Proficiency in Salesforce.</li>\n<li>Demonstrated sense of urgency and ownership in all assignments.</li>\n<li>Ability to collaborate closely with other team members on a wide variety of projects.</li>\n<li>Prepares timely and accurate paperwork.</li>\n<li>Participates in marketing activities and business development efforts.</li>\n<li>Experience with Solar.</li>\n</ul>\n<p>The successful candidate will be versatile in all areas of project management and sales support. They will be able to multi-task and will have experience working in a highly collaborative environment. Candidates must have strong leadership skills and work ethic. They must be able to thrive in a strong, dynamic team environment. Project Managers require help as they investigate and find potential new projects and sales opportunities while ensuring that every step of the quote, scheduling, and fulfillment process of the company's projects are executed flawlessly. This position is responsible for the overall success of the projects they manage and will be required to be the day-to-day contact person for their clients.</p>\n<p>Everlight Solar is proudly an equal opportunity employer. We invite veterans, people with disabilities, ex-cons, people from all ethnic backgrounds, age groups (18+), and levels of education to apply. Authorized to work in the US and background check required.</p>\n<p><strong>Salary range: $22,000-$30,000/ year</strong></p>\n"}, {"id": 1009084, "url": "https://remotive.io/remote-jobs/all-others/developer-relationship-lead-1009084", "title": "Developer Relationship Lead", "company_name": "Sylvera", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-30T13:41:11", "candidate_required_location": "UK Only", "salary": "", "description": "<p><strong>What is Sylvera anyway? ‍👩‍👨🌳</strong></p>\n<p>In less than a year, Sylvera has built partnerships with the world-leading carbon exchanges, first-class academic institutions, secured investment from Europe’s top VC fund, and built an extraordinary team.</p>\n<p>Sylvera is bringing transparency to the opaque voluntary carbon markets by using satellite data and machine learning algorithms to accurately assess the impact of carbon offset projects. This transparency will catalyse exponential growth in a market which is critical to addressing climate change.</p>\n<p> </p>\n<p><strong>What will I be doing? ‍‍👩‍💻👨‍💻</strong></p>\n<p>As Developer Relationship Lead, you will be responsible for originating and nurturing partnerships with voluntary carbon offset developers operating around the world. You will act as the face of Sylvera to the project developer community, tasked with building our reputation within the market. Success in this role will result in close collaboration between Sylvera and developers, providing us with the access to better understand the projects we’re rating. Day-to-day, you will take ownership of outreach and communication, develop scalable interaction processes, and work cross-functionally with the Ratings and Commercial teams to further Sylvera’s mission.</p>\n<p> </p>\n<p><strong>What do I need? 🧠💚</strong></p>\n<ul>\n<li>Background in VCMs - either as a developer, broker, verifier or financier</li>\n<li>Client-facing experience, with an affinity for relationship building</li>\n<li>A history of working cross-functionally in a dynamic environment</li>\n<li>Accustomed to breaking complex concepts into digestible ideas and effectively communicating them to others</li>\n<li>An ability to implement scalable processes, and leverage tools to multiply your output</li>\n<li>Experience building and managing a team</li>\n<li>Care deeply about the climate and the ecosystems of the earth</li>\n</ul>\n<p> </p>\n<p><strong>Benefits 💰</strong></p>\n<ul>\n<li>Equity in a rapidly growing startup</li>\n<li>Tech needed to do your job</li>\n<li>25 days holiday + your birthday off</li>\n<li>Christmas shut down period (PM 24th December 2021, returning to work 2nd Jan 2022)</li>\n</ul>\n<p>Coming Jan 2022</p>\n<ul>\n<li>Unlimited annual leave</li>\n<li>Enhanced Mat/Pat leave</li>\n<li>Monthly Team Lunches</li>\n<li>Up to 20 days paid sick leave</li>\n<li>£500 (gross) WFH allowance</li>\n<li>Access to Mental Health support</li>\n<li>Monthly team social budget.</li>\n</ul>\n<p> </p>\n<p><strong>Location</strong> 🌍</p>\n<p>Remote (with access to an office in London if you wanted to come in)</p>\n<p> </p>\n<p><strong>What if you’re a partial fit?</strong></p>\n<p>We prioritise grit, positivity, and the willingness to get stuck in, and encourage you to apply even if your experience doesn't exactly match this job description.</p>\n<p><strong>Equal employment opportunity</strong></p>\n<p>Sylvera is an equal opportunity employer: we value diversity. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n"}, {"id": 1003795, "url": "https://remotive.io/remote-jobs/all-others/developer-relations-b2b-1003795", "title": "Developer Relations (B2B)", "company_name": "Thingthingltd1", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-29T09:41:29", "candidate_required_location": "+/- 2h Europe CET Timezone", "salary": "", "description": "<div class=\"h1\" dir=\"ltr\">Who we are</div>\n<p dir=\"ltr\">Thingthing Ltd. is a 5 years old startup helping users elevate their typing experience on smartphones thanks to the Fleksy keyboard, one of the world's most popular virtual keyboards. The company also serves dozens of small, medium, and large companies worldwide thanks to the powerful Fleksy SDK, which has grown significantly in the past year. You’ll be part of a fully remote team with HQ in Europe. Fleksy is looking for amazing personalities &amp; outstanding talent to join its fast-growing company within a dynamic work environment. Fleksy is growing fast and we hope you can join our team soon!</p>\n<div class=\"h1\" dir=\"ltr\">The role</div>\n<p dir=\"ltr\">We are looking for a friendly person who loves to<strong> communicate with Developers every day and nurture a vast network of Developers, Engineers, globally. We expect from you to create a vibrant ecosystem of 3rd party developers, by being the interface between those developers and Fleksy's products, engineering, and design teams. </strong>This is an opportunity to join a team of talented engineers and product professionals. Through your work, you will contribute significantly in providing great content that educates our audience and leads to more business. </p>\n<div class=\"h1\" dir=\"ltr\">What will you be doing?</div>\n<ul>\n<li>Creating code examples and working on proofs of concept “to showcase what crazy ideas you can build with our API and our tools.”</li>\n<li>Amplifying documentation, looking for the right examples, messaging and languages for audiences served.</li>\n<li>Writing blog posts about the platform and new features, responding to interviews.</li>\n<li>Internal advocacy, which he describes as giving feedback to the product and customer success teams, and then helping release and iterate on new features.</li>\n<li>Speaking at industry events.</li>\n<li>Community: Meetups, forums, Github and Slack communities, monitoring social media for what people are saying about the brand, helping people talk about their own success with the brand, working with integration partnersDistill complex, technical topics and turn them into easy-to-understand documentation.</li>\n</ul>\n<ul>\n<li>Develop documentation to support the team(s) with ongoing initiatives and programs.</li>\n<li>Write, review, edit, &amp; organize new and existing content for Fleksy SDK.</li>\n<li>You will make edits to existing content in an effort to improve readability, SEO, accuracy, and keep the content up-to-date overall.</li>\n<li>Be responsible for the end-to-end documentation process, including writing, editing, reviews, and publication.</li>\n</ul>\n<ul>\n<li>You will work with product, engineering and support teams to obtain an in-depth understanding of our products.</li>\n<li>You will conduct research on industry-related topics and need to stay up-to-date with the latest trends.</li>\n<li>You will write engaging, easy-to-understand and accurate content addressing SEO requirements.</li>\n<li>You will work with design to enrich content with illustrations.</li>\n</ul>\n<div class=\"h1\" dir=\"ltr\">Top Skills Required</div>\n<ul>\n<li>Communication</li>\n<li>Empathy</li>\n<li>Technical knowledge</li>\n<li>Quick learner</li>\n<li>Approachable</li>\n</ul>\n<div class=\"h1\" dir=\"ltr\">What can you expect?</div>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Competitive compensation package (30k€ - 60k€ yearly gross salary) + stock option plan</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Paid 24 days off per year</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Company perks to help you work better and grow personally</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Flexible remote work</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Bi-annual team building activities</p>\n</li>\n</ul>\n<p> </p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">+/- 2h Europe CET Timezone.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">3+ years of experience with Developer Relations, creating Content, Technical writing and editing, in particular with developer documentation.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Strong technical writing skills and attention to detail.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Fluency in English. You will need to be able to effectively write and communicate in English, respectfully, and professionally. You can proofread your work.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">You have solid experience in creating well-structured content, in a conversational tone to guide beginners and more advanced users. You understand the importance of SEO and how to address it through your content writing.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Ability to work with geographically distributed team members and developers.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Understanding of source control systems and maintaining multiple versions of content</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Understanding of the software development life cycle and ability to learn product and technical concepts quickly</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Structured and autonomous.</p>\n</li>\n</ul>\n<div>If you don’t meet 100% of the above qualifications, you should still seriously consider applying. Studies show that you can still be considered for a role if you meet just 50% of the role’s requirements.</div>\n"}, {"id": 1003106, "url": "https://remotive.io/remote-jobs/all-others/supplier-development-manager-1003106", "title": "Supplier Development Manager", "company_name": "Axya", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-28T05:45:14", "candidate_required_location": "Canada Only", "salary": "", "description": "<p>Job Type: Full Time: Full Time, in a Company with Major growth, that is fully remote. Let's talk!</p>\n<p>Location: Remote (HQ currently in Montreal)<br>Expected Start Date: ASAP<br>Salary: 60k$-80k$ based on experience<br><br><strong>The Challenge<br></strong><br>Axya is looking for a an innovative and structured problem solver with a mechanical engineering background. The candidate must have experience that relates to the supplier side (companies that fabricate goods and quotes on RFQs) of the industry in which Axya is currently operating : the north-american metal manufacturing industry. <br><br>We are looking for candidates with experience such as supplier development engineer within a large organization, supplier operations and management (quoting, fabrication, management,...) etc. The candidate would work in the Network Engineering department whose main goal is to support and build the supplier side of our network and find opportunities through network data analytics and customer research to increase the value we deliver to our customers (analytics and strategy).</p>\n<p> </p>\n<p><strong>The main goal of this job </strong>will be to focus on structuring and operating (with the help of the rest of the team) the supplier development pipeline/strategy to add new qualified suppliers within our network. With that comes the monitoring and management of the current supplier network to maximize their perceived value of Axya.<br><br>The candidate would also collaborate with other departments, such as sales, product and marketing to transfer insights and structure action plans.</p>\n<p>We are a fast-growing technology start-up company. Our product is an online platform that connects buyers and suppliers working in the manufacturing industry.</p>\n<p>More than 700 companies use the Axya platform. The platform is in constant development and artificial intelligence projects are currently underway.<br><br>Tasks involved:</p>\n<ul>\n<li>Understanding and improving the current supplier development strategy and pipeline : Monitor KPI, Dispatch operations to other teammates to attain objectives, propose new strategy to attain KPIs, etc.</li>\n<li>Monitor and analyse the network through data activity dashboards on a weekly basis to understand supplier behavior, flag opportunities and be proactive in understanding/predicting those behavior.</li>\n<li>Analyse fundamental problematics, understand root cause and think of a strategy to validate an opportunity by doing customer research, fast (lean) prototyping, etc.</li>\n<li>Once an opportunity is well defined and minimally validated, develop more structured processes to manage the operations more efficiently and on a larger scale. The next step is often to document the opportunity and the current manual processes in place by the department to transfer knowledge to other department such as the product department to think of a way to scale things.</li>\n<li>Also some customer facing and operational responsibilities such as operating processes and improving them, answering customer requests, etc. for our supplier network.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>Must-have</strong></p>\n<ul>\n<li>Fluent in French and English for both speaking and writing</li>\n</ul>\n<p><strong>What do you need to succeed?</strong></p>\n<ul>\n<li>In depth understanding on how suppliers operate in the north-american metal manufacturing industry</li>\n<li>Solid knowledge of the manufacturing industry [materials, manufacturing processes, certifications, standards, limitations of processes, realities of the industry etc.]</li>\n<li>Ability to support technical manufacturing projects: understanding of technical drawings, understanding supplier requests, assessments of the manufacturability of parts, recommendations upon decision making, etc.</li>\n</ul>\n<ul>\n<li>Mechanical Engineering background</li>\n<li>Autonomous, well organized and strong sense of initiative</li>\n<li>Strong data analytics and strategic thinking</li>\n<li>Fast learner who is tech-fluent</li>\n</ul>\n<p><strong>Good-to-haves:</strong></p>\n<ul>\n<li>Industry experience</li>\n<li>Customer Service Experience</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>Why be part of our team?</p>\n<ul>\n<li>Unlimited vacation policy</li>\n<li>Group employee insurance program</li>\n<li>Work at any time you want from wherever you want</li>\n<li>Join a dynamic and highly collaborative team</li>\n<li>Continuous training and professional development</li>\n</ul>\n<p>About Axya</p>\n<p>Axya is an innovative technology company that standardizes, automates, and centralizes the subcontracting process for buyers and suppliers in the manufacturing industry. It has developed the best technological solution for all companies that have manufacturing needs or capabilities in CNC machining, sheet metal, and welded assembly. All this to make the process easier, faster, and less expensive than the traditional method.<br><br>**Axya is an equal opportunity employer and encourages applications from Indigenous peoples, persons with disabilities, members of visible minority groups, and women.</p>\n"}, {"id": 1002751, "url": "https://remotive.io/remote-jobs/all-others/logistics-coordinator-transportation-1002751", "title": "Logistics Coordinator, Transportation", "company_name": "Olaplexcareers", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-26T21:41:18", "candidate_required_location": "", "salary": "", "description": "<p>Olaplex is revolutionizing the haircare industry through a patented, proprietary technology that protects and repairs hair from damage. We’ve paved the way for a completely new category of hair care and, due to an overwhelming support from the brand’s loyal stylist and advocate base, the company has emerged as one of the largest independent hair care brands in the world.</p>\n<p>Olaplex has been able to achieve phenomenal growth and we continuously seek exceptionally talented individuals who can support our innovation and creativity. We currently operate in a fully remote environment; because of this, collaboration and flexibility are at the core of our commitment to each other and to the success of Olaplex.</p>\n<p>The Coordinator of Logistics supports the execution of day-to-day logistics operations to maintain efficient movement of inventory between Olaplex’s seven global warehouses, contract manufacturers and vendors. They monitor operations, provide shipment visibility and support the implementation of logistics processes to improve service and reduce costs.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Partner with 3PL teams on booking, monitoring of Inbound and Outbound ocean container shipments and communication of shipment reporting.  </li>\n<li>Assist in the flow of inventory by monitoring 3PL shipment accuracy, availability, documentation accuracy and reporting.  </li>\n<li>Review and track Logistics invoices. Perform periodic invoice audits to ensure accuracy of charges against standard and budget.</li>\n<li>Review new customer’s guides to ensure all shipping requirements are identified and can be met. Partner with teams to develop standard operating procedures for each customer.</li>\n<li>Manage execution, monitoring, reporting of transfer orders and complete inventory receipts in NetSuite.</li>\n<li>Assist with process development to analyze and evaluate 3PL performance metrics.   </li>\n<li>Partner with 3PL / customers on transportation claim submissions and resolutions.</li>\n<li>Assist with month end accruals.  </li>\n<li>Partner with the Customer Support, Transportation, Procurement and eCommerce teams to plan and prioritize logistics activities.  Assist with resolution of any service issues related to logistics operations.</li>\n<li>Assist with coordination of 3PL special projects.</li>\n<li>Periodically visit 3PL locations to inspect operations.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>Bachelor’s degree preferred - in Business/Logistics/Distribution.</li>\n<li>2+ years of related supply chain experience (Logistics, Warehousing, or Distribution) in a CPG environment with experience managing 3PL.</li>\n<li>Strong Excel skills required. Experience with NetSuite preferred.</li>\n<li>Able to consider the impacts of decisions on the customer, ensuring that any changes will improve and elevate the customer experience.</li>\n<li>Organized with the ability to balance multiple priorities at once and manage time appropriately.</li>\n<li>Detail-oriented with strong analytical and problem-solving skills.</li>\n<li>Strong and effective written and interpersonal communication skills.</li>\n<li>Ability to work cohesively with multiple teams and build strong relationships with our internal and external partners.</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Work/Life Balance: Remote work environment, unlimited time off, 11 paid holidays, and flexible work schedules.</li>\n<li>Wellness: Medical, dental, and vision insurance for employees in addition to short- and long-term disability coverage and life insurance.</li>\n<li>Financial Well-being: Roth and 401k plans.</li>\n<li>Products: Fourteen (14) free products per year, plus a friends and family discount.</li>\n<li>Culture: Our team has an “attitude of gratitude” and a shared passion for our brand. We are a fast-paced, high-growth company where career opportunities can be endless.</li>\n</ul>\n<p><strong>Our Commitment to Diversity, Equity, and Inclusion:</strong></p>\n<p>At Olaplex, we support and stand up for our community with our talent, content, messages, and product offering. We strive to build and nurture a culture where a focus on diversity, equity, and inclusion is instinctive. Our deep sense of passion and pride in what we do, both as individuals and as a company, unifies our shared commitment to 'do well and do good'. We recognize and celebrate different ideas, perspectives, and backgrounds and know they create a stronger and more creative work environment.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n"}, {"id": 1003303, "url": "https://remotive.io/remote-jobs/all-others/saas-e-learning-and-training-manager-1003303", "title": "SaaS E-Learning and Training Manager", "company_name": "Gatekeeper", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-25T17:44:11", "candidate_required_location": "UK Only", "salary": "", "description": "<p><a class=\"external\" href=\"https://www.gatekeeperhq.com/\" rel=\"nofollow\">Gatekeeper</a> is a SaaS-based, next-generation Contract Management Solution. We help our customers to reduce risk, improve compliance and maximise value.</p>\n<p>Due to our strong global growth, we are looking for a hands-on and experienced eLearning &amp; Training Manager to own and develop the Gatekeeper Academy, an educational platform within Gatekeeper. The Academy is designed to maximise product expertise, while ensuring the successful onboarding of new staff and customers.</p>\n<p>As our eLearning &amp; Training Manager , you will be tech savvy and passionate about continuous learning and development. You will have the ability to effectively engage learners and to create impactful, customer-centric educational content.</p>\n<p><em>Note: This is a fully remote position open to candidates based in the UK/Europe</em></p>\n<p>In this role you will:<br><br></p>\n<ul>\n<li>Create training modules and learning resources to drive knowledge of Gatekeeper software features for our internal teams and customers</li>\n<li>Select the most effective delivery methods for each area of learning, combining resources such as video, demos and practical exercises, including the selection of a Learning Management System (LMS)</li>\n<li>Have overall responsibility for the LMS, including system, people, security, course and content management</li>\n<li>Deliver live and recorded Webinar training</li>\n<li>Oversee the successful completion of Gatekeeper Academy modules and accreditation of all new team members</li>\n<li>Monitor the progress of new Gatekeepers, delivering feedback and using expert coaching skills to ensure that learning outcomes are achieved</li>\n<li>Collaborate with the Product team to develop and update all training materials to ensure the content remains up to date with our ever changing product.</li>\n<li>Continuously evaluate the success of Gatekeeper Academy, adapting and making improvements where needed</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Tech/Software background, SaaS experience highly desirable</li>\n<li>A self-starter, with experience creating learning programmes and driving product knowledge</li>\n<li>Highly analytical, with a focus on continuous improvement and best practice</li>\n<li>Experienced in the use of e-Learning technologies, LMS solutions and developing resources for remote learning</li>\n<li>The ability to adapt materials for technical and non technical audiences</li>\n<li>Excellent communication skills, verbal and written</li>\n<li>Strong project management skills</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Generous remuneration</li>\n<li>Flexible working hours: design your work schedule to match your lifestyle</li>\n<li>100% remote working: live and work wherever you like - no more commutes</li>\n<li>Learning &amp; Development opportunities for lifelong learners</li>\n<li>Technology: we provide everything you need to do your best work</li>\n<li>Generous holiday policy</li>\n<li>Monthly get fit and healthy budget</li>\n<li>Gatekeeper retreats</li>\n</ul>\n<p>We live by our company <a class=\"external\" href=\"https://www.gatekeeperhq.com/vision_and_values\" rel=\"nofollow\">vision and values</a>. If these ring true to you, then we’d like to talk to you.</p>\n<p>Gatekeeper offers a diverse and multicultural working environment, currently spanning 15 countries. We respect each other’s differences and welcome candidates from all backgrounds.</p>\n"}, {"id": 1002874, "url": "https://remotive.io/remote-jobs/all-others/docker-and-devops-teaching-assistant-coding-instructor-1002874", "title": "Docker and DevOps Teaching Assistant | Coding Instructor", "company_name": "Nucamp", "category": "All others", "tags": [], "job_type": "contract", "publication_date": "2021-11-24T17:40:23", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Nucamp (<a href=\"https://www.nucamp.co/community/on/online-pacific\" rel=\"nofollow\" target=\"_blank\">www.nucamp.co</a>) the #1 Coding Bootcamp in the US is seeking part-time instructors / teaching assistants (TA) specialized in <strong>Docker and DevOps Teaching Assistant</strong> for its <strong>Backend with Python and SQL bootcamp</strong> in the Online Pacific Timezone.</p>\n<p>Every day bring your passion to help students achieve their goal to become a developer. Our business is built upon helping communities succeed; your passion to deliver the best learning experience in the classroom is the first prerequisite for teaching with Nucamp.</p>\n<p>As an instructor / teaching assistant for Nucamp, you will look after a classroom maximum of 12 students in a blended environment mixing self-study and live workshop experiences - all online. This is the perfect position for someone interested in community development through education while supplementing his / her income. You will be supporting adult students of diverse careers, educational backgrounds, and cultures to learn the awesome world of programming.</p>\n<p>Nucamp's mission is to offer affordable learning programs for professional adults seeking the skills they need for the career they want. We are bringing together professionals, students and offering a great curriculum and pedagogy structure to make it happen. You can play a significant role in helping your community, while also earning income and enhancing your resume.</p>\n<p><strong>Your Responsibilities: <br></strong></p>\n<ol>\n<li>During the week, spend 30-60 minutes a day engaging with students, answering their questions, and helping with their learning journey while they watch video lectures and perform exercises. This will be done online, at any time, from anywhere.</li>\n<li>At the end of the week (Saturdays), spend 4 hours delivering online workshops. Grade the student's weekly assignments.</li>\n<li>Keep students motivated to complete their learning journey; be very responsive to individual student needs.</li>\n</ol>\n<p><strong>Skills:</strong></p>\n<ol>\n<li>We're seeking individuals with 2+ years of knowledge in <strong>Docker and DevOps Teaching Assistant</strong>, as well as knowledge of <strong>Docker, AWS, GitHub Actions.</strong></li>\n<li>These additional skills will be a plus: <strong>Azure, Google Cloud, Kubernetes.</strong></li>\n<li>Teaching experience is highly desired.</li>\n</ol>\n<p><strong>Job Details:</strong></p>\n<ol>\n<li>Part-time Independent Contractor.</li>\n</ol>\n<p> </p>\n"}, {"id": 1002678, "url": "https://remotive.io/remote-jobs/all-others/knowledge-management-specialist-1002678", "title": "Knowledge Management Specialist", "company_name": "Fulfil.IO", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-23T13:41:29", "candidate_required_location": "Canada Only", "salary": "", "description": "<p dir=\"ltr\">Our knowledge management specialist will own and maintain a wide variety of training and documentation material. You will be responsible for ensuring our users and internal teams adopt Fulfil successfully by creating in depth training and technical documentation. You will continually drive our published works to be consistent with product updates and feature releases. Your work will empower Fulfil product users to gain exceptional knowledge of industry best practices and e-commerce operations.</p>\n<p dir=\"ltr\">This is a highly cross-functional role; you'll work closely with Fulfil’s merchants to uncover their business goals, and create knowledge paths that inform them on the best ways to use Fulfil to achieve them. Internally, you’ll work closely across Fulfil’s product, support, and success teams ensuring our merchants and staff achieve maximum value. The support team is the foundation of everything we do at Fulfil, and we take the role of supporting our merchants seriously. You’ll be at the forefront of driving the quality service our merchants deserve. We're looking for someone who truly believes in the merchant experience and knows what it takes to drive performance at all levels.</p>\n<p> </p>\n<div class=\"h3\">What You’ll Do:</div>\n<ul>\n<li>Empathize with every aspect of the merchant experience, putting merchant’s needs first and championing their issues within the org.</li>\n<li>Empower teams across Fulfil to create, own, and maintain content</li>\n<li>Develop product expertise as a Fulfil user and teacher</li>\n<li>Examine Zendesk tickets looking for common questions that documentation could help answer, and then develop that documentation</li>\n<li>Perform research into the analytics of our documentation in order to identify knowledge gaps and opportunities for improvement</li>\n<li>Collaborate with senior leadership to roll out new training helping people navigate the implementation and use of Fulfil as a tool effectively</li>\n<li>Create and maintain an internal style guide which will ensure cohesion for your team’s approach to documentation</li>\n<li>Interact regularly with appropriate managers and team members regarding publishing and editing activities, and work to ensure appropriate deadlines are always met</li>\n<li>Do what it takes to help our merchants and our teams grow as a competitive differentiator in the ERP market</li>\n<li>Write exceptional documentation that allows our merchants to learn on their own time and help themselves. Record tutorials and use product snapshots to enhance that experience!</li>\n<li>Work with the Fulfil senior leadership team to manage and contribute to the effective rollout and adoption of new initiatives across Customer Support</li>\n<li>Define best practices and streamline our customer support processes by designing and creating enablement curricula such as playbooks, presentations, videos, and other interactive course material</li>\n<li>Proofread and edit documents for grammar, spelling, and clarity</li>\n<li>Perform periodic audits of our published material to ensure they are consistent with product updates and releases</li>\n<li>Work with the product team to test our feature releases and document changes in process/workflow</li>\n</ul>\n<div class=\"h3\">We’re Looking for Someone With:</div>\n<ul>\n<li>College Diploma in Publishing, Technical Writing or equivalent experience</li>\n<li>Demonstrated strong writing skills, not just with spelling and grammar, you'll need to be able to break down complex processes and explain them in a way that accelerates non-technical customers' adoption of Fulfil.</li>\n<li>Self-discipline, focus amongst the chaos, and the ability to thrive in an autonomous remote work environment. (We’d love to find someone with previous experience in customer support!)</li>\n<li>The ability to get granular with the details and seek additional context. Detailed documentation is important. We want you to be able to communicate these clearly along with best practice.</li>\n<li>Hands on experience writing in markdown and working with project management tools</li>\n<li>Strong project management and cross-functional collaboration skills, you are a task-management expert! There are only so many hours in a day and you’re able to identify the best use of that time. Critical work prioritization skills are a must.</li>\n<li>A proactive mindset capable of creating a long-term vision, with a monthly/weekly plan and shipping velocity in days</li>\n<li>Strong interest in technology and learning</li>\n</ul>\n<div class=\"h3\">Nice to Haves:</div>\n<ul>\n<li>Prior experience at a growth stage Internet/Software company</li>\n<li dir=\"ltr\">Previous experience in ecommerce </li>\n<li dir=\"ltr\">Knowledge of support methodology and process, and experience using Zendesk</li>\n<li dir=\"ltr\">Experience with e-commerce technologies like Amazon or Shopify Plus</li>\n<li dir=\"ltr\">A sense of adventure and an entrepreneurial spirit</li>\n<li dir=\"ltr\">Familiarity with Github and markdown </li>\n<li dir=\"ltr\">Published work we can check out!</li>\n</ul>\n<div class=\"h3\">About Us:</div>\n<p>Fulfil.io helps high growth, high volume merchants simplify operations and scale for growth. With the rise in omnichannel commerce, Fulfil was founded with the simple idea that merchant operations need to be simplified in order to deliver amazing retail experiences. Fulfil enables businesses to turn their back-office operations into an accelerator for growth by integrating order management, inventory management, warehouse management, vendor/supplier management, wholesale, manufacturing, financials and customer service, into one seamless solution. We believe merchants should love their operations platform, and we work hard to make that happen every single day. Fulfil.io is a trusted solution for brands like Nectar Sleep, Mejuri, Lie-Nielsen Toolworks, and many more.</p>\n<p>Fulfil.io is a venture-backed technology company with offices in Toronto,Canada and Bangalore, India. The team is made up of people who want to feel challenged at work, be the best at their craft and learn from one another. We come from different backgrounds and experiences, all passionate about the work we do, the team we do it with, and the customers we do it for. Join us in our journey to simplify operations and empower merchants around the world!</p>\n<p> </p>\n<p> </p>\n"}, {"id": 996413, "url": "https://remotive.io/remote-jobs/all-others/vehicle-assessor-996413", "title": "Vehicle Assessor", "company_name": "carsales", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-22T05:42:13", "candidate_required_location": "Australia Only", "salary": "", "description": "<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p><strong>Curious to grow? Join a team that’s passionate about making buying and selling a great experience.</strong></p>\n<p>Together with carsales this is your opportunity to join our exciting RedBook Inspect team. Reporting to the Remote Operations Manager, you will be conducting Remote Video Assessments with clients across Australia from the comfort of your home.</p>\n<p>We are open to location for this role, you could be based in Melbourne, Sydney, Perth or Brisbane.  </p>\n<p><strong>What’s on offer</strong></p>\n<ul>\n<li>We’re a certified Great Place to Work, Family Friendly Workplace and WGEA Employer of Choice.</li>\n<li>Support of a highly engaged, high-performing team. We have incredible talent in carsales that you will learn from.</li>\n<li>18 weeks paid parental leave for primary caregivers, four weeks paid secondary caregivers leave, six weeks paid gender transition leave.</li>\n<li>Regular Hackathons, endless learning and development opportunities, and a range of activities that will help support your mental, emotional and physical wellbeing.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong>What you’ll be doing</strong></p>\n<ul>\n<li>Completing Remote Video Assessments and generating reports on our purpose-built digital app. </li>\n<li>Understand and share expertise in both retail and business clients across a wide range of motor vehicles.</li>\n<li>Contacting customers to book in RVA’s and liaising with owners, sellers and buying customers about assessment reports.</li>\n<li>Responding to emails and phone calls promptly, in a professional manner using your strong verbal and written communication skills.</li>\n<li>Monitor the progress of bookings throughout the day, pre-empting and/or problem-solving any issues before or as they arise to create the best outcome and turnaround times for the customer.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<p><strong>What we are looking for? </strong></p>\n<ul>\n<li>Experience in the automotive industry is desirable, ideally working with a large range of motor vehicles or caravans.</li>\n<li>A can-do, proactive work ethic and a result driven mindset – you’re happy to get involved with any task required to get the job done.</li>\n<li>We are a customer centric business so you will share this passion too and provide an exceptional level of service for our customers.</li>\n<li>High level attention to detail and fault-finding experience.</li>\n<li>Familiar with Apple iOS and Android Systems desirable.</li>\n<li>Ability to work well autonomously, keeping busy and value-add during quiet periods.</li>\n<li>Precise data entry skills.</li>\n<li>Ability to meet deadlines and use initiative, problem-solve and think on your feet.</li>\n<li>Demonstrate inclusive and interpersonal attributes that connect you to our behaviours (we change the game, we own it, we step in, we are curious, we don’t take ourselves too seriously).</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p><strong>A few other things we want to let you know about...</strong></p>\n<p>carsales is an equal opportunity employer who prides themselves on fostering a diverse and inclusive workplace. We encourage everyone of all ages, genders and backgrounds to apply. If you’re a candidate with a disability or you’ll need some adjustments to be at your best, let us know how we can provide you with additional support.</p>\n<p>We know how important keeping that balance between work/life is and have a range of flexible working options on offer, including part time. We are open to this conversation during our recruitment process if you want to know more just ask!</p>\n<p>We are a proud Circle Back Initiative Employer which means we are committed to responding to every job applicant.</p>\n<p>Successful candidates joining the carsales family are required to undergo a National Police Record check and must have full-time Australian working rights on an ongoing basis.</p>\n"}, {"id": 995674, "url": "https://remotive.io/remote-jobs/all-others/sw-development-manager-995674", "title": "SW Development Manager", "company_name": "ManpowerGroup Greece", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-21T01:40:51", "candidate_required_location": "Europe Only", "salary": "", "description": "<p><strong>ManpowerGroup Greece</strong>, on behalf of its client, a firm with an innovative Product, focused at Learning &amp; Talent Development, with thousands of clients all over the world, is looking for s SW Development Manager to join their Product Development Team. Worplace location: Thessaloniki (with remote options) or 100% Remote.</p>\n<p> </p>\n<p>As the Software Development Manager, you’ll manage all the activities of the software development group; set attainable goals to team members in order for the project to be finished on time; provide guidance to team members to encourage work productivity; make sure the timeline is followed by the software development group; manage multiple projects at once; ensure appropriate procedures and processes are followed when it comes to software development; represent the software department in meetings; participate in design control activities; monitor, evaluate and ensure the completion of tasks and projects; analyze software requirements; implement design plans, monitor status of developing software; review product requirements and specifications; participate in other areas of the software development process; and provide technical support to other company personnel</p>\n<p> </p>\n<p><strong>Responsibilities</strong></p>\n<p>You will both lead your team and execute across these activities:</p>\n<ul>\n<li>Support, mentor, and motivate your team</li>\n<li>Lead large-scope development projects with complex rollouts</li>\n<li>Build and execute productivity plans through forecast reviews, determining productivity requirements, and partnering with other Leaders to load balance</li>\n<li>Manage delivery promises with your team in the context of a larger central technology division</li>\n<li>Act as the liaison between your business unit product teams and all other business teams (e.g., product strategy, marketing, customer success, implementation managers, customer support) to develop plans to meet business objectives</li>\n<li>Manage software development within the context of the full software development lifecycle, including software requirements, design, development, debug, and test;</li>\n<li>Describe complex and diverse software development topics effectively.</li>\n<li>Provide technical oversight to team members. This will include leading design reviews, team meetings and program/customer meetings as needed.</li>\n<li>Prepare and manage man-power loading across the period of performance.</li>\n<li>Work with program, product, and functional management to align staffing needs with appropriation of assignments.</li>\n<li>Support the professional development of team members and ensure senior technical personnel knowledge share to more junior personnel.</li>\n</ul>\n<p> </p>\n<ul>\n<li>Bachelor’s degree (preferably in a Science, Technology, Engineering or Mathematics field).</li>\n<li>3+ years’ experience managing software development teams.</li>\n<li>Proven ability to translate technical jargon into clear guidance for business stakeholders.</li>\n<li>Demonstrated experience leading a team and ability to work effectively in a dynamic technical environment.</li>\n<li>Demonstrated ability to work to a schedule and meet deliverable dates.</li>\n<li>Proven expert in the software development life cycle (SDLC).</li>\n<li>Experienced establishing and working in an Agile framework.</li>\n<li>Able to operationally organize all aspects of the software development lifecycle to include requirements definition and design, use case development, software development, testing, and maintenance.</li>\n<li>Ensure documentation standards for software changes and ensures software standards are met.</li>\n</ul>\n<p> </p>\n<p>Salary &amp; Perks</p>\n<ul>\n<li>Competitive salary, plus bonus</li>\n<li>Free lunch (for office based employees)</li>\n<li>Free Physiotherapy sessions (for office based employees)</li>\n<li>Pleasing and Flexible Startup environment</li>\n<li>Extra days of annual leave</li>\n<li>Free access to Udemy courses</li>\n<li>Remote work up to 100%</li>\n</ul>\n"}, {"id": 993495, "url": "https://remotive.io/remote-jobs/all-others/senior-manager-product-solutions-993495", "title": "Senior Manager, Product Solutions", "company_name": "Bitwave", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-19T21:41:42", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>Context</strong></p>\n<p>Bitwave is an enterprise software and services company with the mission of bringing digital assets to enterprises. </p>\n<p><strong>Software Platform</strong></p>\n<p>We've built an enterprise software platform that enables enterprises to meet their digital asset/cryptocurrency specific accounting, tax, treasury, and management obligations. In most situations our platform is a subledger processing millions of digital asset transactions and producing accounting and tax reporting that integrate with our client's ERP.</p>\n<p><strong>Solutions/Services</strong></p>\n<p>Additionally we provide consulting services to our clients centered around the implementation of our software platform including: Digital Asset Industry POVs on various matters, Process, Risk and Controls Design, Implementation Program Management, Data, Reporting and Reconciliation Builds, Training/Change Management </p>\n<p>Our platform and solutions are delivered to close to 70 clients today.</p>\n<p> </p>\n<p>Desired Experiences and Qualifications</p>\n<p>We are looking for a candidate that uniquely combines (a) deep accounting subject matter expertise (b) professional services experience (c) tech/software and/or digital asset enthusiasm</p>\n<p>Client Focused</p>\n<ul>\n<li>Significant Experience in a professional services setting auditing and/or advising clients on accounting and/or tax issues</li>\n<li>Significant Experience researching technical accounting issues, interpreting GAAP, GAAS, IFRS, PCAOB standards, and producing accounting memorandum to support a POV on accounting matters and defending POV to leadership</li>\n<li>Significant Experience working with heads of financial reporting, Controllers, CAOs, CFOs and other finance leadership </li>\n<li>Interest in building and sharing thought leadership on accounting and/or tax matters in a new industry in unique space is a plus</li>\n<li>Interest in supporting clients in a customer success role</li>\n</ul>\n<p>Internal Focused</p>\n<ul>\n<li>Some experience with or desire to experience accounting and producing financial reporting for small businesses and startups is a plus</li>\n<li>Some experience with or desire to work in a startup environment is a plus</li>\n<li>Some experience with ERPs systems (e.g. Oracle, NetSuite, Quickbooks)</li>\n<li>Interest in cryptocurrency space is a plus</li>\n<li>Interest in building software for enterprises is a plus</li>\n<li>CPA Required</li>\n</ul>\n<p> </p>\n<p>Other Details</p>\n<ul>\n<li>Team: Product Solutions</li>\n<li>Title: Senior Manager, Product Solutions</li>\n<li>Reports to: VP of Product Solutions</li>\n<li>Direct Reports: None initially but expected to grow as we grow</li>\n</ul>\n"}, {"id": 990532, "url": "https://remotive.io/remote-jobs/all-others/field-applications-scientist-990532", "title": "Field Applications Scientist", "company_name": "SPT Labtech", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-18T17:41:30", "candidate_required_location": "USA Only", "salary": "", "description": "<p>We have an exciting opportunity for a Field Application Scientist specializing in genomics based in the Northeast USA. You will be part of a global FAS team that serves as the key interface between our Sales, Support, and Marketing teams. As an FAS, you will provide expert-level support for our liquid handling suite of products to end-users who are among some of the top labs and researchers across the country.</p>\n<p><strong>About us:</strong></p>\n<p>SPT Labtech is a global leader in innovative technological advancements in low-volume liquid handling, sample management, and sample preparation instruments. Applications where we excel include genomics, structural biology, assay development, drug discovery, and nanochemistry. We are known not only for our technological innovation, but also our outstanding customer service and support.</p>\n<p><strong>About the role:</strong></p>\n<p>This Field Application Scientist position will be filled by a personable scientist with a strong background in genomics, ideally with experience using our automation instruments to miniaturize traditional workflows. A working knowledge of high-throughput screening, drug discovery, assay development, structural biology, or nanochemistry is desirable.</p>\n<p>The role will require significant travel within the Northeastern USA, with occasional travel to other parts of the USA and to our UK headquarters. As such, you must be based near a convenient travel hub in the Northeast USA. Being that we are a global company, you will be working with colleagues from across multiple time zones and territories, requiring some flexibility in attending meetings outside traditional work hours. As our FAS team are home-based, you will have flexibility in your scheduled appointments with customers and colleagues, allowing you to balance your work and personal responsibilities.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Manage and run remote and in-person product and software demonstrations with customers</li>\n<li>Conduct pre-sales technical presentations and seminars in coordination with sales</li>\n<li>Maintain an expert-level knowledge of our product lines</li>\n<li>Provide applications-based training to customer/users and internally to sales and support</li>\n<li>Provide on-going applications support to end-users</li>\n<li>Nurture strategic collaborations to regularly deliver scientific content for marketing</li>\n<li>Collate customer feedback (product development, software, etc)</li>\n<li>Contribute to software and hardware development</li>\n<li>Contribute to conference strategy and attend conferences</li>\n<li>Maintain positive customer relationships</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>PhD in a Biological Science discipline or 5-years previous FAS experience in a related field</li>\n<li>At least 2 years’ practical experience working in genomics, HTS, assay development, or molecular/structural biology</li>\n<li>Practical experience with liquid handling instrumentation, protocol miniaturization, and automation, with prior experience using SPT Labtech automation instruments preferred</li>\n<li>Good understanding of genomics, drug discovery, and structural biology</li>\n<li>Ability and willingness to travel extensively (50% or more) and occasionally internationally</li>\n<li>Ability to work in the USA</li>\n</ul>\n<p> </p>\n<p>Our company culture supports diversity and is inclusive of all regardless of race, ethnicity, gender, gender identity, sexual orientation, physical ability, or family status, and we endeavour to support our employees' needs to the best of our ability.</p>\n<p><strong>Benefits</strong></p>\n<p>We offer highly attractive compensation package and comprehensive benefits, which includes 401K, and private healthcare. We will provide full training for the successful candidate which will take place in the US and at our headquarters in Cambridge, UK. Our company culture supports diversity and is inclusive of all regardless of race, ethnicity, gender, gender identity, sexual orientation, physical ability, or family status, and we strive to support our employees' individual needs to the best of our ability.</p>\n"}, {"id": 987251, "url": "https://remotive.io/remote-jobs/all-others/project-coordinator-987251", "title": "Project Coordinator", "company_name": "SwagUp", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-17T13:40:11", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>ABOUT US</strong></p>\n<p>Swag...everyone loves to receive it</p>\n<p>Whether it be welcoming new hires into their dream job, thanking customers for their loyalty, celebrating a community milestone, or engaging event attendees, when done right, swag is the glue that bonds brands together with the people that matter to them. But no one enjoys putting this stuff together...</p>\n<p>The $30 Billion branded swag supply chain is a complete mess, filled with too many products, too many intermediaries, too little quality control, and not enough technology.</p>\n<p>SwagUp is disrupting the industry by streamlining the end to end supply chain and making it available through a single platform utilizing powerful APIs and interfaces (e.g. dashboard). As the fastest growing swag company, we have made great strides towards our mission of eliminating the friction in the swag creation and distribution process. BUT we've just begun to scratch the surface…</p>\n<p>And that's where YOU come in...</p>\n<p><strong> </strong></p>\n<p><strong>MISSION</strong></p>\n<p>SwagUp is looking for a Project Coordinator to support our growing Sales team! The ideal candidate is a detail-oriented, high-output problem solver, who is passionate about our mission: Make creating and distributing impactful swag as simple as possible! This role is designed to help the Account Executive team deliver on client requests and improve the overall client experience. Our Project Coordinator must be able to think quickly and work in a fast paced environment. </p>\n<p>This is an entry-level position that will be the first step in a successful career path and entry way into a company that is building something special. This is an opportunity to get in the door, put in the time, develop new skills and use it as a launch pad for rapid career development.  You will be collaborating across multiple departments, so strong communication is key! We are a rapidly growing company without a lot of defined processes and are looking for self-starters to help get the job done. If that sounds like you, grab your helmet and join us to the moon!</p>\n<p> </p>\n<p><strong>RESPONSIBILITIES</strong></p>\n<ul>\n<li>Administrative duties related to client orders, such as building packs, replacing out of stock items, and issuing reorders</li>\n<li>Effectively communicate and manage any design requirements to our Design team </li>\n<li>Support the Project Management team on key initiatives for large scale client projects</li>\n<li>Work alongside our Procurement team to ensure all projects can be completed as outlined and within timeframes</li>\n<li>Directly communicate with clients as needed regarding order logistics and product details</li>\n<li>Partner with the Operations team on client requests and active orders.</li>\n<li>Provide support for Sales and/or CX with client related shipment queries and dashboard troubleshooting.</li>\n<li>Support the management of Shopify client stores in partnership with the Project Management team</li>\n</ul>\n<p> </p>\n<p><strong>REQUIREMENTS</strong></p>\n<ul>\n<li>No professional work experience required</li>\n<li>Computer literacy and experience using Google suite</li>\n<li>Good administrative, organizational, and problem-solving skills.</li>\n<li>Ability to communicate clearly and confidently. </li>\n<li>The ability to multitask, work in a fast-paced environment, and meet deadlines.</li>\n<li>Ability to perform under pressure.</li>\n<li>Must be able to work independently on tasks and work well with others team members</li>\n<li>A strong interest in sales and/or project management!</li>\n<li>Salesforce and JIRA experience is a plus!</li>\n</ul>\n<p> </p>\n<p><strong>WHAT SUCCESS LOOKS LIKE</strong></p>\n<ul>\n<li>Reduce the Sales &amp; Project Managers time spent on non revenue producing tasks, to increase capacity for the RevOrg</li>\n<li>Happy Customers and NPS Score</li>\n<li>Profession and skill development to make you more valuable for SwagUp and the market as a whole. </li>\n</ul>\n<p> </p>\n<p><strong>PERKS</strong></p>\n<ul>\n<li>Wake up each morning proud of the place you work and the amazing companies you get to partner with</li>\n<li>Join the team at a time when you can help shape the future of the company</li>\n<li>Unlimited PTO, we are all adults, you're in control</li>\n<li>Medical, Dental, Vision and Life insurance</li>\n<li>Lots of swag!</li>\n<li>Equipment provided to set up a successful work environment</li>\n<li>Engaging team-building activities to make a remote-first workforce feel connected</li>\n<li>Being part of an organization that rewards results and truly believes in promoting from within, at SwagUp your growth potential is uncapped!</li>\n</ul>\n<p> </p>\n<p><em>Salary Range: $50,000 - $60,000</em></p>\n<p> </p>\n<p><em>SwagUp welcomes and celebrates talent from all backgrounds and perspectives. Our success is directly correlated to our people, and we believe our team should reflect the diversity of the companies we partner with. As an organization, we strive to foster an inclusive, diverse environment where we all work towards a common goal! #tothemoon</em></p>\n"}, {"id": 978504, "url": "https://remotive.io/remote-jobs/all-others/business-development-program-coordinator-978504", "title": "Business Development Program Coordinator", "company_name": "pipeline", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-15T05:40:14", "candidate_required_location": "North America Only", "salary": "", "description": "<div class=\"h2\"><strong>What we do: </strong></div>\n<p style=\"min-height: 1.5em;\">Our goal at Pipeline is to help content creators turn their passion into a career. Consumption of online media is growing quickly and there are millions of new creators starting their journey each month. We believe that anyone who is deeply passionate about a niche and willing to put in the work can be a successful creator. Pipeline was created to provide the best environment for new creators to succeed through premium educational content and a supportive community.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Who we are: </strong></div>\n<p style=\"min-height: 1.5em;\">Gamers, creators, streamers, esports fans, Twitch mods, designers, vloggers - we’ve been through this journey ourselves. Pipeline was founded by<a href=\"https://twitter.com/snoopeh\" rel=\"nofollow\"> Snoopeh</a> and<a href=\"https://www.facebook.com/StoneMountain64\" rel=\"nofollow\"> StoneMountain64</a>, who have each successfully built careers as creators and are now looking to share what they’ve learned to support the next generation. Our team is passionate about online content creation and we’re moving fast to build out the education and community platform we wish we had when we started. We’re a young startup that’s loved by thousands of creators, we’re profitable and we’re growing quickly! 🚀</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>About the role:</strong></div>\n<p style=\"min-height: 1.5em;\">We are looking for a motivated self-starter to help run the operations of a major initiative within Pipeline’s Business Development team. As a Program Coordinator, you will be a critical part of the daily operations as the program scales. You will report to a Program Manager and make sure that all objectives of the program and your individual mandates are met. You will work directly with content creators, ensuring their success and satisfaction with the program and Pipeline. </p>\n<p style=\"min-height: 1.5em;\">If you are passionate about the creator economy and want to work with industry leaders on a major initiative with the potential to define the shape of the creator space in North America, then this is the right role for you.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>What will be expected of you in the role:</strong></div>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Manage a portfolio of creators as they join and participate in the program.</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Serve as point of contact for potential and existing talent - constantly growing and maintaining positive relationships</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Measure and report on growth across platforms, talent status, etc. </p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Share ideas on new program features, pain points, and other ways to optimize support for these creators</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Coordinate with the data team to share actionable insights in regards to how influencer performance can be predicted and measured</p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<div class=\"h2\"><strong>Qualifications:</strong></div>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">1-2 years experience in customer success or talent management for an agency, organization, or brand</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Extremely knowledgeable about Twitch, Youtube, and Facebook streaming ecosystem, content creators, and emerging trends</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Proven ability to effectively manage multiple projects and work productively with a variety of people</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Proficient in Microsoft / Google Suite</p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<div class=\"h2\"><strong>Bonus qualifications:</strong></div>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Excellent verbal, written, and interpersonal skills with the ability to communicate ideas clearly</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Self-motivated team player with an entrepreneurial spirit, the ability to multi-task and deliver outstanding results in a fast-paced, start-up environment</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Proactive, accountable, and can excel in a remote position where your efforts will determine your success</p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<div class=\"h2\"><strong>Benefits</strong></div>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">💰 Competitive Compensation </p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">⌚ Flexible, Remote Work Schedules</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">🏥 Medical Insurance including Health, Dental, Vision, and Life</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">🏖️ Unlimited Vacation and Sick Days</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">🤝 Access to Corporate Partner Discounts</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><br><br></p>\n"}, {"id": 978931, "url": "https://remotive.io/remote-jobs/all-others/senior-scientist-978931", "title": "Senior Scientist", "company_name": "Shasqi", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-14T01:41:31", "candidate_required_location": "USA Only", "salary": "", "description": "<div><u><strong>About Shasqi</strong></u></div>\n<div>We believe you can beat cancer without poisoning your body.</div>\n<div>Shasqi was founded in 2018, and is a privately held, clinical stage biotechnology company leveraging its proprietary click chemistry platform to develop oncology treatments that are designed to be activated at targeted tumor sites to improve efficacy while decreasing systemic toxicity. Shasqi’s platform is highly modular and can be applied to a broad range of drugs that are otherwise limited by toxicity, enabling the exploration of therapeutic biology in ways that were not previously possible before. We are a small team based in San Francisco, CA, currently all working remotely, with an active Phase I clinical trial.</div>\n<div> </div>\n<div><u><strong>Shasqi Core Values:</strong></u></div>\n<div><strong style=\"font-size: 11pt;\">1) Resourcefulness </strong>We are 14 people at a table, accomplishing something complex. We value efficiency, being concise, accurate, specific, over-communicate.</div>\n<div><strong style=\"font-size: 11pt;\">2) Simplicity in focus </strong>We can explore a million things but it’s valuable to focus on what you want to pursue.</div>\n<div><strong style=\"font-size: 11pt;\">3) Challenge Standards / Status Quo </strong>Find a balance between pushing limits and respecting the process.</div>\n<div><strong style=\"font-size: 11pt;\">4) Collaboration </strong>Maintain a collaborative environment with respectful communication.</div>\n<div><strong style=\"font-size: 11pt;\">5) Humble Confidence </strong>Be humble in both your success and your failures.</div>\n<div> </div>\n<div><strong><u>Why you should apply:</u></strong></div>\n<div>Because you’ve always wanted the opportunity to join a fast-paced startup working on</div>\n<div>transformative oncology therapies. We’re looking for a highly motivated, creative, and tech-</div>\n<div>savvy Senior Scientist with training in biology, pharmacology, or chemical biology. The ideal</div>\n<div>candidate would have experience in performing data analysis and project management. The</div>\n<div>successful candidate would be versatile, able to work independently and wear multiple hats in a</div>\n<div>start-up environment.</div>\n<div> </div>\n<div><strong><u>About the role:</u></strong></div>\n<div>We are hiring a Senior Scientist who is excited to work in a dynamic start-up environment to</div>\n<div>support the team in the design, execution, and analysis of research studies, management of</div>\n<div>contract vendors, and support clinical activities. As a small biotech start up, Shasqi offers the</div>\n<div>opportunity to learn about every step in the drug development process from discovery, to</div>\n<div>manufacturing, clinical trials and ultimately market approval.</div>\n<p><br><br></p>\n<div class=\"h3\">Responsibilies</div>\n<ul>\n<li>Work independently to design and execute experiments to support and expand the CAPAC</li>\n</ul>\n<ul>\n<li>platform.</li>\n</ul>\n<ul>\n<li>Analyze and interpret data from experiments, write reports, present findings to the team.</li>\n</ul>\n<ul>\n<li>Manage contract vendors for Shasqi.</li>\n</ul>\n<ul>\n<li>Maintain accurate and well-organized records.</li>\n</ul>\n<div> </div>\n<div>This position is remote.</div>\n<p><br><br></p>\n<div class=\"h3\">Requirements</div>\n<ul>\n<li>Bachelor’s degree in biology, chemistry, or related fields with 5+ years of experience in the biotech industry</li>\n</ul>\n<ul>\n<li>Highly motivated and independent worker with strong analytical and communication skills</li>\n</ul>\n<ul>\n<li>Ability to design experiments, analyze data, draw conclusions, and present findings.</li>\n</ul>\n<ul>\n<li>Deep understanding of scientific concepts and biological processes.</li>\n</ul>\n<ul>\n<li>Ability to work in a cross-functional collaborative organization.</li>\n</ul>\n<ul>\n<li>Familiarity with laboratory testing, data recording practices, and safety procedures.</li>\n</ul>\n<ul>\n<li>Working knowledge of word processing, presentations, and statistics</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional desired qualifications</div>\n<ul>\n<li>PhD in biology, pharmacology, chemistry, or related fields with 3+ years of experience in biotech or pharmaceutical industry</li>\n</ul>\n<ul>\n<li>Proven track record of ability to conduct research with strong attention to detail (e.g. scientific publications, presentations, patents, etc.)</li>\n</ul>\n<ul>\n<li>Prior experience working with biomaterials and bio-orthogonal / click chemistry</li>\n</ul>\n<ul>\n<li>Experience with animal models and preclinical studies</li>\n</ul>\n<div><span style=\"font-size: 16px;\">#LI-Remote</span></div>\n<div> </div>\n<div><strong><u>Benefits</u></strong></div>\n<div>Compensation and title will be commensurate with experience and responsibilities of the candidate. For a full list of employee benefits, please see https://shasqi.com/careers</div>\n<div> </div>\n<div>We do not accept solicitations by recruiters, recruiting agencies, headhunters and outsourcing organizations.</div>\n"}, {"id": 975653, "url": "https://remotive.io/remote-jobs/all-others/project-manager-975653", "title": "Project Manager", "company_name": "Bitfocus", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-12T21:40:23", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>About Bitfocus, Inc.</strong> </p>\n<p> </p>\n<p>Founded in 2003, Bitfocus, Inc. is changing the way communities nationwide integrate software, systems, data, and policy to innovate and strengthen the nation's social safety net. We develop software and administer data systems that affect and change lives, connecting our most vulnerable populations to the most effective resources available in their communities. Our products empower organizations and communities to better leverage their resources, helping them to become data-driven in their efforts in all areas of health, human, and social services.</p>\n<p>Our diverse and inclusive culture has played a key role in our success at Bitfocus. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity or expression, veteran status, or disability.</p>\n<p> </p>\n<p><strong>Bitfocus is a remote organization; this will be a work-from-home position.</strong></p>\n<p> </p>\n<p><strong><br></strong><strong>About Our Professional Services Team:</strong></p>\n<p>Our Professional Services team sets us apart from other software companies. A mission-driven team of analysts, communicators, strategists, and technologists - Professional Services tackles some of the most significant challenges facing communities and catalyzes their success with Clarity Human Services. With expertise in statistical, technical, and policy analysis, we collaborate with community leaders, share knowledge gained working with communities across the country, and take the lead on a variety of projects and initiatives to help our communities meet their goals around ending homelessness.</p>\n<p> </p>\n<p><strong>Our Core Values</strong></p>\n<ul>\n<li>People First. Always.</li>\n<li>Live in the WOW</li>\n<li>Elevate our Mission</li>\n<li>Start with Yes</li>\n<li>Take Detours</li>\n<li>Practice Humility</li>\n<li>Paint with Numbers</li>\n<li>Speak the truth in kindness</li>\n<li>Grow Together</li>\n<li>Unite in Excellence</li>\n</ul>\n<p> </p>\n<p><strong>Success/Impact Statement: </strong></p>\n<p>Professional Services Project Managers at Bitfocus are experienced professionals who are passionate about helping communities use technology and data to move the needle on ending homelessness.</p>\n<p><strong><br></strong><strong>As the Project Manager, you will:</strong></p>\n<ul>\n<li>Work with customers and/or Bitfocus teams to define project requirements, scope, timelines, and objectives.</li>\n<li>Advise customers on a variety of subjects including:\n<ul>\n<li>Federal and regional requirements for homelessness response systems</li>\n<li>Clarity Human Services functions and solutions</li>\n<li>Pros, cons, and other considerations for any given solution</li>\n<li>Industry trends and best practices</li>\n</ul>\n</li>\n<li>Work with customer stakeholders to translate needs and business processes into Clarity functionality.</li>\n<li>Attend relevant stakeholder and community meetings to provide input and gain system knowledge.</li>\n<li>Create internal and external documents summarizing workflows, solution comparisons, configuration options, etc.</li>\n<li>Develop presentation content such as software demonstrations, training, and progress reports to project leadership, and present in front of remote and in-person audiences.</li>\n<li>Complete and/or obtain resources to complete tasks outlined in project workplan.</li>\n<li>Track project progress and update relevant Bitfocus staff and/or customer stakeholders.</li>\n<li>Create comprehensive project documentation including requirements documents, SOWs, workplans, decision logs, configuration logs, etc.</li>\n</ul>\n<p> </p>\n<p><strong>You will love this position if:</strong></p>\n<ul>\n<li>You seek and are inspired by new ideas and new ways of thinking.</li>\n<li>You never let your ego get in the way.</li>\n<li>People always tell you you're a good listener.</li>\n<li>You're ready to \"pivot\" like you're a professional dancer. </li>\n<li>You're obsessed with understanding the big picture.</li>\n<li>Gantt charts and process diagrams soothe your soul.</li>\n<li>\"Bringing order to chaos\" is your personal slogan</li>\n</ul>\n<p><br><strong>Required experience that drives success in this role:</strong><br><br></p>\n<ul>\n<li>Project management experience, including:\n<ul>\n<li>Creating and managing project schedule and work plan</li>\n<li>Tracking project progress and identifying areas for improvement, making adjustments as needed</li>\n<li>Coordinating stakeholder communication around project milestones and timelines, providing consistent updates on progress, as well as any adjustments</li>\n<li>Assigning tasks to other team members as needed, and communicating expected deliverables</li>\n<li>Coordinating with other departments for effective use of resources</li>\n</ul>\n</li>\n<li>Subject matter expertise in one or more of the following domains:\n<ul>\n<li>Clarity Human Services or other HMIS software</li>\n<li>Coordinated Entry</li>\n<li>HMIS</li>\n<li>HUD and/or Federal Partner Requirements</li>\n<li>HUD and/or Federal Partner Reporting</li>\n<li>Continuum of Care Roles and Responsibilities</li>\n<li>New Customer Software Implementation</li>\n<li>Data Quality Improvement</li>\n<li>Data Analysis</li>\n</ul>\n</li>\n<li>Enthusiasm for technology and learning new software applications and database products</li>\n<li>Ability to quickly build advanced knowledge of Clarity Human Services, HMIS System Administration, and related subjects</li>\n<li>Ability to work both independently and within a team environment</li>\n<li>Innovative thinking to identify best practices when approaching problems and resolving conflicts</li>\n<li>Ability to create structure in ambiguous situations and implement effective processes</li>\n<li>Excellent organizational, time management, people management and influencing skills</li>\n<li>Ability to work effectively with civic and other community leaders, social service agency staff, and a variety of other stakeholders</li>\n<li>Strong interpersonal skills</li>\n<li>Strong analytical abilities with working knowledge of descriptive statistics and (basic) analytics tools</li>\n<li>A background in HMIS, the homeless services Continuum of Care, and/or the human services system</li>\n<li>You have a proven ability to work effectively with civic and other community leaders, social service agency staff, and a variety of other stakeholders.</li>\n</ul>\n<p><strong>What makes you stand out:</strong></p>\n<ul>\n<li>Experience as a Clarity system administrator or system administrator of other HMIS software</li>\n<li>Experience in a leadership role at a nonprofit focusing on homelessness or other human services</li>\n<li>Excellent business/proposal writing skills</li>\n<li>Significant coordinated entry knowledge and experience</li>\n<li>Sophisticated project management experience with large, politically sensitive projects</li>\n<li>Proven experience successfully and diplomatically working with stakeholders who do not share your goals</li>\n<li>Driven, self-motivated, and enthusiastic</li>\n</ul>\n<p><strong><br></strong><strong>How will Bitfocus support you:</strong></p>\n<ul>\n<li>Robust onboarding and training support</li>\n<li>A unique, friendly, and caring culture! Hear more from our employees on <a href=\"https://www.glassdoor.com/Reviews/Bitfocus-Reviews-E2388426.htm\" rel=\"nofollow\">Glassdoor</a>.</li>\n<li>Medical, dental, vision insurance</li>\n<li>Medical insurance covered at 100% for employees</li>\n<li>401K Retirement Plan</li>\n<li>Paid parental leave</li>\n<li>Paid time off</li>\n<li>Paid volunteer time off</li>\n<li>Bitfocus primarily uses Apple computers; all new employees receive either an iMac or MacBook Pro to use in their role at Bitfocus</li>\n<li>Opportunities for professional growth and development</li>\n</ul>\n<p> </p>\n"}, {"id": 719608, "url": "https://remotive.io/remote-jobs/all-others/technical-support-engineer-719608", "title": "Technical Support Engineer", "company_name": "Automattic", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-10T16:07:56", "candidate_required_location": "Anywhere", "salary": "", "description": "<p> \r\n</p><p>\n</p><p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif; color: #757575;\">Remote – Work from Home – Can be based pretty much anywhere in the world!</span></p>\n<span style=\"font-family: 'Times New Roman',serif; color: #757575;\"> </span>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt;\"><font><span style=\"font-size: 12pt;\">As a </span>Technical Support Engineer (known internally as a Happiness Engineer),<span style=\"font-size: 12pt;\"> you love helping people.</span></font></p>\n<span style=\"font-family: 'Times New Roman',serif;\"><br></span><p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Transforming publishing on the web is no small task. Our goal is to build relationships based on trust, resulting in happy, passionate, loyal customers and colleagues. We do this by listening to our customers’ needs and guiding them to the fullest use of the products we offer. We are looking for people with the right mix of compassion, writing skills, and technical knowledge to get the job done.</span></p><span style=\"font-family: 'Times New Roman',serif;\"><br></span>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Are you interested in learning more about how our team works? Check out what Happiness Support Engineers have to say about <span style=\"color: #2975ca;\"><a href=\"https://happinessengineer.blog/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">their work</span></a></span>.</span></p>\r\n \r\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><strong><span style=\"font-family: 'Times New Roman',serif;\">In general, a typical day involves:</span></strong></p>\n<ul style=\"margin-bottom: 0in;\" type=\"disc\">\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Being an active member of a global team that provides <span style=\"color: #2975ca;\"><a href=\"https://happiness-engineer.blog/2018/05/17/happiness-around-the-world/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">24/7 support</span></a></span> via live chat, tickets, one-on-one screen share sessions, and forums. </span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Helping people use Automattic’s products, including WordPress.com, WooCommerce, Jetpack, Tumblr, and <span style=\"color: #2975ca;\"><a href=\"https://automattic.com/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">more</span></a></span>.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Troubleshooting, investigating, and creating detailed bug reports.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Building a community of support by sharing knowledge and helping team members around the world.</span></li>\n</ul>\n<span style=\"font-family: Times New Roman, serif;\"><span style=\"font-size: 16px;\"> </span></span>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><strong><span style=\"font-family: 'Times New Roman',serif;\">Being a Happiness Engineer requires:</span></strong></p>\n<ul style=\"margin-bottom: 0in;\" type=\"disc\">\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Mid to high proficiency with WordPress, HTML, and CSS.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Experience providing technical support to customers, particularly via live chat, tickets, telephone, or forums.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Excellent written and communication skills, with a knack for taking technical language and making it understandable for the general public.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">A passion for solving challenging problems and proposing elegant solutions.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Solid ability to identify and accurately document technical issues.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">An intense intellectual curiosity and an eagerness to share knowledge with others.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Patience, grace, and a sense of humor.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Happiness Engineers must be fluent and eloquent in written English. If you know additional languages, please be sure to tell us.</span></li>\n</ul>\n<span style=\"font-family: Times New Roman, serif;\"><span style=\"font-size: 16px;\"> </span></span>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><strong><span style=\"font-family: 'Times New Roman',serif;\">An ideal candidate:</span></strong></p>\n<ul style=\"margin-bottom: 0in;\" type=\"disc\">\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Has created three or more WordPress websites.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Has experience installing and configuring WordPress plugins and themes.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Is adept at troubleshooting technical issues.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Has experience creating bug reports.</span></li>\n<li class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">Has experience providing technical support to customers via telephone, tickets, live chat, or forums.</span></li>\n</ul>\n<p>\n</p><p title=\"Page 1\">\n</p><p>\n</p><p>\n</p><p>\r\n \r\n</p><p><span style=\"font-size: 12pt; font-family: Calibri; font-weight: bold; color: #2d2d2d;\">In our application form, you</span><span style=\"font-size: 12pt; font-family: Arial; font-weight: bold; color: #2d2d2d;\">’</span><span style=\"font-size: 12pt; font-family: Calibri; font-weight: bold; color: #2d2d2d;\">ll be prompted to answer questions. We read through all of these carefully, so please be thorough and go into as much detail as you like! </span></p><span style=\"font-size: 12pt; font-family: Calibri; font-weight: bold; color: #2d2d2d;\"><br></span>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><strong><span style=\"font-size: 13.5pt; font-family: 'Times New Roman',serif;\">About Automattic</span></strong></p>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">We are the people behind <span style=\"color: #2975ca;\"><a href=\"http://wordpress.com/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">WordPress.com</span></a></span>, <span style=\"color: #2975ca;\"><a href=\"http://woocommerce.com/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">WooComme<wbr></wbr>rce</span></a></span>, <span style=\"color: #2975ca;\"><a href=\"http://jetpack.com/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">Jetpack</span></a></span>, <span style=\"color: #2975ca;\"><a href=\"https://www.tumblr.com/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">Tumblr</span></a></span>, <span style=\"color: #2975ca;\"><a href=\"http://simplenote.com/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">Simpleno<wbr></wbr>te</span></a></span>, <span style=\"color: #2975ca;\"><a href=\"http://longreads.com/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">Longreads</span></a></span>, <span style=\"color: #2975ca;\"><a href=\"https://dayoneapp.com/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">Day One</span></a></span>, and more. We believe in making the web a better place.</span></p>\n<span style=\"font-family: 'Times New Roman',serif;\"> </span>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">We’re a distributed company with more than 1400 Automatticians in 80+ countries speaking 90+ different languages. Our common goal is to democratize publishing so that anyone with a story can tell it, regardless of income, gender, politics, language, or where they live in the world.</span></p>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">We believe in Open Source and the vast majority of our work is available under the <span style=\"color: #2975ca;\"><a href=\"https://en.wikipedia.org/wiki/GNU_General_Public_License\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">GPL</span></a></span>.</span></p>\n<span style=\"font-family: 'Times New Roman',serif;\"> </span>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><strong><span style=\"font-size: 13.5pt; font-family: 'Times New Roman',serif;\">Diversity, Equity, and Inclusion at Automattic</span></strong></p>\n<p class=\"MsoNormal\" style=\"margin: 0in 0in 0.0001pt; font-size: 12pt; font-family: Calibri,sans-serif;\"><span style=\"font-family: 'Times New Roman',serif;\">We’re improving diversity, equity, and inclusion in the tech industry. At Automattic, we want people to love their work and show respect and empathy to all. We welcome differences and strive to increase participation from traditionally underrepresented groups. Our DEI committee involves Automatticians across the company and drives grassroots change. For example, this group has helped facilitate private online spaces for affiliated Automatticians to gather and helps run a monthly DEI People Lab series for further learning. Diversity, Equity and Inclusion is a priority at Automattic, though our dedication influences far more than just Automatticians: We make our products freely available and translate our products into and offer customer support in numerous languages. We require unconscious bias training for our hiring teams and ensure our products are accessible across different bandwidths and devices. Learn more about our dedication to <span style=\"color: #2975ca;\"><a href=\"https://href.li/?https://automattic.com/diversity-and-inclusion/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">diversity, equity, and inclusion</span></a></span> and our <span style=\"color: #2975ca;\"><a href=\"https://automattic.com/automattician-resource-groups/\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #2975ca; text-decoration-line: none;\">Employee Resource Groups</span></a></span>.</span></p>\r\n \r\n\r\n                                            \r\n                                        \r\n                                            \r\n                                        ", "company_logo_url": "https://remotive.io/job/719608/logo"}, {"id": 977292, "url": "https://remotive.io/remote-jobs/all-others/producer-metaventure-studio-977292", "title": "Producer - MetaVenture Studio", "company_name": "Growyourbase", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-09T21:40:13", "candidate_required_location": "USA Only", "salary": "", "description": "<p dir=\"ltr\">GrowYourBase (GYB) is a leading global metaverse developer across all major worlds and communities, starting with The Sandbox. The Sandbox is a user-generated gaming platform where creators can create assets and gaming experiences to monetize them on the Ethereum blockchain. Imagine Minecraft meets Roblox on the blockchain.<br> </p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">In order to achieve the goal of being the preeminent metaverse builder, GYB is building an industry-leading low-poly and voxel game development studio. GYB’s games and experiences are known for their innovative concepts, stunning visuals, and addictive gameplay. The cherry on top is the play-to-earn (P2E) mechanics that reward users with NFT’s and tokens for their engagement.<br></p>\n<p dir=\"ltr\"></p>\n<p dir=\"ltr\">We’re on a mission to revolutionize the gaming industry. Join us in the revolution, one voxel at a time.<br><br></p>\n<p dir=\"ltr\"><strong>Job Description</strong></p>\n<p>As a Producer, you are responsible for day-to-day operations of MetaVenture including the people, processes, and tech that make us world class. This includes project management, people management, and financial management.  In addition, you will work with the management team to craft the vision of games and experiences, and have meetings with potential clients to scope out and assist in secure contracts for game design work. Lastly, you will help in develop schedules and resource requirements to ensure achievement of vision. You will be a strong fit if you are organized, enjoy having your hands in all of the pots, and relish the challenge of driving games and experiences to be successful.</p>\n<p dir=\"ltr\"><br></p>\n<p dir=\"ltr\"><strong>To apply</strong></p>\n<p dir=\"ltr\">Please submit a cover letter, resume, and attach portfolio of your relevant work<br></p><p dir=\"ltr\"><strong>Requirements:</strong><br></p>\n<ul><li dir=\"ltr\"><p dir=\"ltr\">4+ years of experience in managing and producing the full lifecycle of high profile video games and/or virtual experiences</p></li><li dir=\"ltr\"><p dir=\"ltr\">Experience assembling and managing a team of game designers, level designers, and artists outlining, scheduling, and tracking tasks towards game development completion</p></li><li dir=\"ltr\"><p dir=\"ltr\">Attention to detail</p></li><li dir=\"ltr\"><p dir=\"ltr\">Clear communication, organized, and autonomous</p></li><li dir=\"ltr\"><p dir=\"ltr\">Excellent written and spoken English</p></li><li dir=\"ltr\"><p dir=\"ltr\">Ability to manage deadlines and prioritize effectively</p></li><li dir=\"ltr\"><p dir=\"ltr\">Ability to learn in a fast environment and collaborate remotely via Discord, Zoom/Google Meet</p></li><li dir=\"ltr\"><p dir=\"ltr\">Experience with project management software such as ClickUp, Jira, etc.</p></li><li dir=\"ltr\"><p dir=\"ltr\">Familiar with Google Workspace suite of products, including Google Drive, Google Docs, Google Sheets</p></li></ul>\n<p><br></p>\n<p dir=\"ltr\"><strong>Nice to Have:</strong><br></p>\n<ul><li dir=\"ltr\"><p dir=\"ltr\">Prior experience with The Sandbox</p></li><li dir=\"ltr\"><p dir=\"ltr\">Leadership experience </p></li><li dir=\"ltr\"><p dir=\"ltr\">Knowledge about cryptogames</p></li><li dir=\"ltr\"><p dir=\"ltr\">Experience with P2E gaming business models</p></li><li dir=\"ltr\"><p dir=\"ltr\">Knowledge about tokenomics and/or game incentive mechanisms</p></li></ul>"}, {"id": 972362, "url": "https://remotive.io/remote-jobs/all-others/research-production-assistant-972362", "title": "Research Production Assistant", "company_name": "SlashData", "category": "All others", "tags": [], "job_type": "part_time", "publication_date": "2021-11-08T17:39:55", "candidate_required_location": "Europe Only", "salary": "", "description": "<p>SlashData is the leading research company in the developer economy. We produce developer-focused market research for the world's leading technology companies, including Microsoft, Facebook, Google, and Amazon. We provide our clients with data-backed insights to help them better position their products and services to reach their target developer audience.</p>\n<p>We’re now looking for a part-time Research Production Assistant to help us with producing top-quality project deliverables for our clients.</p>\n<p><strong>What we are looking for</strong></p>\n<p>We are now looking for a Research Production Assistant to undertake the critical role of transforming our research output into visually appealing, client-ready reports and presentations.</p>\n<p>The role is part-time (20 hours per week), can be based in Greece, or other locations within Europe. You will be working from your home office or co-working space as part of a distributed team.</p>\n<p><strong>What you‘ll be doing</strong></p>\n<p>Supporting our team of seasoned research analysts in delivering high quality research reports and presentations to our clients.</p>\n<p><strong>Requirements</strong></p>\n<p><strong>What you‘ll be responsible for</strong></p>\n<ul>\n<li>Assembling reports and other research documents into visually appealing client deliverables, using project-specific templates and design guidelines</li>\n<li>Coordinating with report authors on production requirements and timelines</li>\n<li>Facilitating report proofreading, using external resources or online proofreading tools (e.g. Grammarly)</li>\n<li>Tracking the production progress via project management tools (e.g. Monday) and informing account managers once the final reports are ready for client distribution</li>\n<li>Managing the writeup, graph and final report templates and updating them as needed</li>\n<li>Setting up and maintaining all project documents and folders</li>\n<li>Regularly exporting research production data from Monday project management tool. Bonus points for summarising in dashboards and/or generating reports</li>\n<li>Bringing creative solutions to the table on how we can further improve the efficiency of the research production process</li>\n</ul>\n<p><strong>Skills needed</strong></p>\n<ul>\n<li>Stellar attention to detail!</li>\n<li>Ability to work on multiple tasks simultaneously and manage your time effectively</li>\n<li>Excellent command of English (both written and verbal)</li>\n<li>Advanced PowerPoint skills</li>\n<li>Comfortable with generating and formatting graphs in Excel</li>\n<li>At least some prior experience with the Google Workspace suite (Docs, Sheet, Drive etc.) and project management tools, ideally Monday</li>\n<li>Comfortable working remotely as part of a globally distributed team</li>\n</ul>\n<p><strong>Bonus points for</strong></p>\n<ul>\n<li>Advanced Excel skills</li>\n<li>Basic data analysis and visualisation skills</li>\n<li>Prior experience in a similar role</li>\n</ul>\n<p><strong>You will be successful within the first 6 months if you have:</strong></p>\n<ul>\n<li>Taken full ownership of the company’s research production needs</li>\n<li>Assembled at least 10 final research reports to the highest quality standards</li>\n<li>Recommended at least one change for our research production process to become more efficient</li>\n<li>Become a dependable team member</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Opportunity to make a difference as part of the leading research company in the developer economy</li>\n<li>Competitive salary</li>\n<li>Flexible working environment</li>\n<li>Come to work in a t-shirt, shorts and flip flops, or tie and a suit</li>\n<li>Annual training budget to develop your skills and career</li>\n<li>Monthly book allowance from Amazon, on any book you like</li>\n<li>Spotify Premium subscription or Netflix</li>\n<li>Attendance at our annual team event</li>\n<li>Never work on your birthday</li>\n<li>Part of an entrepreneurial company that's raising the bar, and calling the trends of the developer economy</li>\n</ul>\n<p> </p>\n"}, {"id": 968602, "url": "https://remotive.io/remote-jobs/all-others/mapping-lead-968602", "title": "Mapping Lead", "company_name": "Gpr", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-06T09:40:32", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong><br></strong><strong>COMPANY</strong></p>\n<p>GPR is radically accelerating the arrival of self-driving vehicles by tackling some of the most challenging problems that stand in the way of safe and reliable navigation.</p>\n<p>Every road in the world has a unique subsurface signature. GPR uses radar to create a map of those subsurface signatures from which self-driving cars can navigate. Vehicles using GPR are unaffected by common but challenging road conditions like snow, heavy rain, fog, or poor lane markings.</p>\n<p>GPR is working with leading autonomous vehicle and traditional automotive companies, is backed by leading investors, is growing quickly, and is building a talented team that wants to transform the future of mobility and work on some of the hardest and most important engineering problems around. If that sounds like you, please drop us a line.</p>\n<p><strong><br></strong></p>\n<p><strong>ROLE</strong></p>\n<p>As the GPR Mapping Lead, you will drive GPR's mapping team, shape strategy and help form partnerships.  You will work with the cloud team to design and build a scalable mapping infrastructure worldwide. You will work with your team and others to integrate radar-based map and sensor fusion-based localization algorithms into the cloud and vehicle systems.  You will be responsible for developing the mapping roadmap, managing and growing a team of talented engineers to develop worldwide capabilities.<br><strong><br></strong><strong>WHO YOU ARE + WHAT YOU'LL DO</strong></p>\n<ul><li>Lead mapping strategy</li><li>Lead and manage the mapping team</li><li>Take responsibility for the overall planning, execution, and success of complex technical projects and provide the team with technical leadership.</li><li>Work closely with other teams, especially within engineering, cloud, and product development.</li><li>Lead the development of HD map APIs, mapping algorithm, map infrastructure, and map toolchain for scalable map change.</li><li>Lead the operations and process strategies to meet map data collection objectives. </li><li>Lead the development of tools and process for map quality verification.</li><li>Enjoy working with, growing, and developing small, high output teams in a fast-paced startup environment.</li><li>A “get-it-done” person. You know that done is better than perfect and are energized by constantly delivering and moving things forward.</li></ul><p><strong>REQUIREMENTS</strong></p>\n<ul><li>Hands-on technical leadership and engineering management experience in high definition mapping. </li><li>Strong understanding of software engineering principles and processes along with the ability to apply this knowledge to execute projects and optimize development strategies</li><li>Understanding of strategy and willingness to handle partnership engagements</li><li>Proven track record of delivering complex technical projects.</li><li>System and product experience working on or building a scalable map system<br></li><li>If you are planning to work remotely, you must be a strong and talented remote worker and a solid team player.  You will need to spend 2-3 weeks on site up front to meet the team and learn the technology.  You will need to be on board with traveling for work engagements/sites where needed.  You should plan to be in the office in person at least 1 week every 2 months and based on work and team needs<span dir=\"ltr\"> </span></li></ul>\n<p><strong>NICE TO HAVE</strong><br></p>\n<ul><li>Experience in automotive, robotics, aerospace engineering, or medical device engineering </li><li>Experience with safety-critical systems</li><li>Experience with scalable map systems, cloud platforms.</li><li>Experience with radar sensors</li></ul>\n<p><strong>WORK</strong></p>\n<ul><li>Must be currently eligible to work in the US.  Please indicate if you need or will eventually need sponsorship on your application. </li></ul>"}, {"id": 979338, "url": "https://remotive.io/remote-jobs/all-others/medical-coding-manager-979338", "title": "Medical Coding Manager", "company_name": "CareHive", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-05T08:08:27", "candidate_required_location": "USA Only", "salary": "", "description": "<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: 1.7; font-family: Roboto, HelveticaNeue-Light, 'Helvetica Neue Light', 'Helvetica Neue', Helvetica, Arial, sans-serif; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">At CareHive Health, we rely on powerfully insightful data to ensure the delivery of our excellent healthcare services. We are seeking an experienced and certified medical coding professional to join our team. Our ideal coder will have a thorough knowledge of anatomy and medical terminology along with a natural curiosity to learn and understand our business as well as an analytical mind. We will rely on you to ask questions, connect the dots and uncover information that may be difficult to find - all with the end goal of ensuring an appropriate and smooth billing process by abiding with the standard protocols for medical coding.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: 1.7; font-family: Roboto, HelveticaNeue-Light, 'Helvetica Neue Light', 'Helvetica Neue', Helvetica, Arial, sans-serif; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline;\">Objectives</span></p>\n<ul style=\"margin-bottom: 40px; margin-left: 20px; padding-left: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: inherit; font-family: Roboto, HelveticaNeue-Light, 'Helvetica Neue Light', 'Helvetica Neue', Helvetica, Arial, sans-serif; vertical-align: baseline; color: #444444; letter-spacing: 0.5px;\">\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Manage the coding workflow and ensure timely and high-quality coding of diagnoses and procedures using ICD-10, CPT-4, HCPCS, and HCPC coding classification systems to meet billing system requirements.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Work closely with physicians, clinicians, technicians, insurance companies, provider groups and other integral parties to uncover and discuss coding analysis results.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Develop, modify and execute company policies and procedures that affect immediate operations and may have organization-wide impact.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Analyze issues where understanding situations or data requires and in-depth knowledge of organizational objectives.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Implement strategic policies, while selecting methods and evaluation criteria or obtaining accurate results.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Research and make recommendations to executive management regarding new coding trends and policies (i.e. telehealth, virtual first care, care coordination and navigation).</li>\n</ul>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: 1.7; font-family: Roboto, HelveticaNeue-Light, 'Helvetica Neue Light', 'Helvetica Neue', Helvetica, Arial, sans-serif; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline;\">Responsibilities</span></p>\n<ul style=\"margin-bottom: 40px; margin-left: 20px; padding-left: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: inherit; font-family: Roboto, HelveticaNeue-Light, 'Helvetica Neue Light', 'Helvetica Neue', Helvetica, Arial, sans-serif; vertical-align: baseline; color: #444444; letter-spacing: 0.5px;\">\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Retrieve and collect information from various resources for reporting.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Analyze medical malpractice and denied claims by identify issues, events, diagnoses and procedures that resulted in those actions.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Prepare summaries of medical procedures and assign the appropriate codes that apply.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Review claims to formulate a synopsis of facts and collaborate with external claims examiners regarding the synopsis as needed.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Make corrections to draft reports sent for physician review and submit approved reports to management in a timely fashion.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Key member and driver of the Revenue Cycle team.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Creates and manages coding workflows.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Trains physicians and clinical staff on appropriate coding.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Works with EHR config team on template development and structured data design.</li>\n</ul>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: 1.7; font-family: Roboto, HelveticaNeue-Light, 'Helvetica Neue Light', 'Helvetica Neue', Helvetica, Arial, sans-serif; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\"><span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-family: inherit; vertical-align: baseline;\">Qualifications</span></p>\n<ul style=\"margin-bottom: 40px; margin-left: 20px; padding-left: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-stretch: inherit; line-height: inherit; font-family: Roboto, HelveticaNeue-Light, 'Helvetica Neue Light', 'Helvetica Neue', Helvetica, Arial, sans-serif; vertical-align: baseline; color: #444444; letter-spacing: 0.5px;\">\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Bachelor's degree in health information systems or business.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Certification as a CPC for medical practices (current certification required).</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">5+ years of medical coding in a multi-specialty practice.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Experience with the care team concept and how to code for a care team.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Telehealth coding experience and full understanding of coding changes/updates caused by COVID-19.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Proven experience in administrative medical information management and computer applications.</li>\n<li style=\"margin: 0px 0px 10px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: 1.7; font-family: inherit; vertical-align: baseline;\">Ability to learn and use new EHR and other software systems quickly.</li>\n</ul>\n", "company_logo_url": "https://remotive.io/job/979338/logo"}, {"id": 968601, "url": "https://remotive.io/remote-jobs/all-others/localization-lead-968601", "title": "Localization Lead", "company_name": "Gpr", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-04T17:42:55", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong><br></strong><strong>COMPANY</strong></p>\n<p>GPR is radically accelerating the arrival of self-driving vehicles by tackling some of the most challenging problems that stand in the way of safe and reliable navigation.</p>\n<p>Every road in the world has a unique subsurface signature. GPR uses radar to create a map of those subsurface signatures from which self-driving cars can navigate. Vehicles using GPR are unaffected by common but challenging road conditions like snow, heavy rain, fog, or poor lane markings.</p>\n<p>GPR is working with leading autonomous vehicle and traditional automotive companies, is backed by leading investors, is growing quickly, and is building a talented team that wants to transform the future of mobility and work on some of the hardest and most important engineering problems around. If that sounds like you, please drop us a line.</p>\n<p><strong><br></strong></p>\n<p><strong>ROLE</strong></p>\n<p>As the Localization Lead, you will lead, manage, and grow the localization team.  You will shape GPR's efforts around key algorithmic and engineering decisions for our radar-based map and sensor fusion-based localization algorithms.  You will work with your team and others to create, test, and improve upon novel radar-based map and sensor fusion-based localization algorithms.  You will work with your team, as well as the mapping and cloud teams to successfully implement algorithms from concept through to production.<br></p>\n<p> </p>\n<p><strong>WHO YOU ARE + WHAT YOU'LL DO</strong></p><ul><li>Lead localization strategy</li><li>Lead and manage the localization team</li><li>Take responsibility for the overall planning, execution, and success of complex technical projects and provide the team with technical leadership.</li><li>Work closely with other teams, especially within engineering, mapping, cloud, and product development.</li><li>Lead the development of localization algorithms.</li><li>Lead the team to develop towards and meet localization performance objectives.</li><li>Lead the development of tools and process for localization quality verification.</li><li>Develop and refine radar and multi-sensor-based localization algorithms for autonomous vehicle and mobile robotic applications.<br></li><li><p>Understand key technical and performance trade-offs for Radar-based Localization.</p></li><li><p>You’re comfortable thinking about the big picture and getting your hands dirt. You enjoy making strategic, design, and algorithmic decisions.</p></li><li><p>Enjoy working with small, high output teams in a fast-paced startup environment.<br></p></li><li><p>A “get-it-done” person. You know that done is better than perfect and are energized by constantly delivering and moving things forward.</p></li></ul><p><strong>REQUIREMENTS</strong></p><ul><li>Hands-on technical leadership and engineering management experience in Localization algorithms and odometry (Lidar, Visual, Radar).</li><li>Strong understanding of software engineering principles and processes along with the ability to apply this knowledge to execute projects and optimize development strategies</li><li>Understanding of strategy and willingness to handle partnership engagements</li><li>Proven track record of delivering complex technical projects</li><li>3 years or more experience working in applied Localization for Robotics/AV</li><li>If you are planning to work remotely, you must be a strong and talented remote worker and a solid team player.  You will need to spend 2-3 weeks on site up front to meet the team and learn the technology.  You will need to be on board with traveling for work engagements/sites where needed.  You should plan to be in the office in person at least 1 week every 2 months and based on work and team needs<br></li></ul>\n<p><strong>NICE TO HAVE</strong><br></p>\n<ul><li>Experience in automotive, robotics, aerospace engineering, or medical device engineering</li><li>Experience with radar sensors</li><li>Experience with real-time safety critical applications</li><li>Experience with C++,  Python, and Matlab</li></ul>\n<p><strong><br></strong><strong>WORK</strong></p>\n<ul><li>Must be currently eligible to work in the US.  Please indicate if you need or will eventually need sponsorship on your application. </li></ul>"}, {"id": 977087, "url": "https://remotive.io/remote-jobs/all-others/mechanic-at-asml-977087", "title": "Mechanic at ASML", "company_name": "ASML", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-11-03T15:28:48", "candidate_required_location": "Netherlands", "salary": "", "description": "<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\"><strong>Introduction to the job</strong></p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">Do you enjoy engineering and do you want to improve your hands-on technical skills? Are you a car mechanic, aerospace engineer or technician with some experience in a comparable sector? If so, ASML is looking for you!</p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">Every day, you make use of technology that contains microchips. From smartphones and laptops to cars and airplanes. Technologies such as AI, robotic process automation and 5G will fuel the growth of the semiconductor industry even more. Since we are the leader in high-end lithography systems for the semi-conductor industry, there’s a huge demand for our machines. This is why we are looking for a lot of new mechanics to join our colleagues within the factories. When you’re hired as one of our new mechanics, you’ll get an ASML contract with all the ASML top <a href=\"https://www.asml.com/en/careers/working-at-asml/netherlands\" rel=\"nofollow\" style=\"color: #1155cc;\" target=\"_blank\">labor conditions</a>.</p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\"><strong>What will you be working on?</strong></p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">As a mechanic at ASML you will be hands-on assembling and constructing lithography machines that are used to produce microchips. Probably the most amazing, complex machines that you will ever see. Besides, you’ll be working in our manufacturing cleanroom facility’s. A remarkable and unique environment!</p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">Watch the video below to learn more about the machines that you will be working on as a mechanic at ASML:</p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\"><a href=\"https://www.youtube.com/watch?v=wI6nCmG-PpI&amp;t=2s\" rel=\"nofollow\" style=\"color: #1155cc;\" target=\"_blank\">ASML IN ONE MINUTE</a></p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\"><strong>Who are you?</strong></p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">To help us tackle the technical challenges we face, you..</p>\n<ul style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">\n<li style=\"margin-left: 15px;\">Have a technical vocational education (the equivalent of Dutch mbo) or bachelor’s degree in - for example - mechanical engineering, aviation technology, or automotive engineering;</li>\n<li style=\"margin-left: 15px;\">Have at least 2 years of hands-on experience in a technical environment;</li>\n<li style=\"margin-left: 15px;\">Are able to work independently, reliably, accurately and in a structural manner, but you’re also able to work as a team;</li>\n<li style=\"margin-left: 15px;\">Are able to communicate in English and are able to read the work manuals (that are in English);</li>\n<li style=\"margin-left: 15px;\">In hectic situations you are able to stay calm;</li>\n<li style=\"margin-left: 15px;\">Have strong problem-solving abilities;</li>\n<li style=\"margin-left: 15px;\">Do not mind working in night- and weekend shifts.</li>\n</ul>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\"> </p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\"><strong>What do we have to offer?</strong></p>\n<ul style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">\n<li style=\"margin-left: 15px;\">A unique and challenging job for you as a Mechanic at ASML;</li>\n<li style=\"margin-left: 15px;\">Excellent guidance by experience colleagues in your work field;</li>\n<li style=\"margin-left: 15px;\">A work environment with an open culture and focus on results;</li>\n<li style=\"margin-left: 15px;\">Courses and continuous training to develop your skills;</li>\n<li style=\"margin-left: 15px;\">Don’t forget to read our <a href=\"https://www.asml.com/en/careers/working-at-asml/netherlands\" rel=\"nofollow\" style=\"color: #1155cc;\" target=\"_blank\">development opportunities</a>.</li>\n</ul>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\"> </p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\"><strong>How to proceed from here?</strong></p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">Are you interested? <strong>Apply now via the Apply button</strong> as a mechanic at ASML! Your application on this vacancy will be treated as an open application. Our recruiters will screen your CV, and if we see a match, we will link your profile with a suitable and challenging position at ASML. We will be in contact with you as soon as possible!</p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">Please note that submitting a motivation letter is not a requirement, but it is a way to better profile yourself.</p>\n<p style=\"color: #222222; font-family: Arial, Helvetica, sans-serif; font-size: small; background-color: #ffffff;\">Want to know more about applying for a job at ASML? Read our <a href=\"https://www.asml.com/en/careers#FAQ\" rel=\"nofollow\" style=\"color: #1155cc;\" target=\"_blank\">frequently asked questions.</a></p>\n"}, {"id": 966499, "url": "https://remotive.io/remote-jobs/all-others/head-of-research-966499", "title": "Head of Research", "company_name": "Dealroomco", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-02T05:41:19", "candidate_required_location": "Europe Only", "salary": "", "description": "<p dir=\"ltr\">The rapid growth of Dealroom.co requires an ambitious and diligent candidate eager to take their career to the next level. Over time Dealroom has built a reputation for high-quality content and driving headlines at The Economist, Financial Times, The New York Times, and other leading titles. We are ready for the next phase. One of the key positions to help Dealroom scale is the<strong> Head of Research. </strong></p>\n<p dir=\"ltr\"><strong> </strong></p>\n<p dir=\"ltr\">As Head of Research, you will have the opportunity to work intimately with the world’s top venture capital firms and most admired companies on cutting-edge research &amp; insights. On a daily basis, you’ll work on a platform for continuous thought leadership &amp; exposure (newsletters, reports, curated on-platform content). With your team of currently 10 domain/sector-analysts, you’ll deliver industry-leading research and insights output, and have front-row access to the ultimate dataset on innovation.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">You’ll work closely with the department’s Head of Content and CEO. You’ll guide the Research Team (today consisting of 10 people) with their research, analysis, and storytelling. Whilst proactively liaising with the sales &amp; marketing teams in the process of delivering client projects. You’ll also work with our data team to work on new insights and new data sourcing.</p>\n<p dir=\"ltr\">If you are focused, hungry and creative, with a good understanding of technology and a proactive mindset, please read further!</p>\n<p><span style=\"font-size: 24px;\"><strong> </strong></span></p>\n<p><span style=\"font-size: 24px;\"><strong>Your tasks and responsibilities</strong></span></p>\n<p dir=\"ltr\">As a Head of Research, you will:</p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Lead and guide a team of 10 research analysts</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Deliver industry-leading research and insights output</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Work closely with clients on research-projects</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Drive efficiency allowing the team to scale in our next growth phase</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Actively work together with the Data, Sales and Client Success teams</p>\n</li>\n</ul>\n<div> </div>\n<p><span style=\"font-size: 24px;\"><strong>What we can offer you</strong></span></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Competitive salary</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Freedom and responsibility to execute on your own ideas</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Positive, empathic and outward-focused colleagues, and customers working at the forefront of innovation and technology</p>\n</li>\n<li dir=\"ltr\">Perks designed to set you up for success in a new reality:\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Home office set up (desk, chair, monitor, etc.)</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Flexible working hours</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Apple or Windows laptop</p>\n</li>\n</ul>\n</li>\n<li dir=\"ltr\">Additionally:\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Take your birthday off</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Daily office lunch</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Travel reimbursement</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Employee Stock Units plan</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Learning &amp; Development budget</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Health &amp; well-being initiatives</p>\n</li>\n</ul>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">More to come!</p>\n</li>\n</ul>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">5+ years experience in a consulting or venture capital firm, or data-driven research or journalism</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Highly numerate with experience in data analysis</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Ability to guide a team on researchers on active projects</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Comfortable and experienced in building client relationships</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">A hunger to drive efficiency without compromising quality</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Demonstrable passion for startups, tech ecosystems, and innovation</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Attention to detail and eye for quality</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Excellent writing skills and an eye for a good story</p>\n</li>\n</ul>\n"}, {"id": 966245, "url": "https://remotive.io/remote-jobs/all-others/course-coordinator-team-lead-966245", "title": "Course Coordinator Team Lead", "company_name": "Kandidate", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-11-01T05:39:49", "candidate_required_location": "USA and UK only", "salary": "", "description": "<p><strong>About Sales Impact Academy</strong></p>\n<p><strong><a class=\"external\" href=\"https://www.salesimpact.io/?utm_term=sales impact academy&amp;utm_campaign=Search - Brand&amp;utm_source=adwords&amp;utm_medium=ppc&amp;hsa_acc=2932944935&amp;hsa_cam=13827336413&amp;hsa_grp=129892075652&amp;hsa_ad=532365266772&amp;hsa_src=g&amp;hsa_tgt=kwd-960951572524&amp;hsa_kw=sales impact academy&amp;hsa_mt=e&amp;hsa_net=adwords&amp;hsa_ver=3&amp;gclid=Cj0KCQjw4eaJBhDMARIsANhrQAAEbndYE5UB-LURGwmrhkkWheWz7gttO73hRJFfqtV78xTriirlJWkaAjlJEALw_wcB\" rel=\"nofollow\">Sales Impact Academy</a> is a major new online educational institution providing a complete live-<br>learning curriculum for B2B go-to-market teams on an annual subscription basis.<br>The traditional higher education system has let the world of B2B down, with a complete lack of<br>formal, structured education across the entire industry. This major oversight has led to totally<br>inconsistent core technical skills across every role in go-to-market teams from leadership through<br>to SDRs, AEs, CSMs, marketing and revenue operations.</strong></p>\n<p>Accomplished sales expertise can be the difference between failure and rampant success, and we want to help not dozens but thousands of companies to grow beyond expectations. This requires sourcing only the most seriously accomplished leaders, then scaling and embedding their expertise inside every B2B tech company on a daily basis. Doing this will transform industries and fulfil personal dreams.</p>\n<p>Sales Impact Academy is an affordable subscription to live, structured sales education from experts with decades of sales success. Our service integrates directly into the working week so its regularly updated classes can be put into practice continuously.</p>\n<p>We call it Sales Education as a Service.</p>\n<p> </p>\n<p><strong>Our Mission</strong><br><br>We’re on a mission to build the world’s largest, a continuous live learning platform for B2B sales and marketing teams by securing titans of industry to coach and teach our classes that<strong> will infuse sales excellence into every B2B business.</strong></p>\n<p>We want to help people at scale reach their full potential, level the playing field for every B2B company in the world and significantly reduce failure rates in startups (90%) and scale-ups (70%).<br>This is no small feat and we need amazing people to help achieve it! You’ll be helping us to launch industry-leading (and industry-redefining) educational content for tech start-up professionals. We are the education layer of the B2B growth stack.</p>\n<p> </p>\n<p><strong>About the role</strong></p>\n<p>We are looking for an experienced, people-centric Team Lead for our growing team of Course Coordinators.</p>\n<p>Course Coordinators work in the Education Team and are responsible for completing a wide variety of tasks such as LMS administration, managing the class videos on Vimeo, reviewing and editing the overall design of class decks, stepping in to co-host live classes, and much more. They are a vital team that ensures everyone in the Education Team has everything they need to execute their roles successfully. The tasks are submitted and managed on a request board system, each task has individual deadlines/requirements and will need to be allocated to the best suited course coordinator based on skill-set, capacity, previous projects, progression wishes etc.</p>\n<p>As the Team Lead, you would be responsible for the overall management and development of the individuals within the team, hiring as the team grows, ensuring varied tasks are successfully navigated and enabling the team to play an active role in the development of our own platform. You will also be working alongside the other Team Leads within the Education Team to facilitate successful communication and focus on quarterly objectives. Finally, you’ll have the opportunity to brainstorm with the Chief Product Officer on education developments and strategies.</p>\n<p> </p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>General management of a team of up to 8 Course Coordinators.\n<ul>\n<li>Weekly 1-1 check-ins with each individual supporting and advising them on acute challenges, coaching them to take on new responsibilities and develop their role and career.</li>\n<li>Coaching the team in individual Personal Development check-ins on a monthly basis.</li>\n<li>Writing detailed reviews and feedback in the company’s review cycles.</li>\n<li>Leading weekly Team Meetings and cascading info and news from the business and other teams to your team.</li>\n</ul>\n</li>\n<li>Managing the hiring process for new Course Coordinators, and liaising with the Course Development &amp; Course Management Teams to plan headcount in the Course Coordinator Team.</li>\n<li>Communicating with other Team Leads within the Education Team and in the wider business to ensure consistency and focus.</li>\n<li>Managing and maintaining the Course Coordinator task board to ensure tasks are assigned appropriately and that workloads are considered across the team.</li>\n<li>Ensuring Course Coordinators maintain consistency of branding, tone of voice, and content across the full range of live SIA courses.</li>\n<li>Leading the Course Coordinator Team on various projects and implementations (e.g implementing a new tool, auditing an aspect of the courses).</li>\n<li>Supporting the Course Coordinators in managing their workloads and various tasks to make sure they’re working efficiently and their support is being provided where needed.</li>\n<li>Analysing and reporting on the workload and efficiency of the team.</li>\n</ul>\n<p><strong>Location :</strong> This role is entirely remote, but we are looking for someone based in either UK time zone in the UK or Eastern Time Zone in the USA.</p>\n<p><strong>Requirements</strong></p>\n<p> </p>\n<ul>\n<li>You have a natural passion for coaching, supporting, and advising others and have 2+ years of experience being a direct line manager as a Team Lead.</li>\n<li>You have leadership knowledge and experience working with other Team Leads.</li>\n<li>You think of each project or challenge as an opportunity for an individual in your team to be supported in their career progression goals.</li>\n<li>You are empathetic and compassionate, always approaching people’s situations with an open mind.</li>\n<li>You have an operational mind, always looking for process improvements and trying to help teams work more efficiently.</li>\n<li>You ideally have some experience in an online learning environment which gives you the ability to think strategically about how we can improve our offering.</li>\n<li>You are able to imagine beyond the current reality, brainstorming new product enhancements, processes and customer benefits, while also having the operational approach to see what is realistically possible.</li>\n<li>You are confident and capable of task-switching and having multiple projects on the go at one time</li>\n<li>You work well across varied teams and you’re confident in managing senior stakeholders.</li>\n</ul>\n<p> </p>\n<p><strong>Our values</strong></p>\n<p><strong>Love learning</strong> - Every day is a chance to grow</p>\n<p><strong>Go fast </strong>- Learn on the way</p>\n<p><strong>Motivation feeds momentum</strong> - If someone’s doing a great job tell them, it’ll lift them up</p>\n<p><strong>Open culture, open comms </strong>- Make others feel comfortable to speak out and feedback</p>\n<p><strong>You do you</strong> - Bring as much of yourself to work as you want, and welcome others when they do</p>\n<p><strong>Channel your inner chameleon </strong>- Adaptation is how we’ll survive and thrive together</p>\n<p><strong>You’ve got this</strong> - Give people freedom, watch them fly</p>\n<p><strong>We live on a spinning rock in space</strong> - So don’t sweat the small things and have some fun</p>\n<p><strong>Benefits</strong></p>\n<p>(USA)</p>\n<ul>\n<li>Work for a company that puts people and culture first</li>\n<li>25 days PTO + National Holidays</li>\n<li>Wellbeing Days to support your mental health</li>\n<li>Two-month safety net from day 1 (no probation periods)</li>\n<li>Access to Spill - mental health support via slack</li>\n<li>Homeworking set-up budget</li>\n<li>Monthly remote socials</li>\n<li>Access to all SIA courses for personal development</li>\n<li>Medical, Dental, Vision</li>\n<li>Life/AD&amp;D</li>\n<li>Short-term and long-term disability</li>\n<li>FSA/HSA</li>\n<li>401(k) - 4% matching</li>\n<li>Employee Assistance Program (EAP)</li>\n<li>70% company contribution (employee only), 50% (spouse, children, family)</li>\n</ul>\n<p>(UK)</p>\n<ul>\n<li>Work for a company that puts people and culture first</li>\n<li>25 days Annual Leave + National Holidays</li>\n<li>Wellbeing Days to support your mental health</li>\n<li>Share options for all employees</li>\n<li>Employee-friendly probation periods</li>\n<li>Private Medical Insurance</li>\n<li>Access to Spill - mental health support via slack</li>\n<li>Flexible working hours and working location</li>\n<li>Homeworking set-up budget</li>\n<li>Monthly remote socials</li>\n<li>Access to all SIA courses for personal development</li>\n<li>Company pension scheme</li>\n</ul>\n"}, {"id": 966794, "url": "https://remotive.io/remote-jobs/all-others/explorer-strategic-projects-966794", "title": "Explorer - Strategic Projects", "company_name": "Uncapped", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-10-31T01:39:48", "candidate_required_location": "Europe Only", "salary": "", "description": "<p><strong>Explorer - Strategic Projects</strong></p>\n<p><strong>A fully remote role based in the UK or Europe</strong></p>\n<p><strong>Role Overview 🚀</strong></p>\n<p>At Uncapped, we help ambitious founders realise their dreams. We are looking for an impact-driven generalist to join our Explore Team as an Explorer. You will enable Uncapped to grow as fast as possible by managing cross-functional projects with a focus on rapid learning and solving challenging problems.</p>\n<p><strong>About Uncapped 👫</strong></p>\n<p>Founded in 2019, Uncapped is the fastest, most affordable way for growing online businesses to fund marketing and inventory. The company was born out of frustration with the limited financing options available for UK and European entrepreneurs to finance growth.</p>\n<p>Uncapped provides business advances of between £10k and £5m without credit checks, personal guarantees, warrants, equity, or compounding interest -- and makes money by charging a low flat fee that is paid back from future sales revenue.</p>\n<p>Uncapped has raised $120 million from investors including Lakestar, Mouro Capital, Global Founders Capital, White Star Capital, Seedcamp, and All Iron Ventures.</p>\n<p><strong>About the Explore Team 🔎</strong></p>\n<p>The Explore team is a learning organisation within Uncapped that takes the most important questions the business needs to answer and solves them through exploration and experimentation. It is a critical team made up of T-shaped generalists who are responsible for their own set of Explore OKRs, which are reviewed on a weekly basis. It can be thought of as our Growth function and sits separate from our core business whose activities are focused on our Core OKRs.</p>\n<p><strong>Your Mission ✍️</strong></p>\n<ul>\n<li>Work with our founders to lead cross-functional projects of the highest importance to the business. These can include learning how we can improve our hiring process, expand to new geographies or widen our sales funnel</li>\n<li>Collaborate with team members across the organisation to explore critical problems and delegate the work required to resolve them</li>\n<li>Support the Explore Lead in setting and reviewing the Explore OKRs based on your view of where the company is bottlenecked</li>\n<li>Ensure the Explore Team and Lead are well-informed and kept up to date on all strategic projects</li>\n<li>Document and present on a wide range of projects internally, including at our all-hands</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>Who you are 👀</strong></p>\n<ul>\n<li>At least 2 years of work experience; probably a former founder or someone with early career experience in a top 10 consulting firm, investment bank or a strategy/business operations/product role at a fast growing startup</li>\n<li>Proven project management skills</li>\n<li>Clear evidence of being able to build, measure, learn and iterate rapidly</li>\n<li>Analytical mind and proficiency in Excel, G-Suite tools</li>\n<li>Mastered prioritization both at a strategic and tactical level</li>\n<li>Great communication and presentation skills</li>\n<li>Comfortable with ambiguity and outcome (rather than output) driven</li>\n<li>Positive attitude, with high integrity and low ego</li>\n<li>Excited to work in a startup environment, not afraid to roll up your sleeves and to be proactive</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>What we offer 🎁</strong></p>\n<p>At Uncapped, our people make us successful. We are a startup with big goals and we work hard, so we want to give everyone the benefits they really want. We’re continually adding to this list as new people join -- here are some of the things you can expect:</p>\n<ul>\n<li>Competitive compensation plan</li>\n<li>Personal growth fund: Raise your game from great to spectacular</li>\n<li>Flexible working: Remote-first processes for ultimate flexibility</li>\n<li>Time off to to rest and see the world (send us a postcard!)</li>\n<li>Your birthday off: Enjoy your special day on us</li>\n<li>Annual retreat abroad: Connect with your team on a paid staff trip</li>\n<li>Weekly recognition and awards: Celebrate wins big and small</li>\n<li>Workspace fit for you: €300 to improve your home office</li>\n<li>The opportunity to make a big impact every day on the lives of European entrepreneurs.</li>\n</ul>\n"}, {"id": 962858, "url": "https://remotive.io/remote-jobs/all-others/clinical-advisor-962858", "title": "Clinical Advisor", "company_name": "MMIT", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-10-29T21:43:20", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h3\">Company Description</div>\n<p><strong><em>Why MMIT?</em></strong> At MMIT (<a href=\"https://www.mmitnetwork.com/\" rel=\"nofollow\">https://www.mmitnetwork.com/</a>), we provide our healthcare clients with a transparent, structured view of complex drug coverage information. We are a company that values:</p>\n<ul>\n<li>     Collaborative teams focused on meeting goals and delivering value</li>\n<li>     Continuous learning and opportunity to grow</li>\n</ul>\n<p>We answer the “what” and the “why” related to drug coverage and reimbursement, leveraging technology, research and industry experts to make sense of how and why specific pharmaceutical drugs are covered. Physicians and pharmacies use our data and applications to understand what drugs are available to patients and how they are covered by health plans. Pharmaceutical manufacturers trust our data to understand how their drug and competitive drugs are covered, which helps forecast performance and tune strategy.</p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong><u>Summary</u></strong><br><br>As part of our Clinical Center of Excellence, the Clinical Advisor will serve as a resource to our Data Operations, Product and Client Management teams.  This role acts as the pharmacy and medical policy subject matter expert; providing deep knowledge of the pharmacy and medical benefit space and a level of clinical independence to drive new client growth and increased client retention.  He/She will be responsible for consultative support, focusing on designated projects depending on specific client needs.  This role may work remotely but may require travel to our main office for meetings as designated by the manager of the Clinical CoE.<br><br><strong><u>Major Responsibilities</u></strong></p>\n<ul>\n<li>Serves as a trusted advisor providing Pharmacy and Medical policy information, insight, and thought leadership</li>\n<li>Researches pertinent policy information in various strategic business initiatives as appropriate to support client solutions</li>\n<li>Supports sales and revenue growth by engaging as a trusted expert in client opportunities through research to support solutions, onsite or video presentations and one on one consultation</li>\n<li>Communicates tactical up-to-date pharmacy and medical policy information in a way that allows clients to understand the impacts of current policy trends</li>\n<li>Partners with, trains and develops various internal personnel to understand and present key Pharmacy and Medical policy  findings</li>\n<li>Provides detailed pharmacy analysis(es) working with our internal platforms along with various partners and PBM's decision support tools to justify the election of the appropriate pharmacy solution</li>\n<li>Provides proactive topical pharmacy and medical policy communication(s) to internal staff</li>\n<li>Contributes to Data Operations, Clinical Center of Excellence team as a collaborative partner and subject matter expert</li>\n<li>Assists in the development of the Pharmacy \"practice\" and helps to implement appropriate changes to our solutions and service(s) to improve client result</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<p><strong><u>Basic Qualifications</u></strong></p>\n<ul>\n<li>BS Pharmacy or PharmD is valued but not required</li>\n<li>5+ years’ experience in the Pharmacy industry working directly with prior authorizations, retail pharmacy, or Specialty pharmacy.</li>\n<li>Comprehensive knowledge of both pharmacy and medical benefit utilization management policies</li>\n<li>Proven ability to exceed expectations and achieve goals</li>\n<li>Excellent presentation and communication skills</li>\n<li>Strong analytical and critical thinking skills</li>\n<li>Strong organization skills with the ability to prioritize in a dynamic environment</li>\n<li>Self-motivated with a strong “can do” attitude</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p><strong>Travel: </strong>Limited</p>\n<p><strong>Location:</strong> Remote on East Coast</p>\n<p>All your information will be kept confidential according to EEO guidelines.</p>\n"}, {"id": 895141, "url": "https://remotive.io/remote-jobs/all-others/director-of-science-895141", "title": "Director of Science", "company_name": "BenchSci", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-10-27T17:41:35", "candidate_required_location": "Anywhere", "salary": "", "description": "<div>BenchSci's vision is to help scientists bring novel medicine to patients 50% faster by 2025. We do this by empowering scientists to run more successful experiments with the world's most advanced, easy to use biomedical artificial intelligence software platform, thereby avoiding delays that slow the progress of medicine to clinical trials. Backed by F-Prime, Inovia, Golden Ventures, and Google's AI fund, Gradient Ventures, we provide an indispensable tool for more than 41,000 scientists that accelerates research at 15 top 20 pharmaceutical companies and over 4,300 leading academic centers. We're a CIX Top 10 Growth company, certified Great Place to Work®, and top-ranked company on Glassdoor.</div>\n<div> </div>\n<div>We're currently seeking a Director of Science to join our team. Reporting to the VP of Product &amp; Science, you will lead BenchSci’s Science Team to build a world-class biomedical research database and manage a team of Subject Matter Experts (SMEs) to develop software products that will empower scientists to run more successful experiments. You will be responsible for ensuring the data is of the highest quality and meets the needs of our users.</div>\n<p><br><br></p>\n<div class=\"h3\">You will:</div>\n<ul>\n<li>Build and champion the Science team vision and regularly communicate the impact of our work internally</li>\n</ul>\n<ul>\n<li>Manage and develop a team of &gt;10 scientists to their full potential</li>\n</ul>\n<ul>\n<li>Recruit, nurture and retain top talent to join our Science Team</li>\n</ul>\n<ul>\n<li>Work with the Director of Product to ensure data requirements are met to support a new suite of innovative products to the market over the first 18 months</li>\n</ul>\n<ul>\n<li>Lead scientific data projects and work closely with the VP of Product and Science and Director of Product to define and execute data initiatives in the Product Roadmap</li>\n</ul>\n<ul>\n<li>Implement best practices to reach a high level of productivity and operational efficiency </li>\n</ul>\n<ul>\n<li>Define clear success measures for the Science Team, and communicate their importance within the company</li>\n</ul>\n<ul>\n<li>Build a bulletproof, productive, and scalable process to ensure the constant seamless increase of data with minimum human involvement</li>\n</ul>\n<ul>\n<li>Monitor data dashboard and statistics to understand current states and improvements within BenchSci’s platform including reagents, experimental data, and bioinformatics data.</li>\n</ul>\n<ul>\n<li>Ensure the highest level of utilization of all data sources </li>\n</ul>\n<ul>\n<li>Be accountable for the accuracy, comprehensiveness, and integrity of data deliverables.</li>\n</ul>\n<ul>\n<li>Collaborate with leadership in Engineering, R&amp;D, Product, Science, Sales, and Marketing to align teams around and deliver product outcomes</li>\n</ul>\n<ul>\n<li>Support commercial efforts by meeting regularly with BenchSci’s leading customers (top-20 pharmaceutical companies) and users (research scientists) to identify the most impactful problems we can address with our technology</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">You have:</div>\n<ul>\n<li>8+ years of research experience in life science research, including 2+ years experience in the pharmaceutical or biotech industry </li>\n</ul>\n<ul>\n<li>3+ years leading and growing high-performing teams</li>\n</ul>\n<ul>\n<li>Collaborated with senior executives to align business and scientific program/portfolio strategy</li>\n</ul>\n<ul>\n<li>Strong executive presence, and come from a place of understanding before implementing change</li>\n</ul>\n<ul>\n<li>[Bonus] Experience managing, analyzing, and maintaining large datasets</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Our benefits and perks:</div>\n<ul>\n<li>An engaging remote-first culture that hires the best talent from around the world</li>\n</ul>\n<ul>\n<li>A competitive compensation package that includes BenchSci equity options </li>\n</ul>\n<ul>\n<li>Comprehensive health and dental benefits with an emphasis on mental health</li>\n</ul>\n<ul>\n<li>An annual Executive Health Assessment at Medcan for proactive health awareness</li>\n</ul>\n<ul>\n<li>Three weeks of vacation plus an additional day for every completed year</li>\n</ul>\n<ul>\n<li>Generous parental leave benefits with a top-up plan or paid time off options</li>\n</ul>\n<ul>\n<li>Additional time-off: Winter Holiday (Dec 25-Jan 1), Summer Holiday, your birthday, and more!</li>\n</ul>\n<ul>\n<li>An Oculus Quest 2 to connect with your team members in Virtual Reality</li>\n</ul>\n<ul>\n<li>An executive coach for managers to assist in leading high-performing teams</li>\n</ul>\n<ul>\n<li>Complimentary Headspace account to support mental wellness and focus</li>\n</ul>\n<ul>\n<li>Complimentary genome sequencing from 23andMe to better understand your health through your DNA</li>\n</ul>\n<div><strong style=\"font-size: 18px;\">Our Culture:</strong></div>\n<div>We believe culture is critical to success and invest accordingly. We live and promote our FASTT values of focused, advancement with speed, tenacity, and transparency. We work hard to maintain an engaging, supportive environment where everyone can do their best work. To learn more, read our <a class=\"postings-link\" href=\"https://blog.benchsci.com/the-benchsci-culture-story-achieving-success-beyond-success\" rel=\"nofollow\">culture deck</a>.</div>\n<div> </div>\n<div><strong style=\"font-size: 18px;\">Diversity, Equity and Inclusion:</strong></div>\n<div>We're committed to creating an inclusive environment where people from all backgrounds can thrive. We believe that improving diversity, equity and inclusion is our collective responsibility, and this belief guides our DEI journey. To learn more, read about our <a class=\"postings-link\" href=\"https://www.benchsci.com/diversity-equity-inclusion\" rel=\"nofollow\">DEI initiatives</a>.</div>\n<div> </div>\n<div><strong style=\"font-size: 18px;\">Accessibility Accommodations:</strong></div>\n<div>BenchSci provides accessibility accommodations during the recruitment process. Should you require any accommodation, we will work with you to meet your needs.</div>\n<div> </div>\n<div>#LI-Remote</div>\n"}, {"id": 893992, "url": "https://remotive.io/remote-jobs/all-others/localization-and-language-specialist-european-spanish-f-m-d-893992", "title": "Localization and Language Specialist – European Spanish (f/m/d)", "company_name": "DeepL", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-10-26T13:42:50", "candidate_required_location": "Germany, the Netherlands, the UK and Poland", "salary": "", "description": "<div class=\"h3\" style=\"box-sizing: border-box; font-family: Roboto, sans-serif; line-height: 1.1; color: #114b76; margin-top: 0px; margin-bottom: 15px; font-size: 20px; background-color: #ffffff;\">DeepL...</div>\n<p>is Germany's best-known AI company. We develop neural networks to help people work with language. With DeepL Translator, we have created the world's best machine translation system and made it available free of charge to everyone online. Over the next few years, we aim to make DeepL the world's leading language technology company.</p>\n<p><strong><span style=\"font-size: 18px;\"><span style=\"color: #1f497d;\"><span style=\"font-size: 20px;\">Our goal is to overcome language barriers and bring cultures closer together.</span></span></span></strong><br> </p>\n<p><strong><span style=\"color: #1f497d; font-size: 20px;\">What distinguishes us from other companies?</span></strong></p>\n<p>DeepL (formerly Linguee) was founded by developers and researchers. We focus on the development of new, exciting products, which is why we spend a lot of time actively researching the latest topics. We understand the challenges of developing new products and try to meet them with an agile and dynamic way of working. Our work culture is very open because we want our employees to feel comfortable. In our daily work we use modern technologies - not only to translate texts, but also to create the world's best dictionaries, and solve other language problems.</p>\n<p>When we tell people about DeepL as an employer, reactions are overwhelmingly positive. Maybe it's because they have enjoyed our services, or maybe they just want to get on board with our quest to break down language barriers and facilitate communication.</p>\n<p> </p>\n<p><strong><span style=\"color: #1f497d; font-size: 20px;\">What will you be doing at DeepL?</span></strong></p>\n<p>Thanks to our unique AI language technology, DeepL is able to provide the world’s best translation quality. To keep it that way, we need your expert linguistic, and outstanding communication skills.<br>You will be working in a highly motivated team of language experts and helping us with a wide array of tasks including translation, proofreading, or editing, reviewing language data, assisting in press campaigns, advising on various cultural aspects of your language, and much more.<br>We can’t wait to meet you!</p>\n<p> </p>\n<p><span style=\"font-size: 20px;\"><strong><span style=\"color: #1f497d;\"><span style=\"font-size: 20px;\">Your responsibilities</span></span></strong></span></p>\n<ul>\n<li>Localize and proofread from English into Spanish</li>\n<li>Write and edit Spanish language content</li>\n<li>Advise on aspects of Spanish language and culture </li>\n<li>Test and evaluate machine translation data</li>\n<li>Assist in PR campaigns for the Spanish-speaking media</li>\n<li>Communicate ideas and suggestions relating to our Spanish language service to other team members</li>\n</ul>\n<p><strong><span style=\"color: #1f497d;\"><span style=\"font-size: 20px;\">What we offer</span></span></strong></p>\n<ul>\n<li>Meaningful work: Our goal is to break down all language barriers and bring different cultures closer together </li>\n<li>A friendly, international, and highly committed team</li>\n<li>The chance to work on a product that is already used by over 100 million people</li>\n<li>Regular team events</li>\n<li>Lots of flexibility and an extremely comfortable office in Cologne</li>\n</ul>\n<p><strong><span style=\"color: #1f497d; font-size: 20px;\">About you</span></strong></p>\n<ul>\n<li>You are fluent in European Spanish and are familiar with the linguistic and cultural details of the language</li>\n<li>You are aware of the different varieties of Spanish and have experience working with them</li>\n<li>You are fluent in English and feel comfortable communicating in English (written and spoken)</li>\n<li>Minimum of 2 years of translation / localization experience, especially for website, app and marketing content</li>\n<li>Experience in language quality assurance</li>\n<li>Knowledge of other languages, e.g. German or French, is a plus</li>\n<li>Experience working with UX-design and copywriting teams is a plus</li>\n<li>Experience writing Spanish language content is a plus</li>\n</ul>\n<p> </p>\n<p><strong><span style=\"color: #1f497d; font-size: 20px;\">We are looking forward to your application!</span></strong></p>\n"}, {"id": 929939, "url": "https://remotive.io/remote-jobs/all-others/agile-coach-929939", "title": "Agile Coach", "company_name": "Auth0", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-10-22T01:58:12", "candidate_required_location": "USA and Canada", "salary": "", "description": "<div class='\"content-intro\"'>\n<p>Awesome tech is made by awesome people. And we’re always looking for new team members who bring the energy, passion, commitment, and collaboration that has made Auth0 the great company it is today.</p>\n<p>So what do we exactly build? Auth0 is an authentication and authorization platform designed by developers for developers. Basically, we make companies’ login boxes safe, secure, and seamless for anyone logging in. Our mission is to secure the world’s identities so innovators can innovate. But it’s a big mission that requires a lot of teamwork. </p>\n<p>Words, code, or people, whatever your skill, there’s a place for you here</p>\n</div>\n<div class='\"jsx-1083908602'>\n<div>We are looking for a Coach to join our <strong>Business Agility</strong> team which serves, coaches, and inspires our product development teams. The Business Agility team is made up of champions and guides of agile and lean principles. We foster employee engagement to inspire innovative solutions and we are passionate about cultivating processes and practices that promote effective delivery of quality products our customers love.</div>\n<div> </div>\n<div>This is a full time role enabling the continuous improvement of our highly productive teams of smart and engaged people. Successful candidates will be located ...</div>\n<div> </div>\n<div>Auth0 has been remote friendly since inception and embraces a remote work style. Most employees work remotely and we have the tools and resources in-place to ensure success. Not only are we looking for a talented Coach, we are looking for someone who will contribute to our <a class='\"postings-link\"' href=\"%22https:/auth0.com/careers/culture%22\" rel=\"nofollow\">culture</a>.</div>\n</div>\n<div class='\"jsx-2259761220'>\n<div class=\"h2\" title=\"\">You will:</div>\n<ul class='\"jsx-2259761220'>\n<li>Provide customized coaching and training geared toward increasing engagement, adaptability, and resilience.</li>\n<li>Enable self-organization, experimentation, and learning.</li>\n<li>Foster a mission-driven and continuous improvement culture.</li>\n<li>Provide guidance and support for all aspects of the product development life cycle.</li>\n<li>Design practices and processes that support the way people work.</li>\n<li>Bring about change through engagement and the creation of shared value.</li>\n<li>Teach techniques to increase focus and reduce WIP.</li>\n<li>Help people interpret data along with the context surrounding it.</li>\n<li>Act as a guide for collaboration and effectiveness.</li>\n<li>Guide change with indirect leadership techniques.</li>\n<li>Facilitate reflection on both the customer experience and internal processes.</li>\n<li>Guide the creation of measurable objectives.</li>\n<li>Coach work-breakdown to the smallest valuable and feasible increment.</li>\n<li>Teach techniques to estimate capacity, velocity and throughput.</li>\n<li>Teach forecasting techniques.</li>\n<li>Teach interpretation of flow metrics and analytics.</li>\n<li>Provide 1-1 mentorship.</li>\n<li>Foster a Lean and Agile mindset.</li>\n<li>Cultivate trust and psychological safety.</li>\n</ul>\n</div>\n<div class='\"jsx-2259761220'>\n<div class=\"h2\" title=\"\">You are a good fit if you:</div>\n<ul class='\"jsx-2259761220'>\n<li>Have excellent communication and facilitation skills.</li>\n<li>Love leading and inspiring people to reflect and learn.</li>\n<li>Are comfortable challenging the status quo.</li>\n<li>Have a passion for visualizing data.</li>\n<li>Value surfacing unintended consequences.</li>\n<li>Are comfortable engaging people in healthy discord.</li>\n<li>Value engagement, adaptability, and resilience.</li>\n<li>Enjoy rapidly changing environments.</li>\n<li>Lead with curiosity.</li>\n<li>Excel at using data-driven analysis to measure and enable continuous delivery.</li>\n<li>Value the intent behind practices like retrospectives, iteration planning, daily stand-ups, backlog refinement, TDD, pair programming, frequent and iterative delivery, and fast feedback loops.</li>\n<li>Are biased towards delivery, transparency, honesty, learning and innovation.</li>\n<li>Strive to inspire the agile mindset at all levels.</li>\n<li>Have experience using Jira and GitHub.</li>\n<li>Enjoy exploring opportunities to build relationships in remote work environments.</li>\n<li>Have experience scaling tools, processes, practices and mindset in a rapidly growing company.</li>\n<li>Constantly seek new ways of approaching common problems.</li>\n<li>Relish in helping teams improve their approach to enable more frequent delivery and feedback loops.</li>\n<li>Have at least 2 years experience as a servant leader to engineering teams in an agile organization.</li>\n</ul>\n</div>\n<div class='\"jsx-2259761220'>\n<div class=\"h2\" title=\"\">Preferred Locations:</div>\n<ul class='\"jsx-2259761220'>\n<li>Canada Remote, US Remote</li>\n</ul>\n</div>\n<div class='\"content-conclusion\"'>\n<p>Auth0 makes the internet safer by safeguarding billions of login transactions each month.</p>\n<p>Our team is spread across more than 35 countries and we are proud to continually be recognized as a<a href=\"%22https:/auth0.com/press/awards%22\" rel=\"nofollow\"> great place to work</a>. Culture is critical to us, and we are transparent about our<a href=\"%22https:/auth0.com/blog/rethinking-your-workforce-strategy-a-look-at-culture-in-2021/%22\" rel=\"nofollow\"> vision and principles</a>. We practice N+1&gt;N which applies to everything from our people to how we iterate our tech; we believe in one team, one score; and we give a shit about everything we do.</p>\n<p>Research shows that candidates from underrepresented backgrounds often don’t apply unless they meet all the job criteria. We aren’t looking for someone who ticks every single box on a page; we’re looking for lifelong learners and people who can make us better with their unique experiences. If you think you’d be a great fit, then please get in touch to tell us about yourself.</p>\n<p>Auth0, recently acquired by Okta, is an Equal Employment Opportunity employer. Auth0 conducts all employment-related activities without regard to race, religion, color, national origin, age, sex, marital status, sexual orientation, disability, citizenship status, genetics, or status as a Vietnam-era special disabled and other covered veteran status, or any other characteristic protected by law. Auth0 participates in E-Verify and will confirm work authorization for candidates residing in the United States.</p>\n</div>\n"}, {"id": 920910, "url": "https://remotive.io/remote-jobs/all-others/interviewer-event-host-business-finance-920910", "title": "Interviewer/Event Host - Business/Finance", "company_name": "Inside.com", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-10-19T17:42:32", "candidate_required_location": "USA and Canada", "salary": "", "description": "<p><strong>100% remote, full-time or part-time, USA or Canada-Based</strong></p>\n<p>Inside is on a mission to make people smarter! We specialize in covering the latest news and innovations in business, tech, and venture capital through media (newsletters and podcasts), events, and community. Founded by Jason Calacanis, Inside is a fully remote team of entrepreneurs, innovators, and doers. Join us!</p>\n<p>We are looking for a dynamic and driven event host/moderator/interviewer who is passionate about learning, growing, and educating our audience about the world of business and finance. As our ideal candidate, you are passionate about the attendee experience, highly organized, accountable, and thrive in collaborative hyper-growth environments. </p>\n<p>As an event host/moderator/interviewer, you'll help set the event's agenda, which includes brainstorming and deciding what topics to cover, how to cover them, and preparing questions that will engage both the interviewee or panel of speakers and the attending audience. You will also participate in the event's production.</p>\n<p>You will conduct guest interviews and/or moderate panels sometimes with other team members. Hence, the right person is someone who loves working on a team, thrives on deadlines, and sees an event or interview idea everywhere they go. They are passionate about business and finance. They are an excellent and empathetic listener. They are eager to interact with the audience whenever possible.</p>\n<p> </p>\n<p><strong>What we're looking for</strong></p>\n<ul>\n<li>3-5 years of experience in event hosting, podcasting, or interviewing</li>\n<li>Knowledge of virtual event/webinar/content hosting platforms (ex. Zoom, Hopin, StreamYard, YouTube, etc..) is preferred</li>\n<li>Expert organizational, documentation, and communication skills (written, verbal, visual)</li>\n<li>Comfortable working &amp; communicating with individuals of all professional levels, including senior-level management</li>\n<li>Passionate about the audience experience </li>\n<li>Thrive in a fast-paced startup </li>\n<li>Data-driven &amp; results-driven, with a strong, competitive desire to win </li>\n<li>Creative thinker who pushes the limits</li>\n<li>Meet tight deadlines and maintain composure in high-pressure situations </li>\n<li>Portfolio of past work highly recommended</li>\n</ul>\n<p><br><br></p>\n<p>We are currently hiring for a full-time or part-time role.</p>\n<ul>\n<li><strong>Full-time</strong> ($60k/yr + competitive benefits)</li>\n<li><strong>Part-time</strong></li>\n</ul>\n<p> </p>\n<p>Still reading? Apply!</p>\n<p> </p>\n"}, {"id": 921730, "url": "https://remotive.io/remote-jobs/all-others/delivery-manager-921730", "title": "Delivery Manager", "company_name": "Roostify", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-10-18T14:01:02", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>Who We Are</strong></p>\n<p>At Roostify, we are a team of innovative thinkers on a mission to reinvent the home lending experience. We believe that home lending should be a fair, fast, and transparent experience for lenders and homebuyers. So, we designed an innovative platform that simplifies the lending experience and empowers lenders to support their clients during one of the most significant milestones of their lives. Currently, Roostify  is used by the largest lenders in the country to improve lending experiences every day. </p>\n<p><strong>Challenges You Will Solve</strong></p>\n<p>The Service Delivery team at Roostify is responsible for managing platform and software projects and helping our enterprise business customers adopt new features, consume releases, and manage change. We work with Product, Engineering, Support, and Customer Success teams to ensure that our platform and our customers’ businesses evolve together. We facilitate and enhance Roostify’s product and software delivery lifecycle in order to bring our features to market in a predictable manner that exceeds our customer’s expectations.</p>\n<p>The Senior Delivery Manager will work collaboratively with Product, Engineering, and Support teams to successfully manage the delivery of multiple initiatives across our largest client. The Senior Delivery Manager will organize and facilitate key planning, release readiness, and steering committee meetings, and provide guidance and coaching for other Product Managers, Software Engineers, and Project Managers.</p>\n<p>The Senior Delivery Manager will also be expected to assume project management responsibility for cross-functional dependencies, meeting industry, business, and technical requirements.  They will build schedules and project plans, manage risks and interdependencies, work through multiple competing priorities, and ultimately ensure high quality and on-time delivery of complex technical projects.</p>\n<p><strong>What You’ll Do</strong></p>\n<ul>\n<li>Manage multiple Delivery projects from start to finish across all workstreams for one or more clients</li>\n<li>Ensure project schedule, key milestones, and deliverables are clearly understood by the project team members from Product, Engineering, and Support; support the presentation of the project schedule and weekly updates by the project manager to the client</li>\n<li>Manage change control, to ensure that any changes in scope factor in impacts to schedule or budget/resources and work with Sales to fully execute associated contract amendments</li>\n<li>Proactively identify and mitigate project risks and manage client’s program level interdependencies</li>\n<li>Communicate project status, issues, and solutions to all stakeholders (internal and external)</li>\n<li>Facilitate decision making for scope/schedule/budget tradeoffs and project milestones (facilitation &lt;&gt; decision maker) across the client’s project portfolio</li>\n<li>Ensure Roostify’s operational readiness for client specific implementation and delivery of new features, which may include areas such as support, deployment, alerts and monitoring, performance, compliance, documentation, reporting, and training</li>\n<li>Define and document the delivery methodology, as agreed upon by Engineering, Product, and Delivery teams</li>\n<li>Drive awareness and encourage adherence to the Agile delivery methodology</li>\n<li>Suggest improvements to the methodology based on field experience and client interactions</li>\n<li>Organize and facilitate key client program wide milestone meetings (e.g. release planning, go/no-go decisions, etc.)</li>\n<li>Measure the results of Roostify’s project deliveries, with the goal to improve predictability and quality, while limiting unnecessary overhead and promoting an Agile approach</li>\n</ul>\n<p><strong>What You’ll Bring</strong></p>\n<ul>\n<li>8+ years experience managing complex software implementations</li>\n<li>Demonstrated experience driving improvements to software delivery methodologies</li>\n<li>Experience with Cloud based SaaS products and infrastructure</li>\n<li>Extensive experience with Scrum agile methodology required and experience with other methodologies a plus (e.g. Kanban, waterfall)</li>\n<li>Expertise with the Atlassian tool set a plus and experience with other software development tool sets a plus</li>\n<li>Experience with project management software</li>\n<li>A willingness to learn new technologies as needed</li>\n<li>Agile certifications and other project management certifications a plus, although not required</li>\n</ul>\n<p><em>Roostify HQ is located in San Francisco, CA, and we are open to remote work within the USA for this role. </em></p>\n<p><strong>Benefits &amp; Perks</strong></p>\n<p>At Roostify we know that people do their best when they feel their best; we care about our people and want them to thrive. Here are some of the benefits we’re proud to offer our full-time team members:</p>\n<ul>\n<li>Competitive Salary &amp; Equity Packages</li>\n<li>Health, Dental, and Vision Plans</li>\n<li>401K with match</li>\n<li>Flexible Vacation Time</li>\n<li>Tuition Reimbursement Program</li>\n<li>Bonus Program</li>\n</ul>\n<hr>\n<p><strong>Roostify is an Equal Opportunity Employer </strong></p>\n<p>At Roostify, we put people first. We strive to provide the best experiences to our employees and candidates. We consider applicants without regard to race, color, national origin, sex, age, religion, sexual orientation, gender identity, veteran status, marital status, physical or mental disability, or other protected classes under all local, state, and federal laws and ordinances. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>\n<p> </p>\n"}, {"id": 920301, "url": "https://remotive.io/remote-jobs/all-others/regulatory-intelligence-senior-specialist-920301", "title": "Regulatory Intelligence Senior Specialist", "company_name": "REDICA Systems", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-10-17T13:46:08", "candidate_required_location": "USA Only", "salary": "", "description": "<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p>Redica Systems is a forward-thinking technology company leveraging data, analytics, and expertise to deliver meaningful insights to quality and safety professionals around the world. By applying artificial intelligence to large and disparate government data sets, Redica Systems empowers our customers to improve compliance, increase product quality, and build a more efficient organization. </p>\n<p>We serve life science customers in the pharmaceutical, medical device, and food industries, including 19 of the top 20 pharmaceutical companies and 9 of the 10 top medical device companies. </p>\n<p>Headquartered in Pleasanton, CA, we’re open to remote work for candidates residing in the US. Let's talk!</p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p>We’re looking for a curious, team-oriented, data connoisseur with a passion for getting stuff done. Your primary role is shaping and participating in proactive global monitoring and surveillance activities of the full drug development lifecycle in support of our suite of regulatory and compliance intel products and services. </p>\n<p>This is an ideal role for someone interested in taking their hard-won knowledge and experience in the Life Science industry and applying it in a new and groundbreaking way. For the right person, this role could be shaped to accommodate a 3 - 4 day work-week.</p>\n<p>Key Responsibilities</p>\n<ul>\n<li>Play an active role in global regulatory intelligence activities, such as monitoring, acquiring, tracking, and categorizing information pertaining to the changing global regulatory landscape within the Life Science industry. </li>\n<li>Participate in shaping the automation, tools, and processes supporting regulatory intelligence operations.</li>\n<li>Applying your knowledge and experience of quality compliance and regulatory intelligence to mission-critical projects, including structuring and analyzing compliance data. </li>\n<li>Analyzing large datasets relevant to quality and compliance.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<ul>\n<li>Substantive experience in the Pharmaceutical or Medical Device industries with a focus on Quality Assurance, Regulatory, or Compliance.\n<ul>\n<li>A renaissance person with the combination of:</li>\n<li>Strong verbal and written comprehension skills. </li>\n<li>Good problem-solving abilities. </li>\n<li>Strong math and organizational skills.</li>\n</ul>\n</li>\n<li>Solid Excel experience. </li>\n<li>Proven experience effectively juggling multiple, time-sensitive projects, while maintaining crisp attention to detail.</li>\n<li>A keen interest in joining a forward-thinking technology company that is shaping the digital transformation and delivery of quality and regulatory intelligence.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p>Top Pharmaceutical Companies, Food Manufacturers, Medical Device Companies, and Service firms from around the globe rely on Redica Systems to mine and process government inspection, enforcement, and registration data in order to quantify risk signals about their suppliers, identify market opportunities, benchmark against their peers, and prepare for the latest inspection trends. Our data and analytics have been cited by major media outlets such as MSNBC, WSJ, and the Boston Globe. </p>\n<p>Redica Systems is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, disability, or veteran status.</p>\n<p>All your information will be kept confidential according to EEO guidelines.</p>\n"}, {"id": 919909, "url": "https://remotive.io/remote-jobs/all-others/technical-project-manager-919909", "title": "Technical Project Manager", "company_name": "sketchbox", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-10-15T06:00:50", "candidate_required_location": "North America Only", "salary": "", "description": "<p style=\"min-height: 1.5em;\"><strong>We are:</strong></p>\n<p style=\"min-height: 1.5em;\">Sketchbox, and we believe Virtual Reality will fundamentally change the way people learn; it will democratize access to learning, in a way which hasn’t been seen since the early, halcyon days of the Internet. We’re building the underlying infrastructure that will power the future of learning in Virtual Reality.  </p>\n<p style=\"min-height: 1.5em;\"><br>We hire people who want to hit the ground running and we give you enough autonomy so you can start making an impact from day one. </p>\n<p style=\"min-height: 1.5em;\"><br>Sketchbox is a remote company backed by some of Silicon Valley’s top venture firms including YCombinator and General Catalyst. We are open to remote applicants.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">We were in the W2018 batch of Y-Combinator. We work with organizations like 3M, IBM and the US Air Force.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>We are looking for:</strong></p>\n<p style=\"min-height: 1.5em;\">An experienced technical project manager, who can work cross-functionally with engineering, product management, and other stakeholders, implementing lightweight solutions to ensure quality, predictability and transparency in the development process</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Responsibilities</strong></p>\n<p style=\"min-height: 1.5em;\">• Work with the engineering team to build and maintain the schedules for their projects</p>\n<p style=\"min-height: 1.5em;\">• Drive smart decisions about resource management when prioritizing multiple complex projects</p>\n<p style=\"min-height: 1.5em;\">• Collaborate with project managers in other parts of the organization to support healthy feature development throughout Unity</p>\n<p style=\"min-height: 1.5em;\">• Ensure partners and in-house teams work together fluently, respecting divergent processes and cultures</p>\n<p style=\"min-height: 1.5em;\">• Design process solutions that address issues/impediments without hampering progress or autonomy of developers</p>\n<p style=\"min-height: 1.5em;\">• Create regular project status updates for internal and external stakeholders</p>\n<p style=\"min-height: 1.5em;\">• Support Unity’s core values: Democratize Development, Solve Hard Problems, and Enable Success</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Requirements</strong></p>\n<p style=\"min-height: 1.5em;\">• Proven experience in software project management, working cross functionally within an engineering organization</p>\n<p style=\"min-height: 1.5em;\">• Experience with multiple project management methodologies, including agile and waterfall</p>\n<p style=\"min-height: 1.5em;\">• Literacy with multiple issue-tracking systems - ClickUp esp.</p>\n<p style=\"min-height: 1.5em;\"><strong>Bonus Points</strong></p>\n<p style=\"min-height: 1.5em;\">• Excellent communication skills, both written and oral</p>\n<p style=\"min-height: 1.5em;\">• Experience in one or more of the following areas: software engineering, voice communication, game development (Unity engine or otherwise)</p>\n<p style=\"min-height: 1.5em;\"><br><br><br></p>\n"}, {"id": 919980, "url": "https://remotive.io/remote-jobs/all-others/social-video-producer-919980", "title": "Social Video Producer", "company_name": "pipeline", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-10-12T22:11:32", "candidate_required_location": "Anywhere", "salary": "", "description": "<div class=\"h2\"><strong>What we do</strong></div>\n<p style=\"min-height: 1.5em;\">Our goal at Pipeline is to help content creators turn their passion into a career. Consumption of online media is growing quickly and there are millions of new creators starting their journey each month. We believe that anyone who is deeply passionate about a niche and willing to put in the work can be a successful creator. Pipeline was created to provide the best environment for new creators to succeed through premium educational content and a supportive community.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Who we are</strong></div>\n<p style=\"min-height: 1.5em;\">Gamers, creators, streamers, esports fans, Twitch mods, designers, vloggers - we’ve been through this journey ourselves. Pipeline was founded by <a href=\"https://twitter.com/snoopeh\" rel=\"nofollow\">Snoopeh</a> and <a href=\"https://www.facebook.com/StoneMountain64\" rel=\"nofollow\">StoneMountain64</a>, who have each successfully built careers as creators and are now looking to share what they’ve learned to support the next generation. Our team is passionate about online content creation and we’re moving fast to build out the education and community platform we wish we had when we were starting out. We’re a young startup that’s loved by thousands of creators, we’re profitable, and we’re growing quickly. 🚀</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Job Description</strong></div>\n<p style=\"min-height: 1.5em;\">We’re looking for an inventive Social Video Producer to join our growing Marketing team and help scale our creative reach. The Social Video Producer will be responsible for ideating, producing, and editing short-form video content for distribution on organic social channels as well as user acquisition campaigns on socials, Google, YouTube, and more. You’ll get the chance to empower thousands of content creators while working alongside some of the top creators in the industry. This is a full-time remote position.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">Please include link to reel/portfolio in resume. Short-form content samples (YouTube Shorts/TikToks/IG Reels) a huge plus.<br><br></p>\n<div class=\"h2\"><strong>Responsibilities</strong></div>\n<ul>\n<li>Collaborate with teams across social, design, and marketing to produce video content for social media, digital marketing campaigns, and the Pipeline website</li>\n<li>Own the production process end-to-end; from ideation to storyboarding, producing, editing, and executing post-production deliverables</li>\n<li>Pitch and develop video topic ideas taking into account our brand identity, audience, and current trends</li>\n<li>Create and maintain an editorial calendar for video content on social media</li>\n<li>Engage in creative problem solving and evaluate video performance analytics</li>\n<li>Maintain production status tracking and performance documentation</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Skills and Experience</strong></div>\n<ul>\n<li>3+ years of experience as a digital content producer (including direct experience ideating, producing, and editing content)</li>\n<li>Experience working in gaming, streaming, and/or content creation space(s) and a great sense of the style, aesthetic, and formats that work for digital content in these spaces</li>\n<li>Experience using Adobe CC (Premiere, After Effects, Photoshop)</li>\n<li>Thorough understanding of all social media channels and emerging digital channels</li>\n<li>Comfortable working for a fast-paced startup</li>\n<li>Excellent project management and organizational skills</li>\n<li>BONUS: passion and experience working with short-form content (Instagram Reels, YouTube Shorts, TikTok)</li>\n<li>HUGE BONUS: experience working on paid social ads (Facebook, Instagram and YouTube)</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Benefits</strong></div>\n<ul>\n<li>💰 Competitive Compensation + Stock Options</li>\n<li>⌚ Flexible, Remote Work Schedules</li>\n<li>🏥 Medical Insurance including Health, Dental, Vision, and Life</li>\n<li>🏖️ Unlimited Vacation and Sick Days</li>\n<li>🤝 Access to Corporate Partner Discounts</li>\n</ul>\n"}, {"id": 917809, "url": "https://remotive.io/remote-jobs/all-others/program-manager-federal-917809", "title": "Program Manager - Federal", "company_name": "Skydio", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-10-10T14:03:21", "candidate_required_location": "USA Only", "salary": "", "description": "<div class='\"content-intro\"'>\n<p>Skydio is the leading US drone manufacturer and world leader in autonomous flight, the key technology for the future of drones and aerial transportation. The Skydio team combines deep expertise in artificial intelligence, best-in-class hardware and software product development, and operational excellence to empower a broader, more diverse audience of drone users - from action sports enthusiasts to first responders.</p>\n</div>\n<p><strong>*This role is remote<br><br>About the role:</strong></p>\n<p>Skydio is looking for a driven Program Manager with a deep sense of ownership to lead and drive all aspects of implementation and delivery for our federal customers. You will be Skydio’s federal customer liaison and broadly responsible for the success of our contracts to include: cost, performance, scheduling, project planning, technical execution, risk management and problem solving. Internally, you work hand in hand with Engineering and Sales to develop plans, solve problems and communicate risk and progress to executives. A successful candidate will become an indispensable bridge between federal customers and Skydio’s extremely agile and world class technical teams. This role reports to the Director, Federal Programs and will work closely with our Product, Engineering, and Sales functions to deliver industry leading autonomous solutions on schedule. </p>\n<p><strong>How you'll make an impact:</strong></p>\n<ul>\n<li>Be a highly collaborative, requirements driven planner with a deep sense of ownership and accountability with a willingness to roll up sleeves and dive into the details.</li>\n<li>Manage production and NRE programs across Federal verticals against cost, schedule and technical requirements as well as execute vision and scale of processes to expand our Federal customer base</li>\n<li>Understand customer requirements and translate them to Skydio’s agile product and technical teams to drive development and delivery execution. </li>\n<li>Establish relationships with Government customers and be technical enough to build &amp; drive plans with Skydio’s engineering team’s to meet milestones.</li>\n<li>Inform Skydio and customer business and program leaders regarding contract management risks and opportunities, ensuring a coordinated and comprehensive approach to product delivery across the program.</li>\n<li>Help capture new opportunities through proposal response with your knowledge of the Federal Acquisition Regulations (FAR) and other Government contracting regulations to ensure Skydio compliance.</li>\n<li>General support of go-to-market &amp; business activities as required.</li>\n</ul>\n<p><strong>What makes you a good fit:</strong></p>\n<p>Requirements</p>\n<ul>\n<li>Active Secret or Top-Secret Security Clearance or ability to obtain</li>\n<li>Ability to travel up to 40% of the time</li>\n<li>Ability to obtain FAA Part 107 Certification</li>\n</ul>\n<p>Experience &amp; Skills</p>\n<ul>\n<li>Excellent communication skills, both written and verbal, and a strong focus on project management tools and concepts.</li>\n<li>Proven track record of implementing new technology, agile development and interfacing with technical teams to deliver on customer schedules. </li>\n<li>Experience in implementing effective internal business systems, processes and controls for management of large scale Federal customers</li>\n<li>Successful management of contracts and/or programs within the Department of Defense or other Federal Customers. </li>\n<li>Experience with firm fixed price, indefinite demand indefinite delivery contracts and Other Transaction Authority Agreements</li>\n<li>Experience with DOD and commercial Unmanned Aircraft Systems and related software development. </li>\n<li>Government Program Management experience, to include: Technology Assessments, Systems Design, Systems Analysis, Programmatic Support, Acquisition Planning, and Budget Planning.</li>\n<li>Understanding of the DoD acquisition process, the FAR, and DFAR</li>\n<li>Ability to address complex procurement related matters and recommend solutions to acquisition challenges</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<p><br><br>At Skydio we believe that diversity drives innovation. We have created a multi-disciplinary environment that embraces the power of diverse perspectives to create elegant solutions for complex problems. We are committed to growing our network of people, programs, and resources to nurture an inclusive culture.  <br><br>As such, we do not make hiring or other employment-related decisions on the basis of an applicant or employee’s race, color, ethnicity, national origin, citizenship, sex (including pregnancy, childbirth, breastfeeding and related medical conditions), pregnancy, gender, gender identity or expression, age, religion, disability status, sexual orientation, marital status, medical condition, generic information or characteristics, veteran, military or family status, or other classifications protected by applicable federal, state or local anti-discrimination laws.</p>\n<p><em>For positions located in the United States of America, our company Skydio, Inc. uses E-Verify to confirm employment eligibility. To learn more about E-Verify, including your rights and responsibilities, please visit <a href=\"%22https:/www.e-verify.gov/%22\" rel=\"nofollow\" target='\"_blank\"'>https://www.e-verify.gov/</a></em></p>\n</div>\n"}, {"id": 907395, "url": "https://remotive.io/remote-jobs/all-others/people-developer-for-development-department-907395", "title": "People Developer (for development department)", "company_name": "Optiweb", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-10-01T14:21:18", "candidate_required_location": "Europe Only", "salary": "", "description": "<p dir=\"ltr\"><strong>As People Developer, you will focus on the following tasks: </strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">team leadership (in charge of employee development &amp; motivation, recruiting, compensation);</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">projects overview and resource management (in cooperation with tech lead and project managers);</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">monthly sales planning (in cooperation with the sales department);</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">managing team meetings and attending management meetings;</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">maintaining team profitability;</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">annual strategic planning (in cooperation with the tech lead and company management).</p>\n</li>\n</ul>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">You will love this job if you like:</p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">working with (and for) people; 👨🏽‍💼👩‍💼</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">numbers; 📈</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">strategic thinking. 🤯</p>\n</li>\n</ul>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">Each of the responsibilities above is actually a mosaic of many different tasks - come over for a coffee ☕, we are super excited to tell you more!</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">You don’t know our development department structure yet? We are happy to help you out - find below our brand new organigram with three People Developer positions. If you have any preferences, you can even choose the team that you would like to manage most.</p>\n<p dir=\"ltr\"> </p>\n<p style=\"max-width: 852px; width: 100%;\"><img height=\"389\" src=\"https://recruitee-main.s3.eu-central-1.amazonaws.com/uploads/92f3n19737/screenshot-www.figma.com-2021.09.17-09_20_47.png\" style=\"max-width: 852px; width: 852px; height: 389px;\" width=\"852\"></p>\n<p> </p>\n<p> </p>\n<p dir=\"ltr\"><strong>Career path</strong></p>\n<p dir=\"ltr\">You are an ideal candidate for the position of People Developer if:</p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">You have already worked as a <strong>tech lead</strong> and now also want to hone your people management skills while staying close to the IT field.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">You have experience as a <strong>developer</strong> and would now like to take over a leadership role. Don’t worry, we’ll make sure you get the knowledge and the skills you need.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">You are a successful <strong>project manager</strong> working closely with developers, who sees the position of people developer as the next step in their career.</p>\n</li>\n</ul>\n<p dir=\"ltr\"> </p>\n<div dir=\"ltr\">\n<p dir=\"ltr\"><strong>Our current technologies </strong></p>\n<p dir=\"ltr\">As a People Developer, your main focus will not be on technology (this is your Tech Lead’s job), but you should still know the technologies mentioned below. And if our list raises any questions, you should already be searching the web, using your passion for IT and unlimited curiosity to expand your knowledge.</p>\n<p dir=\"ltr\"> </p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Open source platforms: Pimcore, Shopware, Magento, WordPress</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Backend: PHP, MySql, microservices with REST API</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Frontend: Knockout.js, jQuery, vue.js</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">CI / CD tools: Git, Docker, Gitlab</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Other: Kafka, Symfony and Laravel for custom apps (see our configurator: <a href=\"https://www.corsair.com/eu/en/custom-cooling-configurator/\" rel=\"nofollow\">https://www.corsair.com/eu/en/custom-cooling-configurator/</a>)</p>\n</li>\n</ul>\n</div>\n<p> </p>\n<div dir=\"ltr\">\n<p dir=\"ltr\"><strong>What we offer</strong></p>\n<p> </p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Location: Remote, hybrid model or at our offices (Škofja Loka/ Ljubljana) - your call</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Salary: 2.800 - 4000 € gross (depending on your experience) and regular salary progression</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Other financial benefits: Highest payouts within meal and transportation compensation, maximum annual holiday allowance payout (i.e., regres), Christmas bonus, performance bonus and compensation for remote work.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Work equipment: Budget of 3000 € - 34’’ monitor, above average laptop, mouse, keyboard, extra cables, extra charger for remote office, connectors, budget for buying equipment for remote work</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Transparency and people-first culture: Transparent communication about the company (both in terms of finances and procedure-wise), \"people-first\" culture (a day off on your birthday, relaxed work environment and awesome culture …)</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Working with well-known brands:Corsair, Mass, Intersport, Bigbang, Iglusport, Pikapolonica, The Athlete’s Foot, Malalan, Sam ...</p>\n</li>\n</ul>\n</div>\n<p> </p>\n<p dir=\"ltr\"><strong>Are you the right person for this challenge? We can’t wait to meet you! </strong>The applications are open until the <strong>8th of October 2021</strong>. </p>\n<p dir=\"ltr\"><strong>(If not, you can still think about your friend or colleague and let them know about this great opportunity).</strong></p>\n<p> </p>\n"}, {"id": 902155, "url": "https://remotive.io/remote-jobs/all-others/systems-improvement-advisor-change-management-902155", "title": "Systems Improvement Advisor - Change Management", "company_name": "Community Solutions", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-09-28T05:56:14", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>Position Overview:</strong></p>\n<p>Community Solutions is seeking an experienced, self-motivated and organized individual to join the energetic, collaborative Built for Zero Team as a Systems Improvement Advisor. This position will be responsible for supporting a community, or cohort of communities, in achieving racially equitable, population-level reductions in homelessness, or in driving progress on other key, population-level measures. Quality improvement (also called improvement science) is the primary organizing framework for all of this work.</p>\n<p>This position will be on the Scale-Up team as part of the larger Collaborative portfolio focused on supporting teams to end homelessness for their first proof point for ending homelessness while meeting a set of racial equity indicators. </p>\n<p>The successful Systems Improvement  Advisor will regularly gather, analyze and harvest insights from local community performance data. In response to this data, they may execute, or support the execution of, any of the following strategies in communities as appropriate:</p>\n<ul>\n<li>Will building and relationship management</li>\n<li>Training and capacity building</li>\n<li>Focused quality improvement projects</li>\n<li>Transformative real estate projects, research pilots or grantmaking opportunities</li>\n<li>Surfacing and clarification of key policy barriers and levers</li>\n</ul>\n<p>All of these strategies are critical tools for ending homelessness measurably and equitably. The successful Systems Improvement  Advisor will be skilled in identifying when each strategy is needed and in drawing on the full resources and capacity of the Community Solutions team to deploy it.</p>\n<p><strong>About Community Solutions:</strong></p>\n<p>Community Solutions is a non-profit organization that works to achieve a lasting end to homelessness that leaves no one behind. We envision a more equitable future where homelessness is never inevitable or a way of life, for anyone. Since 2015, we have led Built for Zero, a movement of more than 70 cities and counties using data to radically change how they work and the impact they can achieve — and proving that it is possible to make homelessness rare and brief. Nearly half of those communities have reduced homelessness in their communities, and 14 have ended veteran or chronic homelessness. In order to help communities equitably and sustainably end homelessness, we are also working to identify solutions that can address gaps in housing, disrupt inflow into homelessness, and produce more racially equitable systems.</p>\n<p>Community Solutions seeks leaders at every level: extraordinary, mission-oriented people not satisfied with the status quo. We are a team of <a href=\"https://drive.google.com/file/d/0B7MqPNX4H63FY045ZjQzSFlKZzQ\" rel=\"nofollow\">values-driven</a> innovators motivated by results. We eagerly seek and support diverse applicants. We provide <a href=\"https://drive.google.com/file/d/1QTiqWx90zcWlalgwdHteECpTtuGHINEs/view?usp=sharing\" rel=\"nofollow\">generous benefits</a> and opportunities for inspiring and transformational professional growth. We pride ourselves in developing an inclusive workplace culture that encourages staff to bring their whole selves to work every day. </p>\n<p><strong>Candidate Description:</strong></p>\n<p>The candidate of our dreams is organized, but not rigid—a “get stuff done” kind of person who can work out a plan of action quickly in the face of ambiguity and changing information (this environment offers a lot of both). We're looking for the sort of person who finds problem solving and complex implementation fun and who prides themselves on seeing multiple paths to the same outcome. You should come to work every day with a desire to collaborate with your teammates as we serve local change agents in communities around the country.</p>\n<p>You should be dedicated and clear-eyed about what it takes to make a difference for some of the most vulnerable people in our societies, and you should understand how racism, sexism, homophobia, and other forms of oppression structure and impede that work. You should have experience working on the ground in communities, facilitating collective problem-solving, and analyzing and synthesizing data. You should also demonstrate a high level of empathy and flexibility, which will be critical to ensuring successful collaboration with partnering organizations.</p>\n<p>This work is hard, and our team is relentlessly committed to rigor, measurement and provable impact. Your title will be Systems Improvement  Advisor, but when people ask you what you do, we hope you'll learn to say, “I'm helping communities end homelessness.”</p>\n<p><strong>Essential Duties and Responsibilities:</strong></p>\n<ul>\n<li>Build the will for sustainable participation and change in communities:\n<ul>\n<li>Clearly and compellingly present on Built for Zero learning, methods, outcomes, and/or offerings</li>\n<li>Support, leverage and strengthen existing leadership structures and engage new partners where necessary, including engagement and support of BIPOC partners and those with lived experience of homelessness</li>\n<li>Successfully manage relevant funder or partner relationships in support of community goals</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Train local teams and build sustainable capacity in critical problem solving areas:\n<ul>\n<li>Assess education and training needs in communities related to quality improvement and other key skill sets</li>\n<li>Deliver or make available appropriate training as needed, ensuring training is both cross-culturally relevant and culturally sensitive</li>\n<li>Identify critical local capacity gaps and propose ways to fill them, (policy change, pass-through funding, partner engagement, etc.)</li>\n<li>Provide or make available deep subject-matter expertise in specific areas or interventions, as needed or indicated by community data</li>\n<li>Advance equitable access to training opportunities in communities</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Leverage the quality improvement process to help communities:\n<ul>\n<li>Assess the design and current performance of local systems and identify key leverage points, with special attention to racially inequitable outcomes</li>\n<li>Set measurable, equitable and inclusive improvement aims </li>\n<li>Design workable, well organized measurement plans and build regularly updated datasets</li>\n<li>Design and implement tightly scoped improvement projects to drive rapid learning</li>\n<li>Interpret the results of improvement projects and make decisions about the abandonment, adaptation, or adoption of proposed changes at scale</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Scope and support the implementation of transformational projects, including: \n<ul>\n<li>Catalytic pass-through investments</li>\n<li>Real estate projects</li>\n<li>Partnerships with non-homeless-specific systems or institutions (e.g. healthcare, criminal justice, etc.)</li>\n<li>Time-bound pilots or research projects</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Surface and clarify key policy barriers and levers:\n<ul>\n<li>Leverage community data to determine publicly funded resource and capacity gaps</li>\n<li>Identify the ways in which local, state, federal or institutional policy may be impeding reductions in homelessness and/or contributing to racially inequitable outcomes in local systems</li>\n<li>Work with local teams to surface concrete waiver or administrative policy change requests and support those asks with local data</li>\n<li>Support CS Communications, Partnerships and Policy teams with relevant, community-specific information to support implementation of broader CS policy agenda</li>\n<li>Collaborate as needed with partners and funders to further joint advocacy agenda in support of community goals</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Support excellent strategy, execution and culture across the Built for Zero team:\n<ul>\n<li>Participate in regular strategic planning and implementation meetings for the Built for Zero initiative</li>\n<li>Ensure project scopes, timelines and work plans are always up to date for relevant projects and assignments</li>\n<li>Participate in team-wide system for learning, iteration, knowledge capture and spread</li>\n<li>Proactively apply an equity lens in all circumstances, seeking to keep both equity and results at the center of team culture and work</li>\n<li>Operate within, not around, Built for Zero team structures and work flows, and work collaboratively and constructively to improve these over time</li>\n</ul>\n</li>\n</ul>\n<p><strong>Key Knowledge and Skill Areas:</strong></p>\n<ul>\n<li>The ideal candidate will have demonstrated an ability to achieve results using at least two critical problem-solving competencies: \n<ul>\n<li>Facilitation of teams toward shared goals </li>\n<li>Quality improvement (QI), also called ‘improvement science'</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>In addition to these critical competencies, the strongest candidates may also possess deep content knowledge in at least some of the following areas: </li>\n</ul>\n<ul>\n<li>Housing and homelessness policy;</li>\n<li>Race equity policy and/or problem solving;</li>\n<li>Continuum of Care funding and governance structures;</li>\n<li>Evidence-based outreach, housing and service delivery models; and/or </li>\n<li>Upstream systems and funding structures</li>\n</ul>\n<p><strong>Position Specific Responsibilities/Skills</strong></p>\n<ul>\n<li>Integrating change management and leadership development content and framework across community support vehicles</li>\n<li>Developing evaluative tools to support community teams and leaders in assessing strengths and weaknesses in change management and leadership </li>\n<li>Experience in coalition building and aligning multi-stakeholder groups </li>\n<li>Utilizing psychology of change and change management principles to influence community teams to reach a specific measurable end to homelessness</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Three to five years previous work experience in a professional environment</li>\n<li>Experience leading a change, with measurable results to show from it</li>\n<li>Passion for justice, equity, ending homelessness and the belief it is possible</li>\n<li>Command of the Model for Improvement/Quality Improvement and insight into how it can be used to drive improvements toward ending homelessness and measure impact</li>\n<li>Experience with facilitation, public speaking, and coaching for improvement</li>\n<li>Ability to handle multiple tasks in a fast-paced, dynamic team environment and demonstrate a willingness to shift easily between various responsibilities with diverse stakeholders</li>\n<li>Strong project management skills, as evidenced by leading projects to successful and measurable completion</li>\n<li>Demonstrated understanding of structural racism and its impact on communities of color</li>\n<li>Collaborative work ethic and a high tolerance for feedback, direct communication, and proactive conflict resolution</li>\n<li>Non-traditional candidates are welcome. Community Solutions strives for representation and authentic inclusion of applicants and employees who have direct, first-hand experience with poverty, homelessness, and their root causes (including racism, marginalization, discrimination, and all forms of inequity).</li>\n</ul>\n<p><strong>Supervisory Responsibilities:</strong></p>\n<p>This section is not applicable.<br><br></p>\n<p><strong>Software/Apps Used:</strong></p>\n<p>Microsoft Office</p>\n<p>Google Business Apps</p>\n<p>Asana</p>\n<p>Zoom</p>\n<p>Social media software and applications</p>\n<p><strong>Work Environment:</strong></p>\n<p>This position can be located anywhere in the continental United States. The Built for Zero team has office space in Atlanta, Los Angeles, and New York City, but the position provides for the flexibility to work from a remote location without the standard support available at an office if such an arrangement meets the needs of Community Solutions.</p>\n<p><strong>Salary:</strong></p>\n<p>The salary range for this position is $72,200 to $90,200, depending on experience, proficiency and qualifications. </p>\n<p>Note that our salary structure is transparent and ensures that salary advancement is attainable with increased tenure, performance, independence, responsibility and embodiment of our organizational values. It is extremely rare and should not be expected that any applicant's starting salary at Community Solutions would fall above the midpoint of the salary range for their position.</p>\n<p><strong>Travel Requirements:</strong></p>\n<p>Up to 5 days of travel per month may be required to attend semi-annual team retreats, community visits, and other on-site trainings or convenings.<strong><br></strong></p>\n<p><strong>Diversity and Inclusion:</strong></p>\n<p>We strive for inclusivity and diversity by attracting extraordinary people from diverse backgrounds and lived experiences. We seek to employ an all-star team of people who vary by their race and ethnicity, gender identify, sexual orientation, nationality, age, culture, religion, veteran status, physical and mental abilities. We promote equal opportunity in the recruitment, selection, training, compensation, promotion, and benefits of all employees.</p>\n<p> </p>\n"}, {"id": 903315, "url": "https://remotive.io/remote-jobs/all-others/technical-program-manager-business-platforms-903315", "title": "Technical Program Manager, Business Platforms", "company_name": "DoorDash", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-09-26T21:49:20", "candidate_required_location": "USA Only", "salary": "", "description": "<p>At DoorDash we’re building the most scalable and reliable delivery network to support our three-sided marketplace of consumers, merchants, and dashers. On our Production Engineering and Platform Engineering teams we need to provide fundamental support to the underlying technology services and to the engineers building these services. It’s no simple task, but it wouldn’t be interesting if it was!</p>\n<p>The TPM organization is looking for a Technical Program Manager for our Business Platform Engineering Teams to drive important initiatives of four major engineering pillars: Fraud, Geo Intelligence (Maps), Support, and Post Delivery Experience. Projects/programs will require both individual attention to each pillar while working on the intersection of them all. In this role you will juggle multiple projects/programs while collaborating and influencing senior key stakeholders cross organizationally and owning the results.</p>\n<p><strong>What You’ll Do</strong></p>\n<ul>\n<li><strong>Owning Business Platform Programs - </strong>You’ll manage critical programs that will allow teams to work seamlessly by collaborating closely with Product, Operations, and Engineering teams to ensure we ship high-quality, well-designed, impactful, and reliable products and platforms.</li>\n<li><strong>Planning &amp; Execution Optimization - </strong>You’ll drive optimizations related to planning Engineering objectives and key results, develop frameworks for team execution/ tracking and provide visibility to resource allocation/prioritization to management.</li>\n<li><strong>Stakeholder Management - </strong>You’ll manage expectations for all stakeholders from leadership to individual teams and possess strong problem solving and negotiation skills to earn trust and influence partners and teams.</li>\n<li><strong>Creating &amp; Enforcing High Quality Documentation - </strong>You’ll partner with our documentation strategy team and platform teams to develop and enforce succinct and high quality internal documentation related to your programs.</li>\n<li><strong>Navigating the Organization - </strong>You’ll build knowledge and trust of internal teams to enable efficient execution of program plans. </li>\n<li><strong>Communications - </strong>You’ll manage timely and succinct communications to leadership and across teams to ensure accountability and timeline management.</li>\n<li><strong>Process - </strong>You’ll develop processes to ensure teamwork is streamlined and optimized for complexity and velocity.</li>\n<li><strong>Time Management - </strong>You’ll balance urgency and priority while moving the needle on multiple initiatives.</li>\n</ul>\n<p><strong>What We're Looking For</strong></p>\n<ul>\n<li>7-10 years recent experience as a Technical Project Manager, Technical Program Manager at a technology company.</li>\n<li>Minimum 5 years of experience working in a software development organization that builds large-scale distributed systems.</li>\n<li>Minimum 3 years working with teams that ship products/features to consumers.</li>\n<li>Excellent written &amp; verbal communication skills with the ability to communicate with confidence, clarity, and focus. Able to convey concepts and considerations to non-experts and experts alike.</li>\n<li>Strong leadership skills with the ability to collaborate and build relationships across organizations, bridge gaps between teams, and successfully influence without authority.</li>\n<li>Strong sense of ownership, urgency, and drive. A willingness to roll up your sleeves and dive into the details to understand and drive your programs.</li>\n<li>Direct engagement with Engineering teams on product development with a thorough understanding of software development processes including SDLC, Agile, and waterfall.  Project planning/execution skills that include reviewing technical design documents, estimating, and scheduling.</li>\n<li>Excellent attention to detail and understanding of impact when changes occur to scope or timeline.</li>\n<li>Experience working in a startup environment desired.</li>\n</ul>\n<p><strong>Education &amp; Training</strong></p>\n<ul>\n<li>Bachelor's Degree</li>\n<li>PMP certification desired</li>\n</ul>\n<p><strong>Why You’ll Love Working at DoorDash</strong></p>\n<ul>\n<li><strong>We are leaders</strong> - Leadership is not limited to our management team. It’s something everyone at DoorDash embraces and embodies.</li>\n<li><strong>We are </strong><strong>doers</strong> - We believe the only way to predict the future is to build it. Creating solutions that will lead our company and our industry is what we do -- on every project, every day. </li>\n<li><strong>We are learners</strong> - We’re not afraid to dig in and uncover the truth, even if it’s scary or inconvenient. Everyone here is continually learning on the job, no matter if we’ve been in a role for one year or one minute.</li>\n<li><strong>We are customer obsessed</strong> - Our mission is to grow and empower local economies. We are committed to our customers, merchants, and dashers and believe in connecting people with possibility.</li>\n<li><strong>We are all DoorDash</strong> - The magic of DoorDash is our people, together making our inspiring goals attainable and driving us to greater heights. </li>\n<li>We offer great compensation packages and comprehensive health benefits.</li>\n</ul>\n<p><strong>About DoorDash</strong></p>\n<p>DoorDash is a technology company that connects customers with their favorite local and national businesses in all 50 US states, Canada, and Australia. Founded in 2013, DoorDash empowers merchants to grow their businesses by offering on-demand delivery, data-driven insights, and better in-store efficiency, providing delightful experiences from door to door. By building the last-mile delivery infrastructure for local cities, DoorDash is bringing communities closer, one doorstep at a time. Read more on the <a href=\"%22https:/doordash.engineering/%22\" id='\"editor-module-link-9762b081-38b8-41d4-8d6d-583dbdb7d7f3\"' rel=\"nofollow\" target='\"_blank\"'>DoorDash Engineering blog</a> or <a href=\"%22http:/www.doordash.com/%22\" id='\"editor-module-link-720799d4-5c53-4b89-93df-848f17c45f14\"' rel=\"nofollow\" target='\"_blank\"'>www.doordash.com</a>. </p>\n<p><strong>Our Commitment to Diversity and Inclusion</strong></p>\n<p>We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.</p>\n<p>Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation.</p>\n<p>#LI-Remote</p>\n"}, {"id": 898761, "url": "https://remotive.io/remote-jobs/all-others/project-manager-security-privacy-infrastructure-operations-898761", "title": "Project Manager, Security / Privacy & Infrastructure Operations", "company_name": "Platform.sh", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-09-22T02:24:21", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Platform.sh is a groundbreaking hosting and development tool for web applications. We’re a European VC-Backed startup with a host of blue-chip Enterprise clients and a string of awards and grants (including €2m from the EU Horizon 2020 program). If you’re looking for an exciting, high-growth opportunity with an award-winning, cutting-edge, remote company, this could be just the job for you.</p>\n<p>For our groundbreaking PaaS solution Platform.sh is looking for a Project Manager to join the newly established Project Management Office (PMO). The PMO will focus on the Operations, Security and Data teams to facilitate and execute requests of work from beginning to completion. The PMO is also tasked with identifying weaknesses in processes and workflows and developing and implementing efficient solutions.</p>\n<p>The successful applicant will have a natural knack for leadership and organisation while being adaptable with strong problem solving and multitasking skills. They will also have an understanding of the SaaS, or better yet, PaaS, space and will be able to apply existing knowledge and expertise where possible. </p>\n<p> </p>\n<p><strong>What You’ll Do</strong></p>\n<p>Directly reporting to the PMO Manager, your role will include:</p>\n<ul>\n<li>Coordinate internal resources while ensuring resource availability and conflicts are considered </li>\n<li>Work with teams to develop projects plans including scope, process, requirements, milestones and timeline as well as to identify and mitigate risk and dependencies</li>\n<li>Concurrently manage multiple projects through conception, initiation, planning, execution to project close</li>\n<li>Ensure all project milestones are met and all projects are delivered on time within scope</li>\n<li>Identify process or project structure improvements</li>\n<li>Create and maintain comprehensive project documentation</li>\n<li>Communicate project plans to all parties required, including customer facing notices</li>\n<li>Conduct and write Root Cause Analysis investigations for internal and external use</li>\n<li>Identify, prioritise and coordinate your own daily, weekly and monthly tasks and schedules around company and team priorities. </li>\n<li>Lead and facilitate daily Scrum for project tracking</li>\n<li>Provide regular status reports and updates to project and ticket stakeholders</li>\n<li>Unblock project or ticket related issues by providing hands on support, leadership and initiative</li>\n<li>Identify, prioritise and assign daily, weekly and monthly tasks and schedules to resources while coordinating, managing and reviewing a successful workflow</li>\n</ul>\n<p> </p>\n<p><strong>Project Manager Requirements</strong></p>\n<ul>\n<li>Project Management certification or Scrum certification</li>\n<li>A minimum of three years experience in a technical PM position or similar role</li>\n<li>Highly proficient in spoken and written English</li>\n<li>Adaptable and fast learning with problem-solving skills</li>\n<li>Good written and verbal communication skills  </li>\n<li>Strong attention to detail and technicalities</li>\n<li>Excellent organisational and technical ability</li>\n<li>Good interpersonal and multi-tasking skills</li>\n<li>Ability to remain calm and composed in high stress situations</li>\n</ul>\n<p> </p>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Experience with:</li>\n<ul>\n<li>Jira</li>\n<li>Gitlab</li>\n</ul>\n<li>Exposure to cloud services (AWS, Azure, GCP, etc)</li>\n<li>Remote work experience (bonus points if you’ve led a team!)</li>\n</ul>\n<p><strong>* This is a remote job, for the America region</strong></p>\n<p>We are a worldwide distributed team and are looking for a candidate who can perform well working remotely. To be an effective performer here at Platform.sh, you’ll need to be able to effectively collaborate across time zones while operating with a high level of independence and autonomy.</p>\n<p><strong>About Platform.sh</strong></p>\n<p>Platform.sh is an idea-to-cloud application platform that simplifies cloud infrastructures.</p>\n<p>We give developers the tools they need to experiment, innovate, get rapid feedback and deliver better-quality features with speed and confidence thanks to our unique rapid cloning technology.</p>\n<p>Platform.sh serves thousands of customers worldwide including The Financial Times, Gap, Magento Commerce, Orange, Hachette, Ikea, Stanford University, Harvard University and The British Council.</p>\n<p>We want people who are passionate, open, multicultural, friendly, humble and smart to join us and help this fast-growing, award-winning company to revolutionize the tech industry.</p>\n"}, {"id": 896813, "url": "https://remotive.io/remote-jobs/all-others/implementation-project-manager-896813", "title": "Implementation Project Manager", "company_name": "Wisely", "category": "All others", "tags": [], "job_type": "", "publication_date": "2021-09-18T17:46:58", "candidate_required_location": "Anywhere", "salary": "", "description": "<div class='\"content-intro\"'>\n<div class=\"h2\"><strong>Our Vision</strong></div>\n<p>Everything we do revolves around the belief that personal interactions make people feel valued. Our products bridge the gap between customer data and customer experience.</p>\n</div>\n<p><strong>Position Overview</strong></p>\n<p>The Wisely Client Experience team is seeking a Project Manager to join our team, managing large scale, multi-module implementations. Delivering high quality project experiences, in a personalized way to our most valued clients. The ideal candidate is a keen problem solver who prioritizes and manages multiple deliverables effectively. An action and result oriented individual, you will drive all projects to an on time, on budget delivery. </p>\n<p>Our culture prides itself in hiring self-starters who are interested in entrepreneurship. We learn on the go and do what it takes to raise our products to the next level. Our team creates an environment for each other to grow in the areas we want and shape our internal processes as the team grows in size.</p>\n<p>As an Implementation focussed group, Wisely provides project management, best practice knowledge and training for our Enterprise and Mid-Market clients and is simultaneously focused on building a scalable self-service oriented model for our SMB clients. Our mission is to create memorable, predictable and positive experiences for our clients to set them up for achieving quick success outcomes that ultimately position them for long-term success with Wisely. </p>\n<p><strong>What you’ll do:</strong></p>\n<ul>\n<li>Oversee all aspects of an implementation proactively, owning the outcome of successful adoption and proactively pursuing that aggressively</li>\n<li>Partner with Sales and Solution Architects to create an SOW, build a project plan and kick off an implementation</li>\n<li>Manage work items allocated to Analysts, Specialists and Clients - owning the reporting and timely completion of all items</li>\n<li>Prepare all client-facing and internal deliverables such as the project plan, RAID and weekly status reports for all implementation projects.</li>\n<li>Orchestrate weekly client calls, facilitated through weekly reports and RAID documents, to maintain client engagement and traction</li>\n<li>Leverage statistics to support client adoption of the solutions</li>\n<li>Drive the earliest possible time to value for our clients, ensuring that they can use Wisely’s systems in their business as soon as they start to pay for them</li>\n<li>Maintain project governance documentation (plans, SOWs, RAIDs) and live channels of communication with your customers, product and Leadership to deliver transparency on all aspects of the implementation</li>\n<li>Own challenges and partner with other areas of the business to ensure they’re resolved</li>\n<li>Coordinate all necessary tasks and resources to support customers’ go lives and make their experience the best possible, personalized experience</li>\n<li>Collaborate with the Client Success Management and Support teams to hand off customers smoothly into the ‘business as usual’ functions of Wisely </li>\n<li>Leverage Project tracking tools to track time, report on milestones and maintain proper documentation </li>\n<li>Coordinate with third parties such as POS providers or network partners to ensure other organizations don't stand in the way of the client’s success with Wisely </li>\n<li>Understand and be accountable to your assigned and department KPIs.</li>\n<li>Ensure proper handoffs of Implementation Clients to the named CSM or the Support team. </li>\n<li>Provide feedback for the continuous improvements of Wisely’s implementation methodology including the development of team processes, standardized setup checklists, and quality assurance program.</li>\n<li>Collaborate with the client experience team and product stakeholders to ensure a smooth client journey.</li>\n<li>Travel up to approximately 25%.</li>\n<li>Typical work hours between 8:00am and 5:00pm CST, with some requirements or escalations outside of normal business hours (during restaurant hours)</li>\n</ul>\n<p><strong>Who you are:</strong></p>\n<ul>\n<li>You have 5+ years of project management experience in fast paced SaaS organizations, (B2B preferred) </li>\n<li>You are meticulously organized and create robust plans considering risk mitigation and with empathy towards all stakeholders</li>\n<li>You are a self starter, proactive and action-oriented, you make realistic commitments and seek to over deliver to them</li>\n<li>You have exceptional communication skills, both written and spoken</li>\n<li>You are focussed and able to prioritize tasks, managing your time effectively so that you deliver high quality work, on time</li>\n<li>You are able to build relationships at all levels of the organization, with stakeholders from the restaurant team all the way to C-level executives. You are articulate and thoughtful in your verbal and written communication</li>\n<li>You are a confident presenter, able to run weekly calls in a time-effective manner and can deliver a meeting (in person or online) keeping to time and agenda points.</li>\n<li>You remain calm in the face of a challenge, leading by example and focussing on the solution rather than apportionment of blame. </li>\n<li>You have high standards for clarity and efficiency, you are flexible and work well in a team environment or independently. You are able to work remotely effectively, remaining focussed and accountable for delivery.</li>\n</ul>\n<p><strong>Required Skills:</strong></p>\n<ul>\n<li>Experience managing complex projects in differing scenarios for clients of varying sizes</li>\n<li>Knowledge of project management methodologies and a proven track record of delivering within these frameworks</li>\n<li>Ability to remain calm under pressure</li>\n<li>Problem solving skills</li>\n<li>Experience in SaaS implementations</li>\n<li>Experience in creating and maintaining project artefacts</li>\n<li>An ability to understand technical items at a high level and how they impact operations</li>\n<li>Critical thinking skills and the ability to disagree and debate articulately and professionally</li>\n<li>Experience using a PSA tool to manage a project plan</li>\n</ul>\n<p><strong>Not required but nice to have:</strong></p>\n<ul>\n<li>Experience in or understanding of the Restaurant sector would be beneficial, but not essential</li>\n<li>Experience with Salesforce, Slack, Sendgrid, Slab or Confluence</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<div class=\"h2\"><strong>Our Values</strong></div>\n<p><strong>Begin and End with our Clients in Mind<br></strong>We do the work required to deeply understand our customers. We invent solutions that exceed expectations. We serve them like they serve their guests.</p>\n<p><strong>Think Critically and Courageously<br></strong>We understand all sides of an issue. We parse complexity to find the details that matter. We propose specific solutions to spur conversation and thought. We run toward fear.</p>\n<p><strong>Plan Clearly<br></strong>We don't settle for plans that can work, instead, we build plans that can't fail. Our plans go well beyond the target. We are clear about accountability and responsibility.</p>\n<p><strong>Communicate<br></strong>We are direct, honest, clear, and empathetic with our communication. We listen to and seek to understand differing views. The sender isn't done until the receiver receives it.</p>\n<p><strong>Get it Done<br></strong>We just find a-way. We know there is no substitute for hard work. We evaluate ourselves and others by actions.</p>\n<p><strong>Own the Outcome<br></strong>We always do the very best that we're able. We create the environment needed to succeed.</p>\n<p><strong>Evolve and Improve<br></strong>We acknowledge and change assumptions that no longer serve us. We raise the bar with each cycle through a process, with each promotion, and with each hire. We sift for gold in every feedback opportunity.</p>\n<p><strong>Earn Trust<br></strong>Our clients and teams count on us when it matters the most, and we keep our word. We act in the interest of the greater good.</p>\n<p><strong>Approach Every Day Positive and Confident<br></strong>We know we're on this planet for a short time. We do the work required to approach every day positively and secure in ourselves. We laugh and have fun.</p>\n<p>We are proud to foster a workplace free from discrimination. We strongly believe that diversity of experience, perspectives, and backgrounds will lead to a better environment for our employees and a better experience for our clients. For California residents please review our <a href=\"%22https:/www.getwisely.com/privacy-policy%22\" rel=\"nofollow\">Privacy Policy including our CCPA Policy</a>.<br><br><br></p>\n</div>\n"}, {"id": 891791, "url": "https://remotive.io/remote-jobs/all-others/delivery-manager-891791", "title": "Delivery Manager", "company_name": "Nearform", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-09-14T02:22:34", "candidate_required_location": "Europe Only", "salary": "", "description": "<div class=\"h1\">Delivery Manager</div>\n<p>Reports to: Technical Director</p>\n<p>Based: Remote, based in Europe</p>\n<p><strong>This is a remote permanent position for those based anywhere in Europe. </strong></p>\n<p>If you prefer working remotely and would enjoy working on a variety of interesting projects surrounded by inspiring NearFormers on the cutting edge of new technologies, then keep reading!</p>\n<p>We are looking for a Delivery Manager or Delivery Lead who can help our clients build solutions and platforms, launch new product ventures and fundamentally change how they operate..  The ideal candidate will be outcome driven, and have a drive to deliver the best quality output for our clients within specific timeframes. </p>\n<p>At NearForm we modernise enterprises with open, creative software, evolving businesses for the modern world. Our teams of experts are helping our clients build cloud-native solutions using industry-leading design, technology and modern practices for software development.</p>\n<p>Being a global company with a remote workforce allows us to hire without borders. We only hire the best of the best, we continuously learn and improve and our distributed workforce means we service clients across the globe - you can find us from Dublin to Dubai!</p>\n<p>Join a highly-skilled multidisciplinary team, typically consisting of designers, Developers, DevOps Engineers, and members of the client team. Follow a modern agile development methodology involving two-week sprints with a defined backlog, daily standups, weekly demos, sprint planning and sprint retros — all with minimal ceremony.</p>\n<div class=\"h2\">What do we ask of you?</div>\n<ul>\n<li>Significant experience delivering at enterprise level</li>\n<li>Use selected agile and project management methodologies to help keep clients updated on workflows and on team progress. </li>\n<li>Coordinate with client stakeholders and other vendors when on a multi-vendor project ensuring reporting and communication is consistent. </li>\n<li>Plan, direct and coordinate activities to deliver projects; including but not limited to team coordination through to implementation, planning meetings, managing blockers, ensuring stakeholder alignment and follow up.</li>\n<li>Prepare and present analysis, insights and recommendations to assist the Senior client stakeholders with decision making.</li>\n<li>Manage relevant reporting across all teams.</li>\n<li>Ensure projects are staying on track to deliver on key priorities to realise business value and hit agreed timelines. </li>\n<li>Escalate when necessary risks to the schedule or delivery.</li>\n<li>Manage a risk log, issues and blockers across the project that is updated regularly and in accordance with our ISO standards. </li>\n<li>Identify and advise on decisions that influence significant project direction including the pivots, impact assessment, realignment and recalibration of the team and effort.</li>\n<li>Shield the team from unnecessary meetings by being the point of contact with the client and coordinate meetings and calls when necessary. </li>\n<li>Sync between multiple projects &amp; development teams impacting the same product</li>\n<li>If managing multiple work streams on a project ensure there is alignment at all times across teams and stakeholders.</li>\n<li>Maintain a master schedule and coordinate all releases when necessary.</li>\n<li>Maintain client migration status and schedule</li>\n<li>Maintain client implementation status and schedule</li>\n<li>Keep track of what is implemented on which cloud</li>\n<li>Experience working in a Remote Agile environment</li>\n<li>Located in Europe</li>\n<li>Availability for short-term travel on a semi-regular basis</li>\n<li>Fluent English and outstanding communication skills (written and oral)</li>\n</ul>\n<div class=\"h2\">What will you get?</div>\n<ul>\n<li>Work/life balance: We are genuinely dedicated to balancing work and life.  </li>\n<li>Family-friendly: We understand how important family is, so our flexible environment allows you to work around what matters — school run, no problem! </li>\n<li>The Wellness Hub: We offer resources and support and are truly committed to fostering/improving every NearFormer’s wellbeing.</li>\n<li> </li>\n</ul>\n<div class=\"h2\">Why do you want to join the team?</div>\n<p>We adopt a person-first approach to hiring. That means we hire the best people — it’s as simple as that. Our team gets to pick the cream of the crop from around the world and has assembled a collection of dynamic and talented individuals we like to call “NearFormers.”</p>\n<p>Although we are widely dispersed, NearFormers are a tightly-knit team. We trust one another and care about our colleagues. Building on our open-source origins, we promote the sharing of thoughts, knowledge and ideas.</p>\n<p>NearForm is committed to shaping a better world in all that we do. Our global team is built based on respect, inclusivity, diversity and excellence.</p>\n"}, {"id": 881452, "url": "https://remotive.io/remote-jobs/all-others/us-sports-manager-881452", "title": "US Sports Manager", "company_name": "Teqball", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-09-08T21:50:18", "candidate_required_location": "USA Only", "salary": "", "description": "<p><em>Teqball is an international group with operations in Budapest, Luxembourg, Dublin, Los Angeles and Shanghai. We are involved in designing, manufacturing, and selling our own branded sports equipment and sports technology whilst also driving our sport to the forefront of sports recognition. We are already recognized as one of the fastest-growing global sports. This is an exciting time to join Teqball as we continue to disrupt the global sports industry and build our global brand.</em></p>\n<p><em> </em></p>\n<p><em>In this position, you will be responsible for building and expanding Teqball in the United States, while overseeing the operational processes as well. We need a colleague who can work quickly and independently both in the field and in the background, can easily adapt to different circumstances and drive Teqball into success in the US. In the first couple of months, you will be joining us in our Budapest office to get all the training you'll need to do your best in this position; then you will have to move to the United States. Thus, we need you to have either US citizenship or a Green Card.<br></em></p>\n<p><em> </em></p>\n<p>TASKS</p>\n<p>• Liaise effectively with all stakeholders and partners</p>\n<p>• Plan events and tournaments that may require pulling city, neighbourhood, and building permits</p>\n<p>• Immaculate record keeping</p>\n<p>• Assist with all internal and external HR related inquiries or requests</p>\n<p>• Maintain both hard and digital copies of employees' records</p>\n<p>• Assist with the recruitment process by identifying candidates, performing reference checks and issuing employment contracts</p>\n<p>• Assist with performance management procedures</p>\n<p>• Assist with payroll</p>\n<p>• Managing inventory of assets, coordinating with vendors, and submitting invoices to Finance</p>\n<p>• Sending out and receiving mail and packages</p>\n<p>• Schedule meetings, interviews, HR events and maintain agendas</p>\n<p>• Perform orientations and update records of new staff</p>\n<p>• Post job ads on professional sites, job sites, and social media</p>\n<p>• Participate in candidate sourcing efforts</p>\n<p>• Assist in screening resumes</p>\n<p>• Conduct initial phone screens</p>\n<p>• Communicate with candidates promptly and assist them when they come in for interviews</p>\n<p>• Sending faxes and emails</p>\n<p>• Assisting in various daily operations</p>\n<p>• Greeting guests and visitors</p>\n<p>• Take part in Teqball events around the city/country (play, observe, film, etc.)</p>\n<p> </p>\n<p>REQUIREMENTS</p>\n<ul>\n<li>Bachelor's degree in sport or equivalent</li>\n<li>Min. 3 years of experience in an administrative/sports-related role</li>\n<li>Proficient English-knowledge</li>\n<li>Excellent organizational and time management skills</li>\n<li>Work permit OR American citizenship is a MUST</li>\n</ul>\n<p> </p>\n<p>WHAT WE OFFER</p>\n<ul>\n<li>Competitive salary</li>\n<li>Company laptop and phone</li>\n<li>Full health insurance</li>\n</ul>\n"}, {"id": 880281, "url": "https://remotive.io/remote-jobs/all-others/vp-academic-content-880281", "title": "VP Academic Content", "company_name": "Learning Ally", "category": "All others", "tags": [], "job_type": "full_time", "publication_date": "2021-09-07T02:24:28", "candidate_required_location": "USA Only", "salary": "", "description": "<p><em><strong>VP Academic Content</strong></em></p>\n<p><em><strong>About:</strong></em></p>\n<p><em>Learning Ally is a leading nonprofit education solutions organization that transforms the lives of struggling learners by delivering proven literacy solutions that help students reach their potential. Our mission is to radically change education, transforming the lives of children by providing reading interventions and solutions to help them succeed academically, build self-confidence, and thrive in school and beyond. In the US, 65% of fourth graders read below proficiency and are 400% more likely to drop-out of high school. For most “at risk” students (students of color, low income, English Language Learners and students with learning disabilities) the problem is even more acute.</em></p>\n<p><em>Learning Ally seeks to break this cycle. With early student assessment, intervention and accommodation and professional development for educators, Learning Ally can identify and prevent learning issues by working with schools and educators to support new and struggling readers. Our solutions build a strong foundation for independent, engaged learners who are empowered to achieve socially, emotionally, and academically, regardless of background or learning difference.</em></p>\n<p><em>Founded in 1948 as Recording for the Blind, to help soldiers who lost their sight in combat continue their education with audiobook products, Learning Ally has evolved to help individuals understand the unique ways they learn and match them to the solutions that enable personal achievement. Today, Learning Ally reaches over 1,500,000 students, 200,000 educators and 18,550 schools across the country and continues to expand its reach. With a continued commitment to supporting students who learn differently, Learning Ally has joined researchers and neuroscientists from renowned institutions including UCSF and MIT, to better understand and address learning issues. You will find that our culture is one that is very committed to our mission, innovation, professional growth, and diversity, equity, and inclusion.</em></p>\n<p><br><br></p>\n<p><strong><em>What is this job all about</em></strong></p>\n<p><em>We are looking for a curious and inspiring academic leader to help ensure a consistent and research-based approach to our solutions and offerings. Our product portfolio consists of digital solutions, professional learning, and high-touch services that support teachers in refining their instructional practices to improve literacy for preK-12 students, with an emphasis on preK-8.</em></p>\n<p><em>You will develop and maintain a point of view about the research-base and curricular design of our entire portfolio so that our offerings will have the most impact on teacher learning and behaviors and student reading improvements. You'll work closely with Solutions Leadership, Marketing/Sales, and Educator Success to grow Learning Ally's impact. This role is responsible for overseeing research-bases, white papers, and content creation/editorial for all of our solutions, including software and services. Additionally, you'll need to represent the Learning Ally point of view in academic writing and speaking engagements. </em></p>\n<p><strong><em>Who is this role for?</em></strong></p>\n<ul>\n<li><em>You care about the state of literacy in the United States and want to make a difference in the lives of millions of students by helping to shape engaging, educator- and student-centric science-backed solutions</em></li>\n<li><em>You share Learning Ally's vision for Whole Child LiteracyÔ acknowledging that it is imperative in order for a child to learn to read, they must be ready and able to learn—that cognitive development, neural “wiring”, school and home environment, social-emotional readiness, well-prepared educators, and best practices in the science of reading all play critical roles in becoming efficient, fluent, and thoughtful readers.</em></li>\n<li><em>You are a curious problem-solving educator</em></li>\n<li><em>You love influencing other educators by teaching and supporting best-in-class classroom instructional practices aligned with the science of reading and the science of learning</em></li>\n<li><em>You enjoy collaboration—recognizing that it takes many types of expertise to develop great solutions</em></li>\n<li><em>You enjoy working and contributing to a culture of equity, empowerment, purpose, and fun, but you demand that the organization produces solutions that are inclusive and equitable</em></li>\n<li><em>You are passionate about empowering students and teachers from our most in-need districts to drive literacy growth</em></li>\n<li><em>You have deep market knowledge and experience designing student learning in a multitude of delivery modalities from live to asynchronous and from one-on-one to one-to-many.</em></li>\n</ul>\n<p><strong><em>Responsibilities:</em></strong></p>\n<ul>\n<li><em>Owns all aspects of content design and development related to solutions, pedagogy, professional learning services (staff, vendors, etc, as needed)</em></li>\n<li><em>Work closely with the leadership members of Solutions, Educator Initiatives, Government Relations, Educator Success, Marketing, and Strategic Partnerships to ensure the Learning Ally pedagogical and instructional design points of view are clear and evident in our interactions with stakeholders and partners</em></li>\n<li><em>Speak on behalf of and promote Learning Ally at key educator and administrator events</em></li>\n<li><em>Write and publish on behalf of and to promote Learning Ally in key publications and as a thought leader in marketing and sales channels</em></li>\n<li><em>Lead and craft Learning Ally's academic “voice” at a national level; providing a consistent, inspiring, and research-based message to rally educators and drive product development</em></li>\n<li><em>Ensure professional learning and community content is in line with current best practices (and needs) of educator preparation and practice</em></li>\n<li><em>Work closely with VP of Solutions to maintain a Whole Child Literacy™ framework across all Learning Ally work spanning solutions and thought leadership, owning</em><em> both the engagement of thought leaders from Learning Ally's Academic Advisory Board and building internal thought leadership capacity to deliver webinars, papers, promotions, and talks</em></li>\n<li><em>Provide guidance and feedback about how research and pedagogy is applied to all Learning Ally Solutions in order to maximize student learning outcomes</em></li>\n<li><em>Have a point of view on how to transform educator belief in students and how to design solutions and services that support that</em></li>\n</ul>\n<p><strong><em>Skills and Experience:</em></strong></p>\n<ul>\n<li><em>PhD or EdD in Education, Learning, or related field</em></li>\n<li><em>10+ years of classroom and administrative experience, academic research, or equivalent experience</em></li>\n<li><em>Deep expertise in learning and development, as well as educator best practices, all in alignment with the science of reading and the science of learning/development</em></li>\n<li><em>Experience designing, interpreting, and creating actionable practices from screeners and assessments</em></li>\n<li><em>Cross-functional leadership</em></li>\n<li><em>Excellence in communicating to both experts and novices alike across Learning Ally and its stakeholders understand our pedagogical point of view</em></li>\n<li><em>High empathy for educators and administrators; deep knowledge of what is happening in the field today</em></li>\n<li><em>Some understanding about how technology and scalable solutions can influence teacher practice and student learning</em></li>\n<li><em>Ability to bring a mindset or point-of-view to ensure diversity, equity and inclusion are systemic to every Learning Ally solution</em><em><br><br>Learning Ally is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.<br><br><br></em></li>\n</ul>\n<p><em> </em></p>\n"}]}