{"0-legal-notice": "Legal warning - Hey, thanks for using Remotive's API, we appreciate it! Please note that API documentation and access is granted so that developers can share our jobs further. Please do not submit Remotive jobs to third Party websites, including but not limited to: Jooble, Neuvoo, Google Jobs, LinkedIn Jobs. Please link back to the URL found on Remotive AND mention Remotive as a source in order to Remotive to get traffic from your listing. If you don't do that, we'll terminate your API access, sorry! Jobs displayed are delayed by 24 hours, the goal being that jobs are attributed to Remotive on various platforms. Displaying our jobs in order to collect signups/email addresses to show a listing constitutes a breach of our terms of services. We offer a private, paid-for API, please email us at hello(at)remotive(dot)io for more information (starting budget is $5k/mo). Please find out terms of services on https://remotive.io/api-documentation. Please note that there is absolutely no need to request Remotive Job data too frequently. Typically, you only need to GET Remotive job data through this API a couple of times a day (we advise max. 4 times a day). Our data is not changing much faster than that anyway. Note that excessive requests will be blocked. Many thanks (Rodolphe & the Remotive team!)", "job-count": 48, "jobs": [{"id": 1007149, "url": "https://remotive.io/remote-jobs/qa/qa-analyst-1007149", "title": "QA Analyst", "company_name": "GYANT", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-12-04T13:39:44", "candidate_required_location": "Anywhere", "salary": "", "description": "<div><span style=\"font-size: 11pt;\">We are looking for an experienced QA Analyst who is able to make powerful contributions to our Quality Assurance team, test our software, and support the product, engineering, and other teams. In this role, you’ll be making a huge impact on a product helping millions of patients.</span></div>\n<p><br><br></p>\n<div class=\"h3\">Here's what you'll be doing:</div>\n<ul>\n<li>Write, update, and/or review test cases, and other quality assurance-related technical data forms and quality documents</li>\n</ul>\n<ul>\n<li>Adhere to existing QA processes and best practices when testing GYANT products</li>\n</ul>\n<ul>\n<li>Perform investigations of non-conformances, customer complaints, and corrective actions</li>\n</ul>\n<ul>\n<li>Ensure the timely and effective follow up of all identified or assigned quality issues</li>\n</ul>\n<ul>\n<li>Work with product development and engineering teams to ensure proper completion of required product documentation and translate them into test plans</li>\n</ul>\n<ul>\n<li>Maintain and demonstrate understanding of global health standards and regulations</li>\n</ul>\n<ul>\n<li>Analyse specifications, demonstrate your ability to organize a test, and decide when to ask for clarification.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Here's what you need to be successful:</div>\n<ul>\n<li>Bachelor of Science in Engineering or Life Sciences or related</li>\n</ul>\n<ul>\n<li>+2 years of experience in software testing, preferably in Life Sciences</li>\n</ul>\n<ul>\n<li>Experience with UI/Functional Testing</li>\n</ul>\n<ul>\n<li>Experience with Agile methodologies</li>\n</ul>\n<ul>\n<li>Understanding of individual role in achieving company quality objectives and compliance to the standards/regulations</li>\n</ul>\n<ul>\n<li>Write test cases for QA teams</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Nice to have:</div>\n<ul>\n<li>Test automation experience</li>\n</ul>\n<ul>\n<li>Experience with XRay</li>\n</ul>\n<ul>\n<li>Jira Experience</li>\n</ul>\n<div><strong style=\"font-size: 18px;\">Benefits:</strong></div>\n<div> </div>\n<div>- Comprehensive medical, dental, and vision coverage for you and your family/dependents.</div>\n<div>- Option to contribute to your retirement via a 401k.</div>\n<div>- Take the time off that you need to relax and recharge with our flexible PTO policy.</div>\n<div>- Support your continued growth with GYANT’s professional/personal development stipend.</div>\n<div>- GYANT has offices in San Francisco, CA and Porto, Portugal and is currently a remote work friendly company. Work from where you feel most comfortable and productive. </div>\n<div> </div>\n<div><strong style=\"font-size: 18px;\">About GYANT:</strong></div>\n<div> </div>\n<div>GYANT understands patients better than anyone. </div>\n<div> </div>\n<div>We do this by deploying a personalized, configurable virtual assistant on hospitals’ digital platforms, engaging with patients through conversational AI that handholds them from the virtual “front door” through their entire clinical journey to find doctors, triage symptoms, schedule appointments, get answers and feel confident, supported, and valued.</div>\n<div> </div>\n<div>GYANT was started with an aspirational goal: to make people better. Our technology not only helps patients feel better, but feel better about their entire healthcare experience. Founded in 2016, GYANT is a nimble, multi-cultural and cross-disciplinary team where each member is an expert in their discipline. We make space for team members to propose how we can reach our strategic goals and we’re looking for people who get satisfaction from solving problems. We value diverse perspectives, candid feedback, and we’re excited to bring on team members who will work passionately toward our mission.</div>\n<div> </div>\n<div><strong style=\"font-size: 18px;\">GYANT’s Values:</strong></div>\n<div> </div>\n<div><strong>Focus on impact </strong>- We want to make a difference in the world of healthcare and are motivated to help people at scale.</div>\n<div><strong>Freedom &amp; accountability</strong> - We trust each other to make independent decisions and hold each other accountable for results.</div>\n<div><strong>Meritocracy of ideas</strong> - Everyone at GYANT has a voice, and we make decisions based on objective criteria to implement the best ideas.</div>\n<div><strong>Intensity</strong> - We work passionately towards our vision and understand that this is a marathon, not a sprint.</div>\n<div><strong>Candor</strong> - We give and accept candid, respectful feedback in service of personal and professional development.</div>\n<div><strong>Personal development</strong> - We strive to better ourselves and help each other grow.</div>\n<div> </div>\n<div><strong style=\"font-size: 18px;\">We want you to know:</strong></div>\n<div> </div>\n<div>You can be a great candidate even if you don’t fit everything we’ve described above. You can also have important skills that we haven’t thought of. If that’s you, please don’t hesitate to apply and tell us about yourself.</div>\n<div> </div>\n<div>GYANT is an equal opportunity employer. We’re committed to diversity and building an equitable and inclusive environment for people of all backgrounds and experiences, and we’re taking continued steps to meet that commitment. We especially encourage members of traditionally underrepresented communities to apply, including women and other gender minorities, people of color, LGBTQIA people, veterans, and people with disabilities.<span style=\"font-size: 11pt;\"> </span></div>\n"}, {"id": 1004045, "url": "https://remotive.io/remote-jobs/qa/sr-software-developer-in-test-1004045", "title": "Sr Software Developer in Test", "company_name": "Qatalog", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-12-03T05:39:39", "candidate_required_location": "UK Only", "salary": "", "description": "<p><a class=\"external\" href=\"https://qatalog.com/\" rel=\"nofollow\">Qatalog</a> exists to help unlock the collective potential of teams. It’s the trusted work hub where teams coordinate and share work. It spans all areas of collaboration with projects, updates, goals, company section, workflows, and proprietary search. We're dedicated to shifting how people collaborate and would love for you to join us.</p>\n<p> </p>\n<div class=\"h3\">The team</div>\n<p>We're an ambitious, experienced, and compassionate team composed of Amazon, Mozilla, Microsoft, Transferwise, and Stripe alumni. Our engineering team uses the latest technology and develops on a foundation of best practices including architectural decision records (ADRs) in our monorepo, gitflow for our CI/CD pipelines, and a never inverted test pyramid.</p>\n<p> </p>\n<div class=\"h3\">Technology</div>\n<p>Cypress, Jest, Lerna, Chromium as the test frameworks we use, with an application stack consisting of Node, React/React Native, Typescript, Hasura/GraphQL, Storybook, Postgresql, Redis, Elasticsearch, Kubernetes, Docker, Jenkins, Google Cloud</p>\n<p>If your stack experience doesn’t align with ours, that’s not a concern. We do care about how adaptable you are at applying your knowledge to new problems. We work in an environment where solid engineering and polyglots thrive; language is an implementation detail.</p>\n<p> </p>\n<div class=\"h3\">Role</div>\n<p>We are looking for a meticulous Sr. Software Development Engineer in Test (SDET) to contribute to and review the creation of designs for production software. The Sr. SDET's responsibilities include both software development and testing tasks and focuses on the testability, robustness, and performance of production software. As such, an Sr. SDET is a test professional with advanced programming skills who can both leverage our existing automation tools and frameworks alongside evaluating and creating new ones to address any gaps. A successful candidate will be able to effectively streamline our development life cycle and ensure a high level of quality throughout our application at scale via their work.</p>\n<p>As a key engineering figure working across multiple teams you’ll have a great foundation of best practices and demonstrate a drive to continually learn and mentor those around you.</p>\n<p>You will be sensitive to the goals of the company, establishing goals collaboratively with stakeholders along with the work-back plans to achieve them.</p>\n<p>You will proactively nurture the talent in your area, collaborating with them to enhance their skill set. You will also continually assess the current and long term engineering needs for the organisation looking around corners for unknowns and creating a proactive strategy and operating plan.</p>\n<p><strong>Requirements</strong></p>\n<p>To be successful as an SDET, you should have excellent time management and organizational skills as well as strong communication skills, as you will often be an essential member in one of our stream-aligned teams working alongside Engineers, PMs, and Designers. You should have a passion for designing, development, and testing and the ability to upgrade your technical skills within the constantly changing technology sector.</p>\n<p>The ideal hire will:</p>\n<ul>\n<li>Contribute to the vision for the quality assurance goals at the company, establishing granular workback plans to achieve them.</li>\n<li>Build out, hire, and scale the necessary quality assurance teams as the company and product scales.</li>\n<li>Continually assess current and long term testing needs for the organisation, look around corners for unknowns and build a defensive strategy and operating plan.</li>\n<li>Create and execute a coherent strategy for increasing our end-to-end automated and integration test coverage.</li>\n<li>Manually execute tests to close known testing gaps.</li>\n<li>Uphold best practices for technical architecture, quality assurance, scalable design and testability of the codebase. This includes tooling strategies, operational excellence concerns, code reviews etc.</li>\n<li>Adhere to best practices and processes, continually raising the bar for engineering and code quality.</li>\n<li>Create robust testing solutions by ensuring the team builds clean and testable software.</li>\n</ul>\n<p><strong>Minimum qualifications:</strong></p>\n<ul>\n<li>4+ years of proven experience building and scaling automated test solutions across customer facing environments</li>\n<li>BS or MS in an engineering discipline or equivalent practical experience</li>\n<li>Software development experience in one or more general purpose programming languages</li>\n<li>Demonstrated experience testing web applications throughout the entire software development lifecycle</li>\n<li>Expert knowledge of browser automation testing and API testing mechanisms and their related tooling</li>\n<li>Expert knowledge of CI/CD mechanisms and related tooling (Jenkins, CircleCI, Github Actions, etc)</li>\n<li>Expert knowledge of SDLC testing methodologies (TDD, BDD, DDD, etc) and how to reliably implement them at scale</li>\n<li>Working proficiency and communication skills in verbal and written English</li>\n</ul>\n<p><strong>Preferred qualifications:</strong></p>\n<ul>\n<li>Experience with Node.js testing automation such as Cypress</li>\n<li>Experience with major Javascript testing frameworks such as Jest and Mocha</li>\n<li>Experience with Jenkins and Github Actions</li>\n<li>Experience with web performance testing such as WebPageTest.</li>\n<li>Experience with source control</li>\n<li>Experience in a startup environment</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Competitive salary</li>\n<li>Meaningful stock options</li>\n<li>25 days annual holidays</li>\n<li>Premier health insurance</li>\n<li>Vision/Dental insurance</li>\n<li>Mental Health &amp; Physiotherapy cover</li>\n<li>50% Gym discount</li>\n<li>Choice of MacBook and peripherals, along with a remote setup allowance</li>\n<li>Headquartered in London (Shoreditch), but fully remote friendly</li>\n</ul>\n<p> </p>\n<p>More can be found on <a class=\"external\" href=\"http://qatalog.com/about\" rel=\"nofollow\">qatalog.com/about</a></p>\n<p><strong>Qatalog is an equal opportunity employer</strong></p>\n<p>We celebrate diversity and are committed to creating an inclusive environment for all employees.</p>\n"}, {"id": 1006996, "url": "https://remotive.io/remote-jobs/qa/qa-engineer-1006996", "title": "QA Engineer", "company_name": "EVRYTHNG", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-12-02T01:39:57", "candidate_required_location": "UK Only", "salary": "", "description": "<p>Who we are</p>\n<p>At EVRYTHNG we are blazing a trail in the digitisation of physical products, applying the latest technologies in blockchain, machine learning and big data analytics. Our team members are proud to work with some of the world’s biggest brands. EVRYTHNG is an agile, fast-paced startup environment, with offices in London, New York, Beijing, Minsk and Lausanne.</p>\n<p>Job purpose:</p>\n<p>We are looking for a QA Technical Engineer to work within the Engineering department on our highly scalable award-winning IoT platform. Our IoT platform needs to meet high standards of quality, performance and reliability, operating around the clock on a massive scale. So, If you are passionate about quality, passionate about the newest, cutting edge technologies and passionate about the IoT space then this is definitely the role for you and the individual we want to work with within our engineering team.</p>\n<p>As our QA Technical Engineer, you will be required to pair with software engineers to test our IoT platform end to end, at the code level, infrastructure level and user acceptance level, both manually (exploratory) and with automated tools. You will be expected to do functional and non-functional testing. A critical part of the role will consist of helping the team to define and get clarity around the testing breadth, ensuring stories and acceptance criteria reach a definition of ready status. You will also be responsible for collaborating with team members to get the stories and application services to a definition of done.</p>\n<p>You are also required to coach the team to take on board and implement modern testing principles. In order to achieve this, you will be responsible for understanding the production pipeline from product idea all the way to product idea as code, on infrastructure, in a production environment against customer traffic. You will help identify bottlenecks/constraints in the production pipeline and help reduce or remove these bottlenecks. You will also be responsible for looking at customer data to determine the quality of the product.</p>\n<p><a class=\"external\" href=\"http://www.evrythng.com/\" rel=\"nofollow\" target=\"_blank\">www.evrythng.com</a></p>\n<p> </p>\n<p>Key Responsibilities:</p>\n<p>As a QA Technical Engineer, you will be responsible for the quality culture of the engineering department and working with software engineers to test EVRYTHNG products (Mobile Apps on mobile devices, APIs, Complex Distributed Systems &amp; FrontEnd Dashboards) to reveal the quality and risk-related information with the intent of informing a decision. You will also contribute to the creation of test strategies and the diagnosis of complex issues.</p>\n<ul>\n<li>Works closely with the Product Owner to understand and provide feedback on the gaps/anomalies on functional requirements and acceptance criteria to ensure quality is built into the product.</li>\n<li>Ensure stories reach the definition of ready and testability and testing issues are discussed during product backlog grooming and sprint planning.</li>\n<li>Proactively learn and apply modern testing principles.</li>\n<li>Get stories to the definition of done by either leading testing, pair testing with developers or reviewing testing that developers have performed.</li>\n<li>Can tell the testing story, explain risks found during the testing, and the impact assessment of these risks to technical &amp; non-technical stakeholders.</li>\n<li>Supports the development of standards/tools/techniques for Automated Testing</li>\n<li>Employs automated testing techniques, particularly to support regression testing and automate the CI/CD pipeline across all product platforms.</li>\n<li>Contributes to the ‘Testing in Production’ engineering strategy.</li>\n<li>Extensively monitor production logs to determine the quality of the product and identify risks in the product.</li>\n<li>Works closely with the scrum team, particularly Dev Ops and the Developers to ensure that quality code can be released into production on a regular cycle</li>\n<li>Keep up to date with the evolution of the testing industry.</li>\n<li>Takes part in the QA chapter and adds valuable input.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p>The successful candidate would have to possess the majority of the following experience:</p>\n<ul>\n<li>Degree in Computer Science or equivalent combination of technical education and work experience.</li>\n<li>Strong knowledge of QA methodology e.g test design and test techniques. either from BBST courses or ISTQB. (certification itself is not a requirement but the ability to demonstrate strong knowledge of software testing is).</li>\n<li>knowledge of a programming language and basic programming concepts, preferably either in javascript or java.</li>\n<li>Experience in automation at a acceptance criteria level, api level and contract level, preferably in JavaScript user-level selenium automation using either Testcafe, Jasmine, Saucelabs, Mocha, or something similar</li>\n<li>Experience with RESTful Web Services and API Testing using tools such as POSTMAN or something equivalent.</li>\n<li>Experience with doing performance testing using k6 or something similar.</li>\n<li>Experience with NoSQL databases and doing basic queries.</li>\n<li>Understanding of how to help teams implement tests at the right level of the pyramid.</li>\n<li>Experience of using version control preferable Git and GitHub.</li>\n<li>Deep knowledge of Cloud Technologies (AWS), Microservices, Distributed systems.</li>\n<li>Experience of looking at production data to determine quality or find issues. Similar tools such as new Relic, DataDog, LogEntries,Pingdom, AWS cloud watch would be preferably.</li>\n<li>Experience of Context Driven and Session Based testing and an understanding of when to use the right software tool to get the job done.</li>\n<li>Experience of coaching teams to improve the Quality Culture within an engineering department.</li>\n<li>Experience working with large scale teams.</li>\n<li>Strong at bug management and writing good bug reports. However, has a preference for post-it notes and communication to get bugs fixed asap.</li>\n<li>Excellent communication, especially in terms of making change across multiple teams.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>EVRYTHNG offers a competitive salary, high earning potential and the ability to experience a high growth startup operating in the most exciting business environment around. This is not a role for a passenger but a challenging and rewarding role for a high potential candidate who wants to make a huge leap in their personal and professional development.</p>\n<p> </p>\n<p>Furthermore, you get:</p>\n<ul>\n<li>To work from home and we'll help you kit your home-office.</li>\n<li>Training &amp; Development - 2 hours of personal training &amp; development per week &amp; tech lunches on Wednesdays.</li>\n<li>Eligibility to get stock options once you successfully passed probation.</li>\n</ul>\n<p> </p>\n<p>EVRYTHNG is an equal opportunities employer. You must have the right to work in the United Kingdom in order to apply for this role, or the right to work in the country indicated in the text of the advertisement.</p>\n<p>No Agencies Thank You.</p>\n"}, {"id": 1006490, "url": "https://remotive.io/remote-jobs/qa/qa-tester-1006490", "title": "QA Tester", "company_name": "Rockbot", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-30T21:40:00", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Rockbot is building the future of streaming media in businesses, and we're looking for a talented <strong>Quality Assurance Tester</strong> to join the development team.  Rockbot Engineering is a small, tight group in which everyone has a massive contribution to the success of our company.  We're looking for a self-motivated individual that thrives in that environment and takes pride in building great software.<br></p>\n<p>This position will primarily focus on ensuring all products and features are rock solid for our customers.  As a critical part of our development team, you will identify software defects via manual testing, you will write and run test cases according to test plans, thoroughly document issue reproduction steps, and ensure shipping software meets the highest degree of quality and reliability.</p>\n<p>Our ideal candidate is organized, methodical, and has a firm grasp on how complex software systems operate (and break!).  A software development background is a plus.  If this sounds like you, we'd love to talk!</p>\n<div class=\"h1\">You will:<br></div>\n<ul><li>Be responsible for running manual tests in preparation for software releases, ensuring the high quality of our platform</li><li>Create detailed, comprehensive, and well-structured test cases</li><li>Estimate, prioritize, and execute testing activities</li><li>Identify, record, and document all bugs within our bug tracking software</li><li>Perform thorough regression testing when bugs are resolved</li><li>Perform Adhoc testing in all aspects of the product</li></ul>\n<div class=\"h1\">You have:</div>\n<ul><li>Experience and understanding of various browsers and operating systems</li><li>Passion for creating high-quality products and have a high bar for getting them right</li><li>Strong communication and teamwork skills</li><li>Curiosity &amp; conviction that there is always more to learn and are eager to grow as an individual and a QA Representative</li></ul>\n<p><strong>About Rockbot:</strong></p>\n<p>Rockbot is the first streaming platform to seamlessly combine TV, Music, and Digital Signage into one simple interface enabling businesses of all sizes to easily control their guest experience. We power in-location media for dozens of industries such as fitness, retail, hotels, restaurants, major airports and SMBs everywhere. Rockbot is backed by Google Ventures, Detroit Ventures, Universal Music and other leading investors.</p>\n<p><strong><em>*Our teams are all remote and we're open to hiring anywhere in the U.S. </em></strong></p>\n"}, {"id": 1004630, "url": "https://remotive.io/remote-jobs/qa/qa-engineer-1004630", "title": "QA Engineer", "company_name": "Talentspace", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-30T13:40:52", "candidate_required_location": "Germany Only", "salary": "", "description": "<p>Talentspace is the first all-in-one live online recruiting event platform. With Talentspace we enable anyone to create online recruiting events (career fairs, recruiting events, assessment center, etc.) that are interactive and fun.</p>\n<p>Our mission is to provide a safe, sustainable, and accessible way for people to meet, engage with, and get hired by companies, regardless of where they are.</p>\n<p>We're one of the fastest-growing startups in Europe, recently been funded by top-tier VCs and already count organizations such as Stanford University, WHU, CEMS, Google and Microsoft as customers.</p>\n<p><strong>The Role</strong></p>\n<p>As the platform grows in complexity and features, so does the need for additional, scalable testing. We are now looking for a QA Engineer to join a tight-knit team who understand our platform inside and out and are committed to the highest standards of quality in developing features and tests.</p>\n<p>If maintaining high-quality products is your passion, this job is for you. You will work as a QA engineer, together with 2 other teammates in QA, 10 teammates in the engineering team and our Head of Engineering.</p>\n<p><strong>As a QA Engineer you will,</strong></p>\n<ul>\n<li>Support feature teams by driving the QA process</li>\n<li>Increase the coverage and the stability of our automated tests</li>\n<li>Be involved in feature development cycle, as early as the planning all the way to pre- and post-release testing</li>\n<li>Keep an eye open for bugs and issues, and support developers in recognising the problem and testing the fix</li>\n<li>Accompany the roll-out and implementation along the development process and ensure the quality of our applications</li>\n</ul>\n<p><strong>What you bring</strong></p>\n<ul>\n<li>2+ years of experience in test management, planning, and execution in agile environments</li>\n<li>Excellent hands-on experience in manual and automated testing of web applications, and previous experience with automated testing frameworks such as Cypress</li>\n<li>You have strong communication skills and a hands-on mentality</li>\n<li>Sufficient written and verbal communication skills in English</li>\n<li>You think analytically, are solution-oriented, and have an eye for functional and visual details</li>\n<li>Experienced with Git</li>\n<li>Familiar with CI/CD tools like Github Actions</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>Enthusiastic team filled with diverse backgrounds and respect for different opinions</li>\n<li>A great product with many exciting opportunities ahead</li>\n<li>Very competitive salary plus stock options</li>\n<li>Tech equipment of your choice</li>\n<li>A modern and well-equipped work place located at the heart of Kreuzberg, Berlin if you are around</li>\n<li>Otherwise, 100% remote working is possible</li>\n<li>25 vacation days + public holiday</li>\n</ul>\n"}, {"id": 1008113, "url": "https://remotive.io/remote-jobs/qa/automation-qa-engineer-1008113", "title": "Automation QA Engineer", "company_name": "Playson", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-29T09:41:19", "candidate_required_location": "Ukraine only", "salary": "", "description": "<p dir=\"ltr\">We are inviting you to join our <strong>RnD Department</strong>, which is responsible for the engineering part of the business. This team consists of Senior Full-stack Developers and is led by System Architect. <br>The skilled <strong>Automation QA specialist</strong> will be focused on writing the automatization for our analytical products, CRM system and microservices - the products that our RnD engineers develop. We expect your desire to write a framework, apply the BDD and use the high-level functional tests. </p>\n<p dir=\"ltr\"><strong>Our requirements for the candidate: </strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Understand and have solid experience in GIT</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Deep experience in automation tools like Selenium/ Cucumber</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Experience in writing clear and simple code for automated test cases in Node.js OR Python</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Strong knowledge of software QA methodologies, tools, and processes</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Experience in writing clear, concise, and comprehensive test plans and test cases</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Hands-on experience with automated testing tools</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Solid knowledge of SQL and scripting</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Experience working in an Agile/Scrum development process</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Experience with performance and/or security testing is a plus</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Clear understanding of different approaches of testing</p>\n</li>\n</ul>\n<p><strong>How will you be contributing?</strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Development of positive / negative / boundary scenarios</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Description of automation test cases</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Requirements analysis</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Development of a framework for product automation</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Setting up test environments</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Preparation of test data and generators</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Analysis of test coverage</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Writing autotests (functional, load), test scripts</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Integration with Continuous Integration tools like GitHub Actions</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Execution of automatic tests</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Support and maintain already written tests</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Writing documentation</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Analysis of the results of runs of auto-tests (functional, load), checking the limits and possibilities of the product</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Bug reporting, general testing reports</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>This is what you get in return:</strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Competitive salary fixed in USD with yearly performance reviews</strong></p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Transparent bonus system on a quarterly basis</strong></p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Private Entrepreneur formalisation</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Full taxation coverage from the company’s side</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Flexibility in your schedule (you decide when it is convenient for you to come to the office as long as it does not cripple down our development plans)</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Medical Insurance for you and your +1</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Special Life Event financial support</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Unlimited paid vacation leave and Ukrainian bank holidays</strong></p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Unlimited paid sick leave in case of necessity</strong></p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Development courses / training reimbursement</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Online Corporate English classes</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Corporate team-building events, corporate parties</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Employee Referral bonus program and more</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Opportunity to visit our corporate gym</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">The kitchen as it should be: unlimited fruits, fresh vegetables, snacks, tea and coffee in the office with soul and spirit.</p>\n</li>\n</ul>\n<p>Enough has been said - now let's talk about how you can be a part of the glorious RnD Department.</p>\n<p><em>Our mission:</em></p>\n<p><em>Deliver entertainment and satisfaction to the lives of the busy world.</em></p>\n<p><em> </em></p>\n<p><strong>Covid-19 times vs Playson</strong><br>As an Agile Company, we were amongst the first ones in Ukraine to have transferred to remote work in mid-March 2020. Thanks to flawless communication and Scrum processes, we managed to maintain and even increase our productivity whilst working remotely — and we are super proud of that. 💪<br><strong>What does it mean for newcomers in Playson?</strong><br>🔹We hire employees for full-time remote work from all over Ukraine.<br>🔹In case you decide to work remotely forever — it is totally fine with us.<br>🔹In case you decide to work in our office in Kyiv or occasionally visit it- great news! We have renovated and transformed it to a co-working style so that our employees can have a hybrid choice of work-mode ( mixing work at home and in the office just for a change)<br>🔹During pandemic times we make sure that your first days and weeks in Playson are as convenient as possible:<br>💻technical equipment is delivered to your home address wherever you are in Ukraine<br>🖥adaptation and onboarding on an immaculate level will make no difference in joining the company remotely.</p>\n<p>Ambitious goals request the ability to quickly maneuver through changes in the world. Playson is all about that.<br>Join us today! For any additional inquiries please email us at <a href=\"mailto:hr@playson.com\" rel=\"nofollow\">hr@playson.com</a>.</p>\n<p><em> </em></p>\n"}, {"id": 1008114, "url": "https://remotive.io/remote-jobs/qa/manual-qa-engineer-1008114", "title": "Manual QA Engineer", "company_name": "Playson", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-28T05:44:46", "candidate_required_location": "Ukraine only", "salary": "", "description": "<p>Playson is a leading online gaming supplier, founded in 2012, which has developed worldwide recognition in the industry. We offer complete gaming solutions based on the latest technologies and detailed market analysis for the leading iGaming operators.</p>\n<p> </p>\n<p>We are looking for a talented <strong>QA Engineer</strong> to own and lead the QA process of our main product in a small close-knitted team. Apply if you are passionate about finding pesky bugs and move forward with fixing them to have a flawless, bug-free product. You will join a team of 5: FrontEnd Developers, Content Manager and Manual QA Engineers.<br><br></p>\n<p><strong>To succeed in the role, you will have:</strong></p>\n<p>✅ 1,5+ years of experience in manual testing (front-end/back-end)</p>\n<p>✅ Experience in using different types of testing (sanity, smoke, regression, negative testing)</p>\n<p>✅ Experience in mobile testing (different testing techniques run on mobile devices)</p>\n<p>✅ Experience in test documentation execution (use cases, test cases, test suites)</p>\n<p>✅ Client-server architecture understanding</p>\n<p>✅ SDLC process understanding</p>\n<p>✅ Ability to concisely and exhaustively describe the problem and the scenario of its reproduction (STR)</p>\n<p>✅ Readiness to learn fast</p>\n<p>✅ Great communication skills, experience in cross-team interaction</p>\n<p>✅ Knowledge of agile development methodologies, SCRUM and Kanban in particular</p>\n<p>✅ At least Intermediate level of English<br><br></p>\n<p><strong> Would be a great plus if you have:</strong></p>\n<p>➕ Experience in summary reports for non-technical specialists generation</p>\n<p>➕ Experience in working with bug-tracking systems (Jira, TestLink, etc.)</p>\n<p>➕ Experience with TestRail</p>\n<p>➕ Experience in client-server interaction testing is a huge plus</p>\n<p>➕ Basic skills of Photoshop and XML would be a plus to support a cross-functional team</p>\n<p> </p>\n<p><strong>What will you be doing?</strong></p>\n<p>🤝 Game complex manual testing (client-server)</p>\n<p>🤝 Project/feature requirements analysis (both business and functional ones)</p>\n<p>🤝 Bug reporting</p>\n<p>🤝 Documentation research for non-compliance with implementation (requirements non-compliance)</p>\n<p>🤝 Test environments set up</p>\n<p>🤝 Test documentation support</p>\n<p>🤝 Actual product performance documenting</p>\n<p>🤝 Test-cases generation, checklists forming</p>\n<p>🤝 Test-reports generation</p>\n<p>🤝 Testing tasks and user stories estimation</p>\n<p>🤝 Active participation in test process optimization</p>\n<p>🤝 Research tasks estimation</p>\n<p>🤝 Intensive communication with the team on the expected product quality</p>\n<p> </p>\n<p><strong>What you get in return:</strong></p>\n<p>💎 <strong>Competitive salary fixed in USD with yearly performance reviews</strong></p>\n<p><strong>💎 </strong><strong>Transparent bonus system on a quarterly basis</strong></p>\n<p><strong>💎 </strong>Private Entrepreneur formalization</p>\n<p>💎 Full taxation coverage from the company’s side</p>\n<p>💎 Flexibility in your schedule (you decide when it is convenient for you to come to the office as long as it does not cripple down our development plans)</p>\n<p>💎 <strong>Remote Work</strong></p>\n<p>💎 Opportunity to relocate to EU</p>\n<p>💎 Full Medical Insurance coverage for you and your +1</p>\n<p>💎 Special Life Event financial support</p>\n<p>💎 <strong>Unlimited paid vacation leave and Ukrainian bank holidays</strong></p>\n<p>💎 <strong>Unlimited paid sick leave in case of necessity</strong></p>\n<p>💎 Development courses/training reimbursement</p>\n<p>💎 Online Corporate English classes</p>\n<p>💎 Corporate team-building events, corporate parties</p>\n<p>💎 Employee Referral bonus program</p>\n<p>💎 Opportunity to visit our corporate gym</p>\n<p>💎 The kitchen as it should be: unlimited fruits, fresh vegetables, snacks, tea, and coffee in the office with soul and spirit.</p>\n<p> </p>\n<p>If the job description rings a bell - take an action and <strong>apply!</strong> Looking forward to welcoming you to the iGaming world!</p>\n<p><em>Our mission:</em><br><em>Deliver entertainment and satisfaction to the lives of the busy world.</em><em><br></em></p>\n<p><em> </em></p>\n<p><strong>Covid-19 times vs Playson</strong><br>As an Agile Company, we were amongst the first ones in Ukraine to have transferred to remote work in mid-March 2020. Thanks to flawless communication and Scrum processes, we managed to maintain and even increase our productivity whilst working remotely — and we are super proud of that. 💪<br><strong>What does it mean for newcomers in Playson?</strong><br>🔹We hire employees for full-time remote work from all over Ukraine;<br>🔹In case you decide to work remotely forever — it is totally fine with us;<br>🔹In case you decide to work in our office in Kyiv or occasionally visit it- great news! We have renovated and transformed it to a co-working style so that our employees can have a hybrid choice of work mode ( mixing work at home and in the office just for a change);<br>🔹During pandemic times we make sure that your first days and weeks in Playson are as convenient as possible:<br>     💻technical equipment is delivered to your home address wherever you are in Ukraine<br>     🖥adaptation and onboarding on an immaculate level will make no difference in joining the company remotely.</p>\n<p> </p>\n<p>Ambitious goals request the ability to quickly maneuver through changes in the world. Playson is all about that.<br>Join us today! For any additional inquiries please email us at <a href=\"mailto:hr@playson.com\" rel=\"nofollow\">hr@playson.com</a><em><br></em></p>\n"}, {"id": 998419, "url": "https://remotive.io/remote-jobs/qa/senior-engineer-in-test-f-m-d-998419", "title": "Senior Engineer in Test (f/m/d)", "company_name": "Joinupvest", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-27T05:40:08", "candidate_required_location": "Germany Only", "salary": "", "description": "<p>We are looking for fintech enthusiasts to join us in creating the financial infrastructure of tomorrow. We are building the first European Investment API Platform to enable any financial institution to offer a broad range of investment products in their apps. Our view is backed by Europe's largest tech VCs (Earlybird, Notion Capital, ABN Ventures, Partech, HV Capital) and by renowned fintech entrepreneurs (including <a href=\"https://www.linkedin.com/in/ACoAAA5D6LAB1cJ1GBRZ8whwsc6ZI78kDf1Ulx0\" rel=\"nofollow\">Maximilian Tayenthal</a>, founder of N26, and <a href=\"https://www.linkedin.com/in/ACoAAAAAH8AB8C9RXofd6q-Ux6PSMs23ahwpU8U\" rel=\"nofollow\">Felix Haas</a>, founder of IDnow).</p>\n<p> </p>\n<p><span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: 1em;\">We’re based in Berlin but would consider </span><strong style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: 1em;\">hiring remotely</strong><span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: 1em;\"> for this role. If you do want to move to Berlin though, we’re happy to support your relocation.</span></p>\n<p> </p>\n<div>At Upvest, our vision is to <strong>make investing as easy as spending money</strong>. By enabling any business to offer investment opportunities, our goal is to empower anyone to invest. Today, we count 50+ talented people from 20 different countries.<br>\n<div> </div>\n</div>\n<p dir=\"ltr\"><strong>Engineer in Test role</strong></p>\n<p dir=\"ltr\">This is a brand-new role at Upvest Engineering. It will be a chance to come in, make the role your own, and potentially the start of a whole new team. We do not believe in silos and as such are not looking for traditional Quality Assurance (QA) folks but rather <a href=\"https://blog.testproject.io/2018/11/06/the-software-engineer-in-test/\" rel=\"nofollow\">Engineers in Test</a>. People who are developers at heart but focus on quality and testing aspects of the work. Therefore, a successful candidate would also need to be able to work with our Go codebase hands-on. This is not an average quality assurance role.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><strong>Your mission:</strong></p>\n<p dir=\"ltr\">As a <em>Senior Engineer in Test</em>, you will join and take ownership of driving the quality mindset into our product engineering teams. You will collaborate with teams in setting up best practices, good test coverage and help them in automating testing processes. You will foster a culture of quality and security first, helping teams in building services that are loosely coupled, robust and resilient, secure, and observable but most of all testable and maintainable. You have a supportive and coaching attitude towards working with other engineers. You are a developer yourself. The goal is to have enough safety net for teams to be able to move to a continuous delivery model and be confident that all areas of functionality are covered, and even unexpected errors do not get missed. This is a role not belonging to any specific Product Engineering team but works on the department level collaborating with all teams. The role reports directly to the CTO (or a relevant Head of Engineering). You will be working on a greenfield project with cutting-edge technologies and no legacy code.<strong><br></strong><strong><br></strong></p>\n<p dir=\"ltr\"><strong>This role will give you the opportunity to:</strong><strong><br></strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Help build a modern Cloud native investment bank and API-platform</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Gain valuable experience in a high-security, high-stakes and high-growth FinTech environment</p>\n</li>\n</ul>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Hands-on experience in testing at all levels from unit testing thru integration testing to end-to-end testing.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Hands-on developer experience at Senior level. Industry experience for 5+ years.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Good analytical skills and the ability to grasp a complex distributed system and its overall functionality. Ability to see the big picture.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Good people and communication skills</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Planning and prioritization skills. Focus on what matters.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Stakeholder management skills. Ability to discuss difficult technical topics with non-technical stakeholders.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Taking ownership and owning the outcome</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Prior experience with event-driven distributed systems</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Prior experience with Cloud computing (ideally with GCP)</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">An understanding of security best practices and how they apply to software testing</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">High level of pragmatism.</p>\n</li>\n</ul>\n<div> </div>\n<p dir=\"ltr\"><strong>Nice to have:</strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Experience working in the FinTech domain</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Knowledge of our modern tech-stack (Go, Docker, K8S, LinkerD, Postgres, Kafka), SRE, service meshes, API gateways, and observability.</p>\n</li>\n</ul>\n<div> </div>\n<p dir=\"ltr\"><strong>Why Upvest?</strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">We are working on solving a hard problem: fixing the European securities financial infrastructure that empowers more people to be able to invest. You have the opportunity to contribute to this change.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">We invest in you. From access to a personal coach, development budget and plenty of opportunities to grow in your role.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">We take hiring seriously with a strong focus on keeping a high bar when interviewing (equally important is that we also hire decent people who are passionate about their craft and helping us achieve our shared mission).</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">While we are not fully remote, we are committed to being a flexible employer as we understand you do not have to be in the office to do your best work.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">We live a culture of empowerment, trust (that we hire the best people and get out of their way) and openness (there is a greater advantage in sharing information than keeping it to ourselves).</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">We ensure we take time to have fun as a team. We are looking forward to having more time in-person again once this becomes possible again.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Everyone is an owner. Every employee becomes a part owner via our options program. We want to ensure that if the company does well, everyone who has been a part of making it happen will also enjoy the success.</p>\n</li>\n</ul>\n<div> </div>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><strong>Our values:</strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Learn and grow: </strong>We aim high to shape our future. We give and request honest feedback. Everything is a learning opportunity. Progression &gt; Perfection.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Team first. </strong>We make it easy for others. We value different views, disagree, and commit. We win and celebrate together!</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Own the outcome. </strong>We are proactive and finish the job until it is done. Happy clients &gt; Sales. We take breaks when needed.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Tell the story. </strong>We always start with the ‘why’. Outcome &gt; Process. We share knowledge to empower others.</p>\n</li>\n</ul>\n"}, {"id": 996009, "url": "https://remotive.io/remote-jobs/qa/backend-middleware-qa-automation-engineers-996009", "title": "Backend/Middleware QA Automation Engineers", "company_name": "Leading Path Consulting", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-26T01:42:25", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>Backend/Middleware QA Automation Engineers</strong></p> <p><strong>Mid to Senior Level 5 – 10 years</strong></p> <p><strong>100% remote work</strong></p> <p>Leading Path Consulting is looking for dedicated and passionate QA Automation Engineers to join our cloud networking team. If you have experience building and operating scalable, cloud based, web applications, are excited about impacting millions of users, look no further!</p> <p>We practice Agile/Scrum methodology and we program in a variety of languages such as Python. We are building a large-scale and high-performance cloud-based networking service platform that will deliver the next generation of Internet services across private and public networks.</p> <p>As a QA Automation Engineer, you will specialize in developing test strategies and designing, automating, executing, and maintaining test plans, test cases, and test environments of a cloud-based networking service platform. You will help ensure high quality and a successful rollout of the platform that is impacting millions of customers.</p> <p><strong> Responsibilities:</strong></p> <ul> <li>Write Python      scripts to communicate with RESTful services from middleware and backend      services</li> <li>Design and      develop test automation and tools, with a focus on maintainability at a      large scale</li> <li>Analyze      requirements, procedures, and problems to automate or improve existing      test systems</li> <li>Develop and      maintain test automation frameworks and scripts for platform testing      (e.g., using Python, bash shell, Java)</li> <li>Write test      cases and detail test scenarios, ensure their completeness, automation,      and execution</li> <li>Lead in the      identification and resolution of problems and defects, and help driving to      resolution</li> <li>Comfortable      with collaboration, open communication and reaching across dev, qa, ops      and other cross functional teams</li> <li>Integrating      test automation with build systems, test case management and bug tracking      tools</li> </ul><p><strong>Requirements</strong></p><p><strong>Qualifications:</strong></p> <ul> <li>Extensive      experience using middleware or backend automation scripts using      Python to communicate with RESTful services.</li> <li>Passionate      and knowledgeable of QA processes and methodology, with ability to create      and execute detailed test plans and test cases, perform root cause      analysis to identify problems in design and/or implementation.</li> <li>Deep      understanding of web and networking technologies on server and client      side, strong with at least one scripting and/or high-level language: <strong>Python      (preferred)</strong>, Java, Shell, Perl, Golang</li> <li>Extensive      experienced with REST/SOAP/JSON APIs</li> <li>Solid      working knowledge of NoSQL and MySQL databases, Cassandra preferred</li> <li>System and      application performance and load testing knowledge is a plus</li> <li>Self-motivated,      with excellent oral and written communication skills</li> <li>Bachelor’s      degree in computer science or related field. Master’s preferred</li> </ul><p><strong>Benefits</strong></p><p>Leading Path is an award-winning Information Technology and Management Consulting firm focused on providing solutions in process, technology, and operations to our government and Fortune 500 clients. We offer a professional and supportive family-friendly work environment with a strong work-life balance. Leading Path provides a comprehensive and competitive benefits package, 401K, tuition reimbursement and opportunities for professional growth and advancement.</p>"}, {"id": 994237, "url": "https://remotive.io/remote-jobs/qa/director-of-quality-994237", "title": "Director of Quality", "company_name": "Embry Health", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-24T21:41:23", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h2\"><strong><em>About eMBRY Health </em></strong><em></em></div>\n<p><em>Looking to join one of the United States' fastest growing companies? Seeking a rewarding opportunity to positively impact the lives of others? Want to transform the image that our nation's healthcare system is “restraining,” “antiquated,” and “burdensome”? Look no further than eMBRY Health!  <br><br>In early 2020, Raymond Embry witnessed the need for a more effective response to the COVID-19 pandemic. Thousands of Arizonans fell ill daily. Communities across the state desperately sought testing services that local governments could not provide. Embry, a lifelong healthcare industry advocate, seized the moment. With fewer than ten employees, he created eMBRY Health to fill the testing void. <br><br>Over the last year, our company has experienced rapid growth due to the pressing need for COVID-19 testing services. Nearly 300,000 Arizonans have benefited from eMBRY Health's critical testing services, and we've wanted to offer such services nationwide. In just the last few weeks, eMBRY Health has expanded its national footprint and established testing sites in states such as Florida, Hawaii, Colorado, and Texas. Nearly 10,000 people get tested by visiting eMBRY Health testing sites daily in all markets.  <br><br>In the next year, eMBRY Health envisions being fully operational with COVID-19 testing services in all 50 states. Not only do we want to expand testing services across the country, but we also want to keep broadening our healthcare offerings. Our mission is to provide high-quality, tailored healthcare to all regardless of age, gender, background, and insurance status. As part of our growth, eMBRY Health seeks to establish eMBRY Women's Health clinics, eMBRY Men's Health clinics, and eMBRY Aesthetics medical centers and day spas, in the states it will enter.  <br><br>eMBRY Health is a destination for top-tiered clinical talent. It is also a nurse practitioner-centric organization founded by an NP. We are looking for strategic leaders with clinical and operational experience to be thought partners with expansion plans.</em><em><strong><br></strong></em></p>\n<div class=\"h2\"><strong>Director of Quality</strong></div>\n<div class=\"h3\"><strong>Location: Remote </strong></div>\n<div class=\"h3\"><em></em><strong>Position Purpose</strong></div>\n<p>The Director of Quality is a part of the Clinical Delivery Team who will be responsible for directing all quality management activities of the team. He or she will develop strategic plans and policies for improved quality and work with top management to ensure compliance with regulatory agencies. He or she will also create policies and procedures to support the functional infrastructure while creating practical strategies and specific sub-function objectives.<strong></strong></p>\n<div class=\"h3\"><strong>Major Tasks &amp; Responsibilities of Position:  </strong><br></div>\n<ul><li>Model the adopted mission and core vision and values of the organization</li><li>Oversee the quality of clinical programs and services through the Continuous Quality Improvement Process, driving excellence toward the organization's goals and objectives for clinical care</li><li>Lead and facilitate ongoing CQI Core Committee meetings</li><li>Design, operate and evaluate clinical processes to improve patient care and staff competency and training, including oversight of EHR clinical documentation optimization</li><li>In conjunction with the executive team and program directors, establish clinical performance targets and metrics including clinical outcomes, patient safety, and patient satisfaction</li><li>Measure and monitor performance against targets and benchmarks; assure achievement of clinical goals and objectives through a partnership with director peers</li><li>Ensure compliance with regulatory requirements</li><li>Perform or oversee quality assurance audits to assess the degree to which clinical policies and procedures are being followed</li><li>Initiate new policy and procedure process when needs are identified</li><li>Responsible for the annual Policy review process</li><li>In partnership with Human Resources, ensure appropriate policies and procedures are assigned to staff and updated as necessary</li><li>Collect clinical outcomes and process data and perform analysis to support process improvement initiatives</li><li>Ensure that clinical policies comply with standards of care and regulatory requirements and are updated to reflect any changes</li><li>Develop clinical protocols and standing delegation orders with the Chief Nursing Officer and Medical Director.</li><li>Serve as a member of the case review team alongside the CNO and Medical Director for potential peer reviews and participate in clinical performance improvement planning</li><li>Provide feedback and action items to managers and directors for clinical incident resolution</li><li>In collaboration with program directors and clinical education coordinator, design and ensure clinical competencies for all staff and volunteers</li><li>Oversee clinical risk management and patient safety initiatives, and with director peers, ensure they are being followed</li><li>Lead clinical excellence by pursuing and encouraging continuing education on advances and best practices in the field of sexual health; including attending national conferences, maintaining CE credits per licensure; educating staff and providers on key learnings</li><li>Provide policy/procedure feedback and updates as necessary to reflect changes in industry standards and guidelines</li><li>Foster a success-oriented and accountable environment within the organization</li><li>Act as a guide for employees, volunteers, and peers</li><li>Perform other duties as assigned</li></ul>\n<div class=\"h3\"><strong>Job Requirements &amp; Qualifications:</strong></div>\n<ul><li>Bachelor's degree in nursing or related industrial, scientific, or business field required; Master's degree preferred</li><li>Eight to 10 years of related experience required with at least five years as a quality engineer or similar role highly preferred</li><li>Excellent organizational skills and attention to detail.</li><li>Strong analytical and problem-solving skills.</li><li>Strong supervisory and leadership skills.</li><li>Proficient with Microsoft Office Suite or related software.</li><li>NP/DNP Degree with a focus in Education &amp; Clinical Quality</li><li>Active NP License </li></ul>\n<p></p>\n<p><em>eMBRY Health is committed to equal employment opportunity and recruits and hires applicants without regard to race, color, religion, sex (including pregnancy), national origin, disability, age, sexual orientation, veteran status, genetic information, gender identity, gender expression, or any other factor prohibited by law. eMBRY Health will provide a reasonable accommodation for those with a disability to complete any part of the application process. If you are unable to access or use this online application process and need an alternative method for applying, please contact us.</em><a href=\"https://embryaesthetics.com/\" rel=\"nofollow\" target=\"_blank\"></a></p>\n"}, {"id": 1007171, "url": "https://remotive.io/remote-jobs/qa/senior-qa-engineer-automation-1007171", "title": "Senior QA Engineer - Automation", "company_name": "TestGorilla", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-23T20:42:51", "candidate_required_location": "Anywhere", "salary": "", "description": "<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">Hi there,</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">I’m Nicolas, TestGorilla’s Head of Engineering. We’re a fast-growing HR tech startup that helps hiring teams make better hiring decisions faster and bias-free.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">We’re accelerating the development of our product to serve the growing demand from our customers. That’s why we’re looking for a Senior QA Engineer to join our great team.</p>\n<p><span style=\"background-color: transparent; font-family: 'Open Sans'; font-size: 25px; font-weight: bold; letter-spacing: 0.5px;\"> </span></p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\"><span style=\"background-color: transparent; font-family: 'Open Sans'; font-size: 25px; font-weight: bold; letter-spacing: 0.5px;\">The proposition</span></p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● The opportunity to work in a fast-growing, VC-backed HR tech startup</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Competitive package incl. bonus and stock options</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Your hours are flexible, and so is your vacation</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You can work wherever you want – <em style=\"background: transparent; border-style: initial; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\">We work remotely!</em></p>\n<p> </p>\n<hr class=\"wp-block-separator\" style=\"background: transparent; border-width: 0px; border-style: initial; border-top-color: initial; clear: both; color: transparent; margin-top: 1.5em; margin-bottom: 1.5em; padding-top: 0px; padding-bottom: 0px; font-family: 'Open Sans', sans-serif; font-size: 18px;\">\n<p class=\"h2\" id=\"h-the-role-in-context\" style=\"line-height: normal; font-weight: bold; margin-top: 44px; margin-bottom: 36px; letter-spacing: 0.5px; font-size: 25px; color: #000000; background: transparent; border-style: initial; outline: 0px; padding: 0px; vertical-align: baseline; font-family: 'Open Sans' !important;\">The role in context</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">We are looking for a <strong style=\"background: transparent; border-style: initial; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline;\">Senior Quality Assurance Engineer</strong> to join our engineering department and help us bring our product to Enterprise level maturity. Your work will directly impact hundreds of thousands of users around the world.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">As our user base grows, our code base grows, and our engineering capacity expands, we also need to take our quality assurance to the next level. As a <a href=\"https://www.testgorilla.com/test-library/role-specific-skills-tests/qa-test-engineer-test/\" rel=\"nofollow\" style=\"transition: all 0.3s linear 0s; text-decoration: none; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial; border-style: initial; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline; color: #44aa97; line-height: 23px;\" target=\"_blank\">QA engineer</a> in the team, you will have the opportunity to implement best practices when it comes to quality assurance and instil a great quality mindset within the team. </p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">Some of our goals are to expand our quality controls, reduce the number of defects propagated in production, improve our recovery time, and, ultimately, an even better user experience!</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">Test automation and acceptance testing will be initial priorities to achieve these objectives, but obviously, there’s more!</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">As a senior member of the engineering team, you will work together with our product team, our customer success team, as well as the different engineering teams (candidate environment, employer environment, internal tools, cloud infrastructure, etc.). You provide leverage and support, but also guidance. You’ll work in a collaborative, talented distributed team across Europe, the Americas, Africa and Asia.</p>\n<p> </p>\n<hr class=\"wp-block-separator\" style=\"background: transparent; border-width: 0px; border-style: initial; border-top-color: initial; clear: both; color: transparent; margin-top: 1.5em; margin-bottom: 1.5em; padding-top: 0px; padding-bottom: 0px; font-family: 'Open Sans', sans-serif; font-size: 18px;\">\n<p class=\"h2\" id=\"h-you-ll-spend-time-on-the-following\" style=\"line-height: normal; font-weight: bold; margin-top: 44px; margin-bottom: 36px; letter-spacing: 0.5px; font-size: 25px; color: #000000; background: transparent; border-style: initial; outline: 0px; padding: 0px; vertical-align: baseline; font-family: 'Open Sans' !important;\">You’ll spend time on the following</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Thoroughly learning TestGorilla’s software.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Taking full ownership of the quality for all TestsGorilla systems and products. This involves defining our quality strategy, infrastructure, tools, and processes.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Ideating, implementing, maintaining, and reinforcing high quality standards leveraging reusability and scalability.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Developing complex end-to-end automated testing solutions with integration in CI/CD environments.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Creating and documenting detailed, comprehensive, and well-structured test plans and test cases to assess software quality.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Executing quality, usability, regression, and performance testing on both frontend and backend components.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Identifying the metrics that track the continuous improvement of our overall quality.</p>\n<p> </p>\n<hr class=\"wp-block-separator\" style=\"background: transparent; border-width: 0px; border-style: initial; border-top-color: initial; clear: both; color: transparent; margin-top: 1.5em; margin-bottom: 1.5em; padding-top: 0px; padding-bottom: 0px; font-family: 'Open Sans', sans-serif; font-size: 18px;\">\n<p class=\"h2\" id=\"h-here-s-what-we-re-looking-for\" style=\"line-height: normal; font-weight: bold; margin-top: 44px; margin-bottom: 36px; letter-spacing: 0.5px; font-size: 25px; color: #000000; background: transparent; border-style: initial; outline: 0px; padding: 0px; vertical-align: baseline; font-family: 'Open Sans' !important;\">Here’s what we’re looking for</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You have at least 5 years of experience designing, implementing, running, manual and automated tests for web and distributed systems.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You have a solid understanding of the quality assurance processes and best practices in <a href=\"https://www.testgorilla.com/test-library/programming-skills-tests/software-engineer-test/\" rel=\"nofollow\" style=\"transition: all 0.3s linear 0s; text-decoration: none; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial; border-style: initial; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline; color: #44aa97; line-height: 23px;\" target=\"_blank\">software development</a>.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● Hands-on experience with automation testing frameworks, for both frontend and backend components, such as Mocha, Supertest, Cypress and Postman.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You care deeply about building a world-class engineering team.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You are passionate about improving your skills and learning new technologies.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You enjoy influencing others.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You always advocate for technical excellence and you are open to change.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You’re resilient in ambiguous situations and can approach challenges from multiple perspectives.</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● You have strong written and verbal communication skills. You can validate your decisions and communicate them clearly.</p>\n<p> </p>\n<hr class=\"wp-block-separator\" style=\"background: transparent; border-width: 0px; border-style: initial; border-top-color: initial; clear: both; color: transparent; margin-top: 1.5em; margin-bottom: 1.5em; padding-top: 0px; padding-bottom: 0px; font-family: 'Open Sans', sans-serif; font-size: 18px;\">\n<p class=\"h2\" id=\"h-bonus-points-if\" style=\"line-height: normal; font-weight: bold; margin-top: 44px; margin-bottom: 36px; letter-spacing: 0.5px; font-size: 25px; color: #000000; background: transparent; border-style: initial; outline: 0px; padding: 0px; vertical-align: baseline; font-family: 'Open Sans' !important;\">Bonus points if …</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● you have experience in <a href=\"https://www.testgorilla.com/test-library/programming-skills-tests/python-coding-test-entry-level-algorithms/\" rel=\"nofollow\" style=\"transition: all 0.3s linear 0s; text-decoration: none; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial; border-style: initial; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline; color: #44aa97; line-height: 23px;\" target=\"_blank\">Python</a> and Javascript</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● you have experience in a SaaS product based company</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● you are comfortable with Agile methods, such as Extreme Programming (XP), Scrum, and/or Kanban</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">● you have a working knowledge of cloud technology such as AWS, Azure, Kubernetes, and Docker</p>\n<p><span style=\"background-color: transparent; font-family: 'Open Sans'; font-size: 25px; font-weight: bold; letter-spacing: 0.5px;\"> </span></p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\"><span style=\"background-color: transparent; font-family: 'Open Sans'; font-size: 25px; font-weight: bold; letter-spacing: 0.5px;\">Interested?</span></p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">Here at TestGorilla, we eat our own dog food. We use our assessment platform to make sure we make the best hiring decisions faster and bias-free. I took one too and I enjoyed it!</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">So if this role sounds like a good fit for you, I’d like you <a href=\"https://assessment.testgorilla.com/testtaker/publicinvitation/e31d775e-9e67-4225-9062-6672f3c85aef\" rel=\"nofollow\">to take an assessment</a> so we can get a better idea about whether you would fit the role. It’s also a great opportunity for you to get to know our product!</p>\n<p class=\"has-normal-font-size\" style=\"margin-bottom: 1.5em; background: transparent; border-style: initial; font-size: 17px; outline: 0px; padding: 0px; vertical-align: baseline; line-height: 28px; color: #000000; font-family: 'Open Sans', sans-serif;\">If you’re hired, I’ll do everything I can to help you succeed at TestGorilla and throughout the rest of your career.</p>\n", "company_logo_url": "https://remotive.io/job/1007171/logo"}, {"id": 997939, "url": "https://remotive.io/remote-jobs/qa/software-engineer-in-test-997939", "title": "Software Engineer in Test", "company_name": "Tilled, Inc.", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-23T17:41:09", "candidate_required_location": "USA Only", "salary": "75000.00-100000.00 per year", "description": "<p>At Tilled, we’re creating a buzz in the world of payments. Every time a bill gets paid through a software platform, payment processing revenues are generated for many stakeholders, but not the software company. We are changing those economics, with PayFac-as-a-Service. We need your help.</p>\n<p><strong><u>Position Summary:</u></strong></p>\n<p>As an early member of the engineering team, you will have broad end-to-end responsibilities. This will include a healthy mix of exploratory testing and writing automated checks. Your work will have a tremendous impact on every aspect of Tilled’s business success.</p>\n<p><strong> </strong></p>\n<p><strong>*This is a full-time REMOTE position.   Candidates must be authorized to work in the United States and be a resident in a United States time zone.* </strong></p>\n<p> </p>\n<p><strong><u>Here is what you can expect at Tilled:</u></strong></p>\n<ul>\n<li>Work autonomously to effectively test and provide feedback on features and fixes</li>\n<li>Create automated checks to empowering the team with fast feedback</li>\n<li>Create innovative solutions to complex testing problems</li>\n<li>Assist with building and maintaining documentation both customer facing and internal</li>\n<li>Work with engineers in determining what needs automated checks and at what level (unit, api, ui)</li>\n<li>Promote a team culture that is always learning, motivated and collaborative</li>\n<li>An amazing group of people to work alongside</li>\n</ul>\n<p> </p>\n<p><strong><u>Tilled is looking for someone who has:</u></strong></p>\n<ul>\n<li>3+ years testing web applications</li>\n<li>Experience writing code for automated checks and/or building tools to aid in testing</li>\n<li>Expert skills at finding defects and testing applications</li>\n<li>Strong understanding of web testing technologies</li>\n<li>Ability to apply systems thinking to the entire software development lifecycle</li>\n<li>You function with confidence in a fast-paced, high-growth environment</li>\n<li>You work seamlessly in a remote dispersed team environment</li>\n<li>Tremendous attention to detail</li>\n<li>Ability to articulate results to teammates – written and verbally</li>\n<li>High level of curiosity</li>\n<li>Experience testing APIs preferred</li>\n<li>Experience with AWS preferred</li>\n<li>Experience testing payments systems preferred</li>\n<li>Experience optimizing production systems for performance, quality and reliability preferred</li>\n<li>Experience writing automated checks preferred</li>\n<li>Experience with load/performance testing preferred</li>\n</ul>\n<p>Tilled was created to empower software vendors, and SAAS companies to start generating revenue from accepting credit cards. With our suite of powerful financial tools and industry leading revenue sharing programs, Tilled will power the financial backend of the next generation of SAAS companies, and integrated software vendors, allowing them to focus on their core product, not payment facilitation. Welcome to PayFac-as-a-Service!</p>\n<p><strong>Tilled is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.</strong></p>\n<p> </p>\n"}, {"id": 981455, "url": "https://remotive.io/remote-jobs/qa/qa-analyst-tester-981455", "title": "QA Analyst / Tester", "company_name": "We The Collective", "category": "QA", "tags": [], "job_type": "part_time", "publication_date": "2021-11-22T13:41:52", "candidate_required_location": "PST timezone", "salary": "", "description": "<div class=\"h3\">We’re seeking an experienced QA Analyst to join our technology team. In this role, you'll be responsible for developing testing and QA protocols that support our design and development teams. You will also develop strategies, test cases and user stories for testing simple and complex websites and web applications.</div>\n<div class=\"h3\">This role can be done from Vancouver (relocation available) or 100% remotely from anywhere, PST working hours required.</div>\n<p><strong>What’s required:</strong></p>\n<ul>\n<li>3+ years experience in a development and quality assurance testing environment</li>\n<li>A clear and confident understanding of web browser standards, trends, challenges, and nuances</li>\n<li>Experience testing websites, web applications and emails</li>\n<li>Experience working with digital creative teams</li>\n<li>Experience communicating issues throughout SDLC</li>\n<li>Experience with testing for performance, security and accessibility</li>\n<li>Experience providing product feedback throughout the creative process</li>\n<li>Excellent time and priority management skills</li>\n</ul>\n<p><strong>Your responsibilities:</strong></p>\n<ul>\n<li>Developing test plans, test cases, and test reports on multiple projects of varying size</li>\n<li>Perform functional, usability and exploratory testing activities</li>\n<li>Perform testing on various software, websites and web applications</li>\n<li>Validating that user expectations are achieved during the testing process</li>\n<li>Identifying, recording, replicating, and communicating defects to project teams</li>\n<li>Verifying, retesting and regression testing tasks</li>\n<li>Triaging issues as they arise</li>\n<li>Sign-off on products being ready for deployment</li>\n<li>Develop evolving testing strategies, documentation and practices</li>\n</ul>\n<p><strong>We’re looking for someone who:</strong></p>\n<ul>\n<li>Fosters an attitude and culture of continuous improvement and optimizations</li>\n<li>Loves design &amp; technology and understands its value</li>\n<li>Has a strong passion to learn and develop their skill-set</li>\n<li>Prides themselves on an exacting attention to detail and follow-through</li>\n<li>Thrives under deadlines</li>\n<li>Is an excellent communicator</li>\n<li>Is focused with a positive outlook</li>\n<li>Has a strong sense of humour</li>\n<li>Leads by example; with respect, empathy and candour</li>\n</ul>\n<p><strong>Our benefits:</strong></p>\n<ul>\n<li>A focused but casual studio environment</li>\n<li>Competitive salary</li>\n<li>Health &amp; lifestyle benefits</li>\n<li>Skill set development benefits</li>\n<li>Holiday office closure in addition to paid time off</li>\n</ul>\n<p><strong>About us:</strong></p>\n<p>We craft the next big thing for youth entertainment brands. We are a group of creatively focused digital experts with an obsession for quality and a passion for people. The websites, digital products and content we create help share brand stories with new audiences across the globe.</p>\n<p>No emails, phone calls or recruiters please.</p>\n"}, {"id": 981728, "url": "https://remotive.io/remote-jobs/qa/junior-qa-engineer-981728", "title": "Junior QA Engineer", "company_name": "Feefo Holdings Ltd", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-21T09:42:43", "candidate_required_location": "UK Only", "salary": "", "description": "<p><strong>Are you degree educated and looking to start your career within software QA testing?</strong></p>\n<p><strong>Do you want to work for an expanding SaaS business with some of the most modern technologies?</strong></p>\n<p><strong>Then look no further than Feefo! </strong></p>\n<p>Feefo operates a vibrant and dynamic team and offers a collaborative work environment, with a strong culture of developing leading solutions using new technology. The role of QA Engineer role is a manual testing role. The QA Engineer works alongside our core Software Development team. This consists of three areas: API development, UI development and Quality Assurance. Tasks will be varied and will consist of testing new features within the Feefo platform, as well as retesting of bug fixes and smaller enhancements to existing functionality.</p>\n<p>This role can be fully remote within the UK. </p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Bachelor’s degree in Computer Science or similar technical discipline</li>\n<li>Agile tools such Jira and Confluence</li>\n<li>Ability to test high level requirements from working test cases</li>\n<li>Goal focused with commitment to meet targets</li>\n<li>Outstanding oral and written communication skills, capable of addressing both technical and non</li>\n<li>Analytical mindset</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Competitive Salary</li>\n<li>Health care cash plan/Private healthcare</li>\n<li>Cycle to work scheme</li>\n<li>Death in Service</li>\n<li>Training &amp; Development - access to LinkedIn Learning and more</li>\n<li>25 days holiday increasing with service</li>\n<li>Additional paid x2 days holiday for volunteering (charity work)</li>\n<li>Eyecare vouchers</li>\n<li>Fully remote working</li>\n<li>Pension scheme</li>\n</ul>\n"}, {"id": 983598, "url": "https://remotive.io/remote-jobs/qa/quality-assurance-analyst-983598", "title": "Quality Assurance Analyst", "company_name": "UTR", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-17T22:43:25", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Universal Tennis is the company behind <a class=\"external\" href=\"https://myutr.com/\" rel=\"nofollow\">UTR</a>, a revolutionary rating system that (similar to a golf handicap) provides a single, unifying language and standard for all tennis players across age, gender, geography and economics. The company’s vision is to unify tennis for everyone by bringing cutting edge analytics and community building technology to all players worldwide independent of level. Today, the UTR system is powered by over 6 million match results, across 600 thousand players in nearly 200 countries. See our <a class=\"external\" href=\"https://universal-tennis.workable.com/\" rel=\"nofollow\">company profile</a> for links to our recent press releases and on-air daily coverage with the Tennis Channel.</p><p>Universal Tennis is building innovative, cutting-edge technology products and services to help empower and enhance every part of the tennis ecosystem (players, coaches, clubs, organizers, federations, etc.).  Here are some of the exciting initiatives on our product roadmap:</p><ul> <li>Expanding UTR to millions of competitive and recreational players around the globe </li> <li>Collecting match results from hundreds of different sources with different data formats </li> <li>Enabling any player or organization to post match results and track their performance</li> <li>Developing marketplace applications to search, find and connect with players, coaches, and events</li> <li>Building an event and tournament management platform for clubs and organizers</li> </ul><p>The UTR development team is led by folks who have leveraged their backgrounds in computer science, math and engineering to build and scale multiple technology companies. We strongly believe that empowered people are the key to building a great company, and our development process focuses on iteratively improving our product as well as ourselves as individuals and as a team. We are looking to add a skilled, experienced engineer who can be a core member of our team and work on every part of the stack to accelerate product development. So if you share our ambition and want to help shape the technology that will make it happen, then join our team!  </p><p><strong>Requirements</strong></p><p><strong>Daily Duties:</strong></p><ul> <li>Develop, execute, and manage test cases to methodically work through all features and stories</li> <li>Perform manual and automated test routines on both production and staging environments</li> <li>Develop and document test procedure for use across the QA and Engineering team</li> <li>Insist upon thorough documentation and create easily understood reproduction steps when reporting issues</li> <li>Develops and executes both manual and automated tests cases, recording test results and documenting issues as appropriate</li> <li>Develops scripts or programs to automate test regression activities</li> <li>Provides test support to all phases of the software development lifecycle</li> <li>Perform manual and automated test for web and mobile application</li> </ul><p><br></p><p><strong>General Requirements:</strong></p><ul> <li>2+ years of experience testing web applications</li> <li>Careful attention to detail.</li> <li>The ability to work on similar activities daily or multitask and prioritize when needed.</li> <li>A good working knowledge of technology and a high comfort level with your ability to learn new things quickly.</li> </ul><p><br></p><p><strong>Useful Experience:</strong></p><ul> <li>Ability to develop, execute, and manage complex test cases</li> <li>Proven experience in developing and executing both manual and automated test cases</li> <li>Ability or want to develop scripts or programs to automate test activities</li> <li>Experience performing testing as part of an Agile project management methodology</li> <li>Ability to work on a remote team</li> <li>Knowledgeable of SDLC and AGILE methodology</li> <li>Knowledge Jira and/or Azure DevOps</li> <li>Knowledge of web development, iOS, Android, and related technologies</li> <li>Using deductive reasoning and customer knowledge to be great at exploratory testing.</li> </ul><p><strong>Bonus Points</strong></p><ul> <li>Experience with test automation platforms such as Test Project, Selenium, Cucumber, etc.</li> <li>Know your way around the Chrome dev console and tools like Postman.</li> </ul><p><strong>Benefits</strong></p><p>The Company is headquartered in Palo Alto, CA but this position is FULLY REMOTE.  We are offering a competitive salary and equity compensation package with flexible working hours and UNLIMITED PTO, telecommuting, medical and dental, and a bunch of that other fun stuff that you’d expect from a tech start-up.</p>"}, {"id": 685143, "url": "https://remotive.io/remote-jobs/qa/qa-engineer-685143", "title": "QA Engineer", "company_name": "BackMarket", "category": "QA", "tags": [], "job_type": "contract", "publication_date": "2021-11-16T21:41:12", "candidate_required_location": "UK, Germany, France, & the Netherlands", "salary": "", "description": "<div class=\"h3\">Who we are:</div>\n<div>Founded in 2014, <strong>BackMarket</strong> is the first online marketplace dedicated exclusively to refurbished electronic devices. With 434M€ raised already, we are sabotaging ‘new’ by connecting highly selected certified professionals to consumers who are looking for a more affordable, reliable, and ecological alternative to purchasing brand new products.</div>\n<div>\n<p dir=\"ltr\">Leading the way in a shift towards a circular economy, freeing the planet from electronic waste, and building a global leading tech company are three solid reasons to wake up every morning. Taking part in BackMarket’s adventure means committing to an ambitious project with a strong social and environmental impact!</p>\n<p dir=\"ltr\">We are committed to providing an inclusive, fulfilling, and caring work environment in all our offices (Paris, Bordeaux, New York, Berlin, Barcelone). This is an opportunity for you to join a talented, humble, and passionate team at the heart of innovation: our Bureau Of Technology. </p>\n<span id=\"m_-7000109241606017383gmail-docs-internal-guid-d8e5a12f-7fff-f740-fc86-2e5840e35e36\">Our roles are 100% remote-friendly in the UK, Germany, France, and the Netherlands. If you are from elsewhere but willing to move to one of our countries, let’s talk about it 💪</span></div>\n<div> </div>\n<div class=\"h3\">About the job:</div>\n<div>Working closely with your product owner and our backend teams, you will be the owner of your environment and will drive QA efforts to improve our automated testing strategy. You will work with all of our departments on identifying and fixing testing pain points on our roadmap and architecture. <br><br>System reliability is crucial to us and your work will have a major impact on the evolution of our product. But, more importantly, you will be a part of a wider team that all have the same vision to challenge the way we consume “new” products.</div>\n<div> </div>\n<div class=\"h3\">What you will be doing:</div>\n<div>\n<ul>\n<li>Manage and Improve our automated test strategy (Selenium / Postman), and deliver top-notch tooling and testing environments.</li>\n<li>Work in an agile \"build it and run it\" environment where engineering teams build, launch, monitor, and support the sections that they own</li>\n<li>Evangeline automated testing to your stakeholders and help them construct an ambitious testing roadmap (functional, integration, non-regression, performance, load, security)</li>\n<li>Integrate into the deployment cycle and facilitate collaboration to solve interesting and exciting problems related to our international scaling (Europe, USA, and Japan)</li>\n<li>Cultivate an open communication culture with constant feedback between team members Identity your team's pain points and drive improvements in our processes and leading adoption of best practices to support teams in increasing delivery proficiency by creating a learning environment.</li>\n</ul>\n</div>\n<div class=\"h3\">What you will bring to the team:</div>\n<div>\n<ul>\n<li>A technical vision for your team and a passion for creating automated testing and improving your environment.</li>\n<li>A love to answer a specific problem with a specific solution, and if needed, a handmade one.</li>\n<li>A passion to work in a high-volume environment. You think big and will drive our scalability to the maximum.</li>\n<li>A passion for best development practices (such as clean code, TDD, BDD, KISS, etc.)</li>\n<li>A capability to receive and give feedback in a safe and inclusive workplace</li>\n<li>Great verbal and written communication skills in English</li>\n<li>Excitement for learning about how our industry works and the impact we bring to both our customers and the world</li>\n<li>Hopefully a love for exploding kittens and board games!</li>\n</ul>\n</div>\n<div class=\"h3\">Why should you join us:</div>\n<ul>\n<li>A meaningful job: through hard work, you will help avoid thousands of tons of electronic waste and fight against planned obsolescence. It counts!</li>\n<li>An attractive salary, equity, multiple benefits (meal tickets, health insurance, etc...), parental benefits, remote-friendly, relocation package, internal events, etc…</li>\n<li>Technical challenges all day every day: you will have the freedom to innovate and adopt new ideas!</li>\n<li>Work with passionate experts who will share their knowledge and help you develop and grow! (Backademy, technical guilds, Meet-up &amp; Conference)</li>\n<li>Grow your career with a flexible career path, BackMarket can help you evolve!</li>\n<li>A booming scale-up: our environment is rapidly growing in Europe, the USA, and now in Asia!</li>\n<li>A lot of fun: you will have the opportunity to work in a fast-paced, open-minded, and friendly environment.</li>\n</ul>\n<p>BackMarket is an Equal Opportunity Employer for any minority, disability, gender identity or sexual orientation.</p>\n", "company_logo_url": "https://remotive.io/job/685143/logo"}, {"id": 983755, "url": "https://remotive.io/remote-jobs/qa/senior-qa-tester-983755", "title": "Senior QA Tester", "company_name": "KAHOOT!", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-16T21:40:27", "candidate_required_location": "Norway, Poland, Spain or Denmark", "salary": "", "description": "<p>Are you our next Senior QA Tester? Join our world-class QA team and help us make learning awesome!</p>\n<p>The Senior QA Tester will work together with the QA teams in Kahoot!, DragonBox and Poio - Kahoot! companies developing web and mobile educational games.</p>\n<p> </p>\n<p><strong>The QA Team</strong></p>\n<p>The QA team at Kahoot! consists of four Test Managers and one Support QA Engineer, who are working closely with software testers in the Philippines and Sri Lanka. Each Test Manager is assigned to an engineering team where they have the overall responsibility for the testing and quality of the releases. The QA team is diverse, with talented testers from different countries and backgrounds.</p>\n<p> </p>\n<p>Responsibilities:</p>\n<ul>\n<li>Be responsible for the releases maintaining high quality and performance</li>\n<li>Test using a variety of test techniques throughout from concept to delivery - exploratory, usability, regression, smoke testing</li>\n<li>Have the full overview of the backlog and keep it up-to-date</li>\n<li>Participate in sprint planning meetings and make sure the right issues are prioritized</li>\n<li>Plan activities at the start of the project</li>\n<li>Be proactive throughout the project, investigate issues and try to plan for things breaking along the way</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>We are looking for someone who has:</strong></p>\n<ul>\n<li>Minimum Bachelor Degree, preferably within Computer Science. Several years of relevant work experience or a degree in an education-related field can in some cases compensate.</li>\n<li>Minimum 2yrs hands-on experience in software testing</li>\n<li>Experience testing apps and websites on various platforms</li>\n<li>Experience in context-based, exploratory, or scenario testing</li>\n<li>Experience writing test cases with a strong intuition about what makes software break, designing tests to mitigate risks and helping define requirements</li>\n<li>Familiar with agile and kanban software development</li>\n</ul>\n<p>Ideally, you’ll also have:</p>\n<ul>\n<li>Experience testing in the game industry, using Unity and Unity-testing software</li>\n<li>Experience with testing mobile and tablets</li>\n<li>Experience testing backend APIs, including automated tests</li>\n</ul>\n<p>It’s important to us that you also value:</p>\n<ul>\n<li>Natural curiosity – you love learning new things!</li>\n</ul>\n<ul>\n<li>The ability to put yourself in the end users' shoes and understand their needs</li>\n<li>Being part of a unified and collaborative learning culture</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>If you talk to anyone working in the Kahoot! Group, they will tell you that one of the greatest perks is being able to see how the work you do puts a smile on the face of kids, teachers and learners all around the world.</p>\n<ul>\n<li>A fast growing environment</li>\n<li>International work environment with over 40 nationalities</li>\n<li>Remote work set up</li>\n<li>Buddy program</li>\n<li>Social and company events (virtual and in-person)</li>\n<li>Other benefits depend on the country where you will be hired in.</li>\n</ul>\n<p> </p>\n<p>We look forward to hearing from you!</p>\n"}, {"id": 981927, "url": "https://remotive.io/remote-jobs/qa/senior-software-qa-automation-engineer-981927", "title": "Senior Software QA Automation Engineer", "company_name": "Emergent Software", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-15T17:40:52", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>** This is an opportunity to join our in-house Software Development team. This position is fully remote (indefinitely). **</strong></p>\n<p>If you enjoy working with others, problem solving using technology and software, and ensuring your team’s solutions are of high quality and meet client expectations, this might be the role for you! As a Quality Engineer on our Project Delivery team, you will work with clients to understand the acceptance criteria of the project’s requirements, build test plans to assure quality, and drive automated test activities for the project.</p>\n<div class=\"h1\">Primary Duties</div>\n<ul>\n<li>Work with the agile team to plan test cases for User Stories and Features. Create testing automation scenarios to be run on new development</li>\n<li>Document results of automated testing, providing the agile team and customer a list of results. Assist with interpretation of results to create bugs or document future work for remediation</li>\n<li>Interpret and refine acceptance criteria, ensure criteria matches overall project requirements, perform manual initial testing against acceptance criterion throughout the life of the project, and execute any regression tests planned for the overall solution prior to go-live</li>\n<li>Report and track issues accurately and effectively</li>\n<li>Evaluate mid-project changes for testing impact to help the team determine if the change is viable</li>\n<li>As a subject matter expert (SME) in the areas of quality analysis and testing automation, practice continuous process improvement for opportunities to improve the quality of the test process, including reduction of costs and improved efficiency</li>\n<li>Work directly with clients to coordinate their User-Acceptance Testing (UAT) efforts prior to solution go-live</li>\n<li>Coordinate automation activities around regression testing, and scheduled testing activities for clients</li>\n<li>Other related duties as assigned by your manager</li>\n</ul>\n<div class=\"h1\">Qualifications</div>\n<div class=\"h2\">Required:</div>\n<ul>\n<li>Demonstrated experience on an agile development team in the role of a Quality Engineer performing manual and automated testing</li>\n<li>Test automation skills and experience</li>\n<li>Experience writing comprehensive test plans and test cases and moving them into testing automation tools</li>\n<li>A firm grasp on how websites, web applications, APIs, databases, mobile apps, windows apps, and the cloud function at a high level</li>\n<li>Ability to thrive on a small team in a fast-paced environment while juggling a variety of projects and wearing multiple hats</li>\n<li>Exemplary attention to detail with the ability to work with teammates to determine pragmatic solutions to quality issues</li>\n<li>Strong technical writing, verbal communication, and presentation skills are a must</li>\n</ul>\n<div class=\"h2\">Nice to Have:</div>\n<ul>\n<li>Experience with Virtuoso, Katalon Studio, Ranorex, or Test Complete</li>\n<li>Experience leading QA teams and/or performing as a QA SME as part of a larger team</li>\n<li>Experience test-planning for large projects</li>\n<li>Previous consulting experience either independent consulting or with a firm, especially with using Microsoft technologies such as .NET, SQL Server, Azure, and Office 365</li>\n<li>Familiarity with Microsoft Dev Ops, Jira, and/or other agile work organization tools</li>\n</ul>\n<div class=\"h1\">About Emergent Software</div>\n<p>Emergent Software is a growing software development and consulting company serving clients across the Twin Cities and beyond. As a Certified Microsoft Development Partner, our talented team of full-stack developers, SQL Server DBAs, Graphic &amp; UI Designers, and Project Managers strive to deliver tailored solutions, continuous development, and managed services to our clients’ business challenges. Our goal is to become a trusted extension of your team, partnering with you on critical software projects to ensure long-term system health.</p>\n<p>We offer a fun, engaging work environment that provides ample long-term career development opportunities for team members. Check us out on <a href=\"https://www.glassdoor.com/Overview/Working-at-Emergent-Software-EI_IE1201534.11,28.htm\" rel=\"nofollow\">Glassdoor</a> yourself to see how employees enjoy our remote working structure, flexible hours, profit sharing program, and more! At Emergent Software, your ideas will be heard, you will grow exponentially as a master of your craft, and you will enjoy working other dedicated team members to deliver software solutions for our clients.</p>"}, {"id": 983029, "url": "https://remotive.io/remote-jobs/qa/qa-automation-engineer-983029", "title": "QA Automation Engineer", "company_name": "Socialive", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-14T17:40:14", "candidate_required_location": "USA Only", "salary": "", "description": "<div>Socialive powers self-serve video content creation for the enterprise. It’s the fastest, easiest way to create, broadcast and distribute unlimited live and on-demand videos with studio quality. The Socialive platform puts intuitive, professional-grade video production workflows into the hands of content producers and everyday business users. Leading enterprises and high-growth companies including Charles Schwab, Deloitte, Nike, Oracle, TikTok, The New York Times, Walmart and Zendesk use Socialive to drive business value through better, more frequent video creation. Ready to join the team on a mission to transform the world of video? Join us.</div><div><br></div><div><b>About our Team:</b></div><div>Our company culture is top priority and we strive to create an environment where all of our team members are empowered to do their best work. We’re proud of the collaborative culture we’ve built, even while working fully remote. We also understand that in order to be your best self you need time to relax and recharge. That’s why we encourage everyone at Socialive to take Mental Health Days each month, in addition to their PTO and our company-wide holiday shutdown. With our distributed, remote-first team culture we’ve had the opportunity to incorporate diverse thoughts, values, and perspectives that have been critical to our growth. Diversity, Equity, and Inclusion (DEI) is at the heart of Socialive’s success and we celebrate it in everything we do. Our mission is to be a leader in DEI and demonstrate what it truly means to be a place where all people can be bold and the best version of themselves.</div><div><br></div><div><b>The Position:</b></div><div>Socialive is looking for a QA Automation Engineer to craft testing solutions that enable rapid delivery of quality software. Your primary objective will be delivering clear assessments of software quality in the shortest possible cycle time. As a QA Engineer, you’ll be responsible for:</div><br><br><div class=\"h3\">Responsibilities</div><ul><li>Working closely with your teammates and cross-functional collaborators to verify functionality while maintaining a positive and collaborative remote work environment</li></ul><ul><li>Performing end-to-end testing that will enable our engineering team to build and deploy new features and capabilities </li></ul><ul><li>Owning overall quality of software projects</li></ul><ul><li>Conducting manual validation when necessary and reviewing automated test results for new and existing features on Socialive’s web and mobile platforms</li></ul><ul><li>Crafting new automation scripts from manual test cases that can be added to our growing library of test automation</li></ul><ul><li>Work alongside both engineering, QA, and product teams to see bug fixes through to completion</li></ul><ul><li>Develop test cases and scenarios based on user stories and business requirements</li></ul><br><br><div class=\"h3\">Technologies you’ll work with and experience you’ll ideally bring</div><ul><li>3+ years of experience validating software application changes and working with third party recording testing tools (TestProject, AccelQ)</li></ul><ul><li>3+ years of experience creating automated test scripts that test both front end and back end (UI, API, Database changes)</li></ul><ul><li>3+ years of experience working with Java and Cucumber</li></ul><ul><li>Experience working in an Agile Scrum team environment</li></ul><ul><li>Experience with Web and Mobile testing (Android and iOS, Appium) a plus</li></ul><ul><li>Experience with Atlassian tools (Confluence, JIRA) and test case management suites (Zephyr, Testrail, X-Ray, etc)</li></ul><ul><li>Working with BDD testing (Cucumber, Gherkin, etc.)</li></ul><ul><li>Working with CI and Build Automation tools to incorporate test scripts in a gated build environment</li></ul><ul><li>Working with Postman / JMeter for REST API testing</li></ul>"}, {"id": 982669, "url": "https://remotive.io/remote-jobs/qa/quality-testing-engineer-982669", "title": "Quality Testing Engineer", "company_name": "Dozuki", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-13T13:41:00", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h2\"><strong>About the Role</strong></div>\n<p>Looking to join a growing team with global scale that's having a worldwide impact? At Dozuki, we're at the forefront of a revolution within the manufacturing industry: one that's characterized by removing paper, connecting people digitally, and helping to bridge the gap between the frontline and the corporate headquarters.</p>\n<p>Our Mission at Dozuki is to empower companies to teach visually. Our software helps companies to train and protect their workers across numerous industries. Working at Dozuki means being part of a small team with an opportunity to make a big difference. Our clients include many household-name companies located all over the world.</p>\n<p>We're looking for Quality Assurance Testing Engineers who share our commitment to technical excellence. If you want to join a team that values every member and you're ready to help build incredible software, then we want to talk to you.<strong><strong><br></strong></strong></p>\n<div class=\"h2\"><strong>The Ideal Candidate</strong></div>\n<p>The Dozuki Software Quality Assurance Team stewards the usability, accessibility, and defect minimization of Dozuki's software. We represent our users' needs regardless of background or experience. With our product expertise, we systematically identify defects, champion their resolution, and validate new features and bug fixes.</p>\n<p><strong>We want people who</strong><br></p>\n<ul><li>Enjoy working with a team and communicating openly with them.</li><li>Have excellent communication skills.</li><li>Look at software from the perspective of the various people who will use it.</li><li>Approach things analytically.</li><li>Are eager to learn and grow.</li><li>Are self-managing.</li><li>Have experience with using the tools we use most.<ul><ul><li><strong>A Code Editor such as VS Code or Atom</strong></li><li><strong>Git and GitHub</strong></li><li><strong>Browser developer tools</strong><br></li></ul></ul></li></ul>\n<p><strong>You will use these skills to:</strong></p>\n<ul><li>Test new features, feature changes, and bug fixes.</li><li>Take bug reports from others and convert them to issues.</li><li>Look for bugs and ways of breaking the software.</li></ul>\n<p>You will play a pivotal role in our development team. You have the final say on when we should deploy code. You will be our last line of defense against bugs.<br></p>\n<p><strong>You should let us know if you:</strong></p>\n<ul><li>Have a background in software development</li><li>Have any education in Computer Science or a similar topic</li><li>Have any background with cloud technologies like AWS or Azure</li><li>Found a bug while browsing our site (bonus points!)</li></ul>\n<div class=\"h2\"><strong>What you Get</strong></div>\n<p>Dozuki is a fantastic place to work, here are just a few of our benefits:</p>\n<ul><li>  Excellent medical, dental, and vision benefits</li><li>  Remote friendly workplace</li><li>  401(k) matching</li><li>  Generous parental family leave policy</li><li>  Dependent care FSA</li><li>⛺  Flexible schedules &amp; unlimited paid time off</li><li>  2x salary in life insurance plus coverage for spouse and children</li><li>  Charitable contribution matching</li><li>❤  Volunteer time off</li><li>  Computer supplies + workplace stipend</li><li>  Dozuki swag</li></ul>\n<div class=\"h2\"><strong>Diversity</strong></div>\n<p>Dozuki is proud to be an equal opportunity employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or any of the other essential characteristics that make each of us unique and valuable. Dozuki is committed to creating a diverse team--not only in who we hire--but through creating a supportive environment for all of our team members based on mutual respect and inclusivity.</p>\n"}, {"id": 930700, "url": "https://remotive.io/remote-jobs/qa/engineer-in-test-930700", "title": "Engineer in Test", "company_name": "Tucows", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-12T13:25:38", "candidate_required_location": "", "salary": "$65k - $80k/Year", "description": "<p><a href=\"https://tucows.com\" rel=\"nofollow\">Tucows</a> Wireless Services is building a new modern SaaS platform to help wireless companies operate around the world. The rollout of 5G networks in the US and elsewhere provides opportunities for innovation in the telecom space. And as an Internet company, our culture, experience and approach position us well to take advantage of these. </p>\n<p> </p>\n<p>If you are a seasoned Engineer in Test and this sounds like something you might like to be a part of, we may have a job for you!</p>\n<p><strong> </strong></p>\n<p><strong>About the Role:</strong></p>\n<p> </p>\n<ul>\n<li>Actively develop software quality test plans for the next-generation telecom SaaS product platform</li>\n<li>Event-driven architecture through microservices. </li>\n<li>QA and Automating Testing</li>\n<li>Designing E2E Test suites</li>\n<li>You will be using the following technologies: Kafka, Ruby, Python, Javascript, RDBMS &amp; SQL, Restful APIs &amp; Postman.</li>\n<li>You will be supporting improving CI/CD Pipelines.</li>\n</ul>\n<p> </p>\n<p><strong>Who you are:</strong></p>\n<p> </p>\n<ul>\n<li>3+ years of professional experience with Automated QA</li>\n<li>Experience designing and building Automated Test Frameworks</li>\n<li>Experience designing E2E Test Suites</li>\n<li>Experience with BDD and Cucumber</li>\n<li>An “Automate First” attitude</li>\n<li>Experience working closely with other Engineers to ensure full test coverage</li>\n<li>Demonstrated success improving the development and QA process</li>\n<li>Experience working with Stakeholders to create accurate Test Cases</li>\n<li>Positive and constructive attitude paired with fantastic verbal and written communication skills</li>\n</ul>\n<p><span style=\"color: #000000;\"><span style=\"letter-spacing: 0.75px;\"><strong><br></strong></span></span><strong>Who you might be: </strong></p>\n<p><span style=\"color: #000000;\"><span style=\"letter-spacing: 0.75px;\"><strong> </strong></span></span></p>\n<ul>\n<li>Experience with Kafka, Event Driven Architecture, &amp; Microservices</li>\n<li>Experience with Ruby, Python, Javascript</li>\n<li>Experience with RDBMS &amp; SQL</li>\n<li>Experience working with Restful APIs &amp; Postman</li>\n<li>Experience improving CI/CD Pipelines</li>\n<li>Experience with Scrum/Kanban</li>\n<li>Strong troubleshooting skills</li>\n<li>Experience working in an agile environment</li>\n<li>Contributions to an open-source project (of any kind)</li>\n<li>Experience in the telecoms space</li>\n</ul>\n<p> </p>\n<p><strong>About Tucows:</strong></p>\n<p><a href=\"https://tucows.com\" rel=\"nofollow\">Tucows</a> (NASDAQ:TCX, TSX:TC) is possibly the biggest Internet company you’ve never heard of. We started as a simple shareware site in 1993 and have grown into a stable of businesses; mobile, internet and domains.</p>\n<p> </p>\n<p>We embrace a people-first philosophy that is rooted in respect, trust, and flexibility. We believe that whatever works for our employees is what works best for us. It’s also why the majority of our roles are remote-first, meaning you can work from anywhere you can connect to the internet!</p>\n<p> </p>\n<p>Today, close to a thousand people work in over 16 countries to help us make the Internet better. If this sounds exciting to you, join the herd!</p>\n<p>________________________________________</p>\n<p> </p>\n<p>Want to know more about what we stand for? At Tucows we care about protecting the open Internet, narrowing the digital divide, and supporting fairness and equality.</p>\n<p> </p>\n<p>We also know that diversity drives innovation. We are committed to inclusion across race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status. We celebrate multiple approaches and diverse points of view.</p>\n<p> </p>\n<p>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request an accommodation.</p>\n<p> </p>\n<p>Learn more about Tucows, our culture and employee benefits on our site at: https://tucows.com/careers/</p>\n<p> </p>\n<p>(295)</p>\n", "company_logo_url": "https://remotive.io/job/930700/logo"}, {"id": 982908, "url": "https://remotive.io/remote-jobs/qa/project-quality-control-982908", "title": "Project Quality Control", "company_name": "Sketchdeck", "category": "QA", "tags": [], "job_type": "contract", "publication_date": "2021-11-11T21:42:21", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>Company Overview</strong></p> <p>Who is SketchDeck? SketchDeck is the future of the design agency. A fully remote tech start-up, we’re redefining the traditional approach to the design process by combining remote working, and innovative technology. Our talented crew is composed of engineers, marketers, sales people, account managers, and creatives from around the world, all committed to the same goal: Democratizing Design. Working with clients from Fortune 500 companies to exciting new startups, we aim to provide the majority of day-to-day design that marketing and sales organizations need.</p><p><br></p> <p><strong>Description</strong></p><p>At SketchDeck, we have a high standard for design quality. We are looking for someone who shares that high standard. Someone with extensive experience in Graphic Design who loves a fast paced environment, has great attention to technical detail and grammatical skills.</p><p>That is why we're looking for you, SketchDeck's future Design QC: In this role, you will be responsible for reviewing each project at a very detailed and technical level. You should be able to decide if the project is perfect and ready to deliver to the client, or if there are improvements to be made. You will be responsible for the technical standards, and you will work with a Design Director if there are creative needs to be addressed.</p><p>If this sounds interesting - apply below. We are ready!</p><p><strong>Requirements</strong></p><ul> <li>Interest in creative design projects</li> <li>Highly organized and able to multitask effectively</li> <li>High attention to detail</li> <li>Proficient in Microsoft Office, Google (Docs, Slides and Sheets) and working knowledge of Adobe Creative Suite programs</li> <li>Strong written, verbal, and communication skills</li> <li>Experience working with brand guidelines</li> <li>Team player with excellent relationship building skills</li> <li>Operates effectively in a fast-paced, deadline-driven environment</li> <li>Knowledge of Google email and Google calendar best practices</li> <li>Must be willing to work Pacific Standard Time hours</li> </ul> <p>We're flexible on some of these requirements, although graphic design experience, Adobe creative Suite and Microsoft Office knowledge are a must. If you are hungry to learn, we’d be happy to hear from you.</p> <p>Thank you and we look forward to hearing from you soon!</p>"}, {"id": 978532, "url": "https://remotive.io/remote-jobs/qa/junior-qa-engineer-978532", "title": "Junior QA Engineer", "company_name": "belvo", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-10T19:15:21", "candidate_required_location": "CEST timezone", "salary": "", "description": "<p style=\"min-height: 1.5em;\"><strong>A little bit about us:</strong></p>\n<p style=\"min-height: 1.5em;\">We are Belvo, a financial API platform with the bold vision of democratizing access to financial services in Latin America. We enable any company or developer to access and interpret their end-users’ financial information. We are turning the rich and diverse Latin American financial ecosystem into a set of developer-friendly tools and APIs.<br><br></p>\n<p style=\"min-height: 1.5em;\">We’re a highly-technical, passionate and driven team. We are currently 70 people, projected to be 100+ by the end of 2021. Our team currently represents 15 nationalities and we have offices in Barcelona, Mexico City, and São Paulo - while a large portion of us works remotely.<br><br></p>\n<p style=\"min-height: 1.5em;\">We are tackling a very challenging problem: connecting fintech innovators with legacy financial infrastructure. We strive to go beyond the limits of what is possible today and to do so in an elegant and developer-first way.</p>\n<p style=\"min-height: 1.5em;\"><br>Since starting our adventure in May 2019, we have raised $56m from the leading VC investors globally.<br><br></p>\n<p style=\"min-height: 1.5em;\">You can read more about us and why we’re doing what we’re doing <a href=\"https://techcrunch.com/2020/02/18/meet-belvo-a-yc-backed-startup-building-a-financial-api-for-latin-america/\" rel=\"nofollow\">here</a> and <a href=\"https://belvo.com/blog/belvo-turning-two-years-old/\" rel=\"nofollow\">here</a>.<br><br></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>About the team:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>We work in cross-functional, autonomous teams. We follow continuous delivery best practices executed on top of a modern technology stack.</li>\n<li>Our products are built for developers, by developers. Technological excellence is at the heart of what we do.</li>\n<li>We are pragmatic and customer-focused. We strive to find the right set of trade-offs in order to validate our hypothesis as early as possible, iterating on our products based on customer feedback.</li>\n<li>We communicate transparently. We do weekly all-hands where we get together to discuss company performance and goals.</li>\n<li>We are a flexible international team focused on creating cool stuff. Some of us prefer to work together in one of our offices and others prefer remote. For us, there's no difference as long as you have an excellent internet connection and are able to overlap with the team between 3 pm and 6 pm, CEST timezone.</li>\n<li>Also, we are backed by some of the leading investors in Silicon Valley and Latin America, including Founders Fund, Kaszek Ventures, and YCombinator.</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><br><strong>Your challenge:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">We are seeking an enthusiastic junior QA engineer to join our team, willing to help us solve challenging problems and grow professionally along the way.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">Nor quality assurance or quality assistance. We have our own approach. We focus on adding value to the rest of the teams. We do not just write tests or define test cases, because our focus is also on facilitating tools and processes to boost productivity. There is an actual testing culture across the team too. Therefore, a commitment to collaborative problem solving and building quality products is essential.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">We are a developer-oriented, API-first company. QA at Belvo will entail working with APIs, SDKs, libraries and other infrastructure and integration-oriented software.</p>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Create comprehensive and well-structured test plans and test cases</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Conduct manual tests when necessary</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Collaborate with other teams to improve quality across the company</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Design and develop automation scripts</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Design and build end-to-end solutions, to automate testing of complex systems</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Define and track quality assurance metrics</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Bring fresh ideas to the team and analyze new testing tools, trends and methodologies to improve existing ones</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Spread testing and QA best practices across the company</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>This position may be for you if:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Have 1+ years relevant QA experience</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">You have experience in automation testing</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Knowledge and hands-on experience with at least one programming language</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Hands-on experience with software testing methods like end-to-end, regression, integration, and exploratory</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">You have a technical background in Computer Science or equivalent work experience</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Understanding of software quality principles and agile development practices</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Familiar with RESTful APIs</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">You are familiar with the use of modern source control, CI/CD and Docker</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Team spirit, strong communication skills to collaborate with various stakeholders</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Detail-oriented, getting things done mindset</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">An endless desire to grow, learn, and enjoy</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Excellent spoken and written English</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Amazing if:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>\n<p style=\"min-height: 1.5em;\">Previous experience in FinTech or Financial Services</p>\n</li>\n<li>\n<p style=\"min-height: 1.5em;\">Relevant programming knowledge in languages such as Python or Javascript.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><br><strong>Our tech stack:</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul>\n<li>We’re building our platform using modern technologies, putting the focus on reliability and long-term maintainability</li>\n<li>We primarily use Python on the backend. We use battle-tested technologies such as Django, and we are heavy users of Python’s asyncio for some parts of our stack</li>\n<li>We use Javascript, Vue.js and Sass on the frontend. We are developing and leveraging our own design system and component library</li>\n<li>We run our infrastructure on top of Amazon Web Services, leveraging managed services. We tend to favor the use of managed services wherever possible, in order to focus on our business problems</li>\n<li>We observe and monitor our services using Datadog</li>\n<li>We follow Continuous Integration and Continuous Delivery best practices</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><br><strong>Our perks:</strong></p>\n<p style=\"min-height: 1.5em;\"><br>🚀 Stock options (we are all owners and this is very important to us)</p>\n<p style=\"min-height: 1.5em;\">🔆 Flexible working hours</p>\n<p style=\"min-height: 1.5em;\">🔝 Remote friendly</p>\n<p style=\"min-height: 1.5em;\">🐶 Pet friendly</p>\n<p style=\"min-height: 1.5em;\">🧘🏾‍♀️ Access to mental health service</p>\n<p style=\"min-height: 1.5em;\">👩🏻‍⚕️ Health Insurance</p>\n<p style=\"min-height: 1.5em;\">🎊 Paid time off on your birthday</p>\n<p style=\"min-height: 1.5em;\">🌎 Work from any office twice per year</p>\n<p style=\"min-height: 1.5em;\">💻 Renew your laptop every 2 years</p>\n<p style=\"min-height: 1.5em;\">🙋 Training Budget</p>\n<p style=\"min-height: 1.5em;\">😎 Team building events</p>\n<p style=\"min-height: 1.5em;\">🙀 Bank holidays swap inside the same month</p>\n<p style=\"min-height: 1.5em;\">🔋 Fitness/ wellness stipends</p>\n<p style=\"min-height: 1.5em;\">🚀 Yearly offsite</p>\n<p style=\"min-height: 1.5em;\">🍒 Fresh fruit every week, all-you-can-drink tea and coffee</p>\n<p style=\"min-height: 1.5em;\">🍻 Friday happy hours after our weekly team meetings<br><br><br></p>\n"}, {"id": 978959, "url": "https://remotive.io/remote-jobs/qa/quality-assurance-test-engineer-iii-978959", "title": "Quality Assurance Test Engineer III", "company_name": "PropLogix", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-09T17:42:20", "candidate_required_location": "USA Only", "salary": "", "description": "<p>We are on our way to innovate an antiquated industry by combining cutting-edge technology, transparency, and perfecting the art of customer delight. When we put <em>you</em> first, we know we can trust you to put <em>our customers</em> first.</p>\n<p> </p>\n<p><strong>What will I do?</strong></p>\n<ul>\n<li>Using an incremental approach, Test Engineer III will work with the solution architect to coordinate and implement an overall test automation approach for the PropLogix software systems.</li>\n<li>The Test Engineer III will work with the solution architect and AWS administrator in the configuration and installation of any required automated test tools on AWS.</li>\n<li>The Test Engineer III will be responsible for creating and maintaining the automated tests as the system grows and changes. The Test Engineer III will work with the Project Manager, Solution Architect, and other members of the project team to meet project objectives.<br><br></li>\n</ul>\n<p><strong>When will I work?</strong></p>\n<p>This is a full-time remote position, and hours of work and days are Monday through Friday, 8:30 a.m. to 5 p.m Eastern Time. Occasional evening and weekend work may be required as job duties demand.<br><br></p>\n<p><strong>How am I paid?</strong></p>\n<p>Salary + Full Benefits</p>\n<p>Insurance</p>\n<ul>\n<li>Multiple health, dental &amp; vision insurance plans to choose from</li>\n<li>Employer contributions to HSA and other supplemental plans</li>\n<li>FREE Employer-Paid Life Insurance, optional voluntary life for spouse, children, family</li>\n<li>Other voluntary options include: LTD, STD, AD&amp;D, Critical Illness, Whole Life</li>\n<li>Maternity and Paternity leave</li>\n</ul>\n<p>Financial</p>\n<ul>\n<li>401k match program</li>\n<li>Employee equity program</li>\n</ul>\n<p>Vacation</p>\n<ul>\n<li>Unlimited PTO</li>\n<li>8 paid holidays</li>\n</ul>\n<p>Personal Development</p>\n<ul>\n<li>Job shadowing program</li>\n<li>PropYOU - Professional Reading program that increases your paycheck by 2% each year you participate</li>\n<li>50% LinkedIn Learning Reimbursement</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>Qualifications and Education Requirements</strong></p>\n<ul>\n<li>Associates Degree (Relating to IT), Required; Bachelor's Degree, Preferred</li>\n<li>6 Years Experience as a Test Engineer including experience with .NET Core</li>\n<li>Dependable High-Speed Internet and a distraction-free work area</li>\n<li>Computer with two monitors (or laptop and an additional monitor)</li>\n<li>Windows 10 or Ubuntu 18.04 or 20.04 operating system with at least 8 GB RAM &amp; Firewall Protection</li>\n<li>Basic computer peripherals (mouse, keyboard, headset with mic)</li>\n<li>Hands on experience with automated testing tool setup and configuration</li>\n<li>Hands on experience in automated software testing tools such as Selenium</li>\n<li>Development of automated functional and performance test scripts for REST APIs and Web Applications</li>\n<li>Utilization of version control systems such as Git</li>\n<li>Effective Communication Skills (Verbal, Written, and Technical)</li>\n<li>Familiarity with integration of automated testing into Bitbucket CI/CD pipelines</li>\n<li>Expertise in automated testing of container based microservice architectures</li>\n<li>Experience with distributed performance testing in a cloud-based environment</li>\n<li>Punctual, reliable, responsible, composed, honest, ethical, tolerant of differences, and flexible</li>\n<li>Comfortable working on a virtual team<br><br><br></li>\n</ul>\n<p>Preferred Skills</p>\n<ul>\n<li>C#, PHP, Node, or equivalent programming language knowledge</li>\n<li>Understanding of Application Deployment\n<ul>\n<li>Terraform</li>\n<li>Kubernetes</li>\n</ul>\n</li>\n<li>Understanding of Web Applications</li>\n</ul>\n<ul>\n<li>Angular</li>\n<li>Static Web Sites</li>\n<li>.NET Core (WebAPI and Console apps)</li>\n<li>Node</li>\n<li>PHP (Laravel)</li>\n</ul>\n<ul>\n<li>Experience with CQRS+ES Software Architecture</li>\n</ul>\n<ul>\n<li>EventStore</li>\n<li>Redis</li>\n<li>SNS</li>\n<li>SQS</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>E-Verify Employer:</strong> PropLogix participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.<br><br></p>\n<p><strong>Notice to external Recruiters and Recruitment Agencies:</strong></p>\n<p>PropLogix does not accept unsolicited headhunter and agency resumes. Headhunters and recruitment agencies may not submit resumes/CVs through this website or directly to any employee. PropLogix and any of our subsidiaries will not pay fees to any third-party agency or company.<br><br></p>\n<p><strong>Equal Employment</strong>: It is the established policy of the Company, to provide equal employment opportunities to all qualified persons and to administer all aspects and conditions of employment without regard to race, religion, color, sex, gender, sexual orientation, pregnancy, age, national origin, ancestry, physical or mental disability, medical condition, marital status, ethnicity, genetics, alienage or any other protected classification, in accordance with applicable federal, state, and local laws.</p>\n"}, {"id": 977841, "url": "https://remotive.io/remote-jobs/qa/qadev-engineer-qa-with-php-js-and-sql-977841", "title": "QADev Engineer - QA With PHP, JS and SQL", "company_name": "Defiant", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-08T17:39:36", "candidate_required_location": "Anywhere", "salary": "", "description": "<p>Defiant is hiring a QADev Engineer. Please note that this is not an automation role. We are hiring QA Analysts that have the ability to program in PHP and Javascript, and have a strong interest not just in finding bugs, but looking at code to determine why they exist, and occasionally dropping in a quick fix to continue testing.</p>\n<p>The salary range for this role is $90,000 to $120,000 with full benefits. It includes a no-strings-attached $15,000 dollar hiring bonus on your first paycheck. We are confident you’ll love working at Defiant and being a part of our amazing team, and our signing bonus reflects that.</p>\n<p>At Defiant, we have broken down the traditional wall that exists between Dev and QA. Our QA team is more technical than most and spends time not just finding, reproducing, and logging bugs, but actually diagnosing the underlying cause and providing an unusual amount of detail to our dev team to help them quickly implement a fix.</p>\n<p>For this role, you need to be able to read and write PHP and Javascript code along with SQL. Our hiring process will include a technical portion that will evaluate your ability to not only find and report bugs but to determine what the underlying cause of a bug is.</p>\n<p>If you are currently in a QA role that is not as technical as you’d like, and you want to get your hands dirty looking at PHP and JS code, tracing execution, diving into the database, and diagnosing the underlying cause of an issue, then this role may be perfect for you.</p>\n<p>Much like the DevOps role broke down the wall between the operations team and the development team, we have broken down the wall between QA and Dev by creating a role that we are calling “QADev”.</p>\n<p>This job is 100% remote. You can work from anywhere as long as you have bandwidth. We do most of our calls voice only, and we also use push-to-talk so you can operate in noisy environments like a coffee shop, while traveling, or with kids around.</p>\n<p>We are looking for individuals who don’t just do the minimum. Our team tries harder, goes further, digs deeper, pushes technology beyond its customary boundaries. WordPress powers 40% of the web, and we are the leaders in WordPress security. Compromise or complacency is not an option for us.</p>\n<p>Our core hours are from 10am – 1pm Pacific Time, Monday through Friday. In general, we want our team to be available during that time, but we’re a realistic company, we understand that life happens, and we’re outcome-focused. So as long as you’re doing a great job and getting things done, we are flexible.</p>\n<p><strong>Requirements</strong></p>\n<p>At Defiant we have one core value, and that is “Trust”. We trust that you’ll do a great job working remotely, be available during our core hours, and once you run out of work, find other ways to contribute. We don’t micro-manage and we don’t continuously monitor our team or their productivity. If you love QA, are passionate about your job, are productive, and can help the team ship great software, you’ll be very successful at Defiant.</p>\n<p>The specific skills we require for this position are:</p>\n<ul>\n<li>Experience testing complex web applications is required.</li>\n<li>Experience testing LAMP applications is preferred.</li>\n<li>Mid-level PHP programming ability and use of dev tools required.</li>\n<li>Mid-level Javascript programming ability and use of dev tools is required.</li>\n<li>Experience working with a bug tracking system like Fogbugz, JIRA, or similar is required.</li>\n<li>SQL knowledge is required.</li>\n<li>AWS experience is preferred.</li>\n<li>A passion for testing applications and shipping robust software is a must. This is a quality assurance role, not a developer role.</li>\n</ul>\n<p><strong>Hiring Process</strong></p>\n<p>All positions require a trial period of approximately 3 weeks with a minimum commitment of 10 hours per week. You will be paid for this short-term contract, and it will be used to evaluate whether both parties want to pursue an ongoing, regular employment relationship.</p>\n<p>All offers of employment are contingent on the successful completion of a background check. The results of the background check are considered as they relate to the position and do not automatically disqualify someone from an offer of employment with the company.</p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>$15,000 one time hiring bonus.</li>\n<li>Full time telecommuting and flexible working hours, with a company that has been 100% remote for over 8 years.</li>\n<li>100% employee premium and 50% of dependent premium paid by company for premier- level medical, dental, and vision insurance.</li>\n<li>21 days PTO per year to start.</li>\n<li>Approximately 12 paid company holidays including the week from December 25 to January 1.</li>\n<li>401(k) with a 4% Safe Harbor company match that is 100% vested immediately.</li>\n<li>Latest in laptop and workstation technology.</li>\n<li>Wellness reimbursement program for health and fitness purchases.</li>\n<li>Mobile phone and internet reimbursement up to $100 per month.</li>\n<li>Monthly beverage reimbursement for coffee, tea, water, etc.</li>\n<li>Paid training and study time for work-related training and certifications.</li>\n<li>College tuition and Student Loan reimbursement.</li>\n</ul>\n<p><strong>Diversity at Defiant</strong></p>\n<p>We value diversity and do not discriminate based on race, color, religion or creed, national origin or ancestry, sex, age, physical or mental disability, military or veteran status, gender identity or expression, marital status, sexual orientation, political ideology, economic status, parental status, or any other non-performance-related status.</p>\n<p> </p>\n"}, {"id": 800759, "url": "https://remotive.io/remote-jobs/qa/senior-qa-engineer-800759", "title": "Senior QA Engineer", "company_name": "KMTX", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-07T17:00:22", "candidate_required_location": "Europe and North Africa", "salary": "", "description": "<div class=\"body u-primary-text-color \">\n<div class=\"h3\">Our mission</div>\n<p>We are KMTX, a fast growing AdTech company building the Ad Platform of the Open Web. We are working to provide the main advertising platform of the Open Web making it simple for anyone to run effective campaigns online. We believe this is the only way of preserving and improving the state of the Internet by making it open and fair. We’re targeting a $200B market.</p>\n<div class=\"h4\">The problem we’re working on</div>\n<p>As of today, Open Web advertising is a mess with unnecessary complexity, opacity, low respect of user privacy and poor performances for advertisers as well as publishers. This is what allows <strong>Walled Gardens (Google, Facebook, …) to dominate the online advertising market</strong> as they provide simple &amp; efficient advertising platforms. A simple &amp; efficient ad platform is necessary to value the <strong>Open Web, promote free access </strong>to information and fight the duopoly.</p>\n<div class=\"h4\">Our solution and achievements</div>\n<p>Since <strong>2017</strong>, we’ve worked on the hardest part of creating the ad platform of the Open Web. An automated set of tools and technologies to buy advertising in real time while delivering strong performances for advertisers.</p>\n<p>We’ve proved that our approach works with over <strong>200 brands</strong> on more than <strong>1500 campaigns</strong> and managed to consistently beat every advertising platform on the market. This success helped KMTX grow very quickly to an <strong>8 figures revenue</strong>.</p>\n<p>We are now building and deploying a self-served platform that aims to be “<strong>the Facebook Ads of the Open Web</strong>”. It allows advertisers to launch campaigns in less than 5 minutes on any inventory (Web, Apps, TV, ...) and deliver strong results for their brand. <strong>Simple &amp; Efficient</strong>. This platform will be available for advertisers in <strong>Europe and North America</strong>.</p>\n<div class=\"h4\">Who we are</div>\n<p>KMTX was <strong>founded in 2017</strong> by two serial tech entrepreneurs: Franck Tetzlaff (co founder of Doctolib) and Arthur Querou (co founder of MotionLead acquired by Adikteev).</p>\n<p><strong>We’ve raised $3m</strong> to date and plan to raise a significant round in the coming months.</p>\n<p>We’re obsessed with <strong>meaningful, powerful tech and simplification</strong> for our users.</p>\n<p>We have no fear of <strong>challenging the status quo</strong> when we believe it’s the right thing to do.</p>\n<p>We believe that small increments don't drive change. Anything we do must be <strong>10x better</strong> than what existed before.</p>\n<div class=\"h4\">Working at KMTX</div>\n<p>This also applies to hiring. We hire people that are 10 times better than we are and whom we admire. <strong>People who want to build and achieve 10x challenges</strong>. Forward thinkers, who challenge the status quo, get out of their comfort zone, are not afraid to fail, have a high-level of self-awareness and expectation while parking their ego at the door.</p>\n<p>We believe that a job should not be “just a job”, but <strong>an opportunity to grow</strong>. To perform at their best, our people should be happy and challenged. We want our people to evolve, learn, and grow in a pleasurable work environment.</p>\n<p>We care a lot about <strong>autonomy and trust</strong> which we lead by example as being very flexible on work hours or on the missions you want to work. We’ll also always be pleased by and encourage employees taking initiatives.</p>\n<p>We are as transparent as possible on what’s going on in the company and everyone in the company is always accessible. <strong>No hierarchy blocks</strong>.</p>\n<p>Finally, we provide a suite of benefits and perks that we believe are meaningful to <strong>make the life of our employees better</strong>.</p>\n<div class=\"h4\">Your key missions</div>\n<ul>\n<li>Propose and set up our test Framework from scratch</li>\n<li>Take an active part in our product rituals (you're responsible for quality)</li>\n<li>Advise our team on testing best practices</li>\n<li>Implement on test automation </li>\n<li>Settle up all our test scenarios</li>\n<li>Recommend continuous improvements in our test stack (performance...)</li>\n<li>Maintain documentation on test UI automation</li>\n</ul>\n<p> </p>\n<div class=\"h4\">Who are you</div>\n<ul>\n<li>Autonomous and hands-on</li>\n<li>You have 5+ years experience in testing with at least one experience in a SaaS small or medium-sized company</li>\n</ul>\n<ul>\n<li>Rigourous, you are known for your attention to detail</li>\n<li>Team player, you are confident to melt in our product team, interact with our developers, PM, UX... and share with them your opinions </li>\n<li>We value candidates with strong experience in implementing test automation</li>\n<li>Proficiency in JavaScript</li>\n<li>Extensive utilisation of testing solution (such as Nightwatch, Selenium)</li>\n<li>Bilingual or perfectly fluent in English</li>\n</ul>\n<p> </p>\n<div class=\"h3\">Benefits</div>\n<ul>\n<li>Sane work environment built on trust, delivery and mentoring</li>\n<li>Attractive salary and remote friendly</li>\n<li>Dedicated conferences and training budget</li>\n<li>Central Paris office</li>\n<li>Fully equipped workstation</li>\n<li>Restaurant Tickets (Swile)</li>\n<li>Health Insurance (Alan)</li>\n<li>Gym subscription (Gymlib)</li>\n<li>Regular team building events</li>\n<li>Annual company retreat</li>\n<li>Partnership with childcare centers</li>\n</ul>\n<div class=\"h3\">Interview Process</div>\n<ul>\n<li> Phone Screening</li>\n<li>Technical interview</li>\n<li>Personality / team fit interview</li>\n<li>Chat with founder</li>\n<li>VP interview</li>\n<li>Offer</li>\n</ul>\n<div class=\"custom-fields u-margin-bottom--medium\">\n<div class=\"h2\">Additional information</div>\n<ul class=\"custom-fields__list\">\n<li class=\"custom-fields__item\"><strong class=\"custom-fields__item__name\"> Remote status </strong>\n<p>Fully remote</p>\n</li>\n</ul>\n</div>\n</div>\n", "company_logo_url": "https://remotive.io/job/800759/logo"}, {"id": 966083, "url": "https://remotive.io/remote-jobs/qa/junior-qa-automation-engineer-966083", "title": "Junior QA Automation Engineer", "company_name": "MiSalud", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-06T05:39:39", "candidate_required_location": "USA Only", "salary": "", "description": "<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p>At MiSalud, we are reinventing health and wellness to become the trusted health solution for the Hispanic community. By focusing on the needs of our employees, we allow our employees to focus on the needs of our customers, creating an impactful and rewarding experience, and providing a healthcare solution to a population that is truly in need of one.</p>\n<p>We are looking for startup-minded team players who are comfortable with ambiguity and fast-paced collaboration to join our remote team that is distributed across multiple cities (Guadalajara, Los Cabos, Mexico City, San Francisco and New York). You will join a team who is focused on doing good and doing well for our customers. Product, Design and Development closely partner with each other daily, and consult just as often with our operations, marketing, and medical team members to create customer-focused solutions for our Hispanic community</p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong>As a member of the MiSalud engineering team, you’ll:</strong></p>\n<ul>\n<li>\n<p>Build a product for improving healthcare within the Hispanic community in the U.S.</p>\n</li>\n<li>\n<p>Automate test cases using Javascript and Cucumber</p>\n</li>\n<li>\n<p>Collaborate with fellow engineers, designers, business development, and company leadership to solve problems and plan for the future</p>\n</li>\n<li>\n<p>Contribute to documentation of the system so the platform and team can scale seamlessly</p>\n</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>\n<p>2+ years of proven functional testing and automation experience in web apps and back end services</p>\n</li>\n<li>\n<p>Strong software engineering fundamentals</p>\n</li>\n<li>\n<p>Excellent problem solving and analytical thinking skills</p>\n</li>\n<li>\n<p>Knowledge of software design paradigms in large-scale environments, distributed systems</p>\n</li>\n<li>\n<p>Mid to Advanced level for Javascript and Cucumber / Gherkin</p>\n</li>\n<li>\n<p>Experience using test automation frameworks such as Cypress.io, Karate and Selenium.</p>\n</li>\n<li>\n<p>Demonstrated experience and passion for delivering high-quality user experiences</p>\n</li>\n<li>\n<p>You have a quality approach, delivering high-quality products and supporting others to maintain a high standard</p>\n</li>\n<li>\n<p>You enjoy learning as well as teaching others. And are passionate about your work</p>\n</li>\n<li>\n<p>Advanced English communication skills</p>\n</li>\n</ul>\n<p><strong>Nice to have</strong></p>\n<ul>\n<li>\n<p>Have worked with design teams closely or a strong understanding of a customer-centered design process</p>\n</li>\n<li>\n<p>Understanding and experience with web services and methodologies such as APIs Rest and GraphQL.</p>\n</li>\n<li>\n<p>Understanding and experience testing web, hybrid and mobile applications</p>\n</li>\n<li>\n<p>Experience with working with the Chrome development tools.</p>\n</li>\n<li>\n<p>Understanding and experience with cloud and cloud services, containers, deployment systems, and container management platforms</p>\n</li>\n<li>\n<p>You have a background in building web products at scale and experience working in a high-growth tech company on a consumer-facing products</p>\n</li>\n<li>\n<p>Hands-on knowledge of working in an Agile environment.</p>\n</li>\n<li>\n<p>Have worked in a distributed/remote team before</p>\n</li>\n<li>\n<p>Healthtech experience</p>\n</li>\n<li>\n<p>Friends and family in the US who you will sign up as MiSalud users :)</p>\n</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p><strong>The MiSalud Interview Process:</strong></p>\n<ol>\n<li>\n<p>You apply with your resume and GitHub link to your public code, we will review and get back to you if you’re a fit</p>\n</li>\n<li>\n<p>45 min phone interviews with the Head of Engineering and Product</p>\n</li>\n<li>\n<p>A set of coding challenges that should take 3-4 hours to complete, for validating your skills in coding, algorithms and data structures</p>\n</li>\n<li>\n<p>30 min phone interviews with the Head of Operations, Tech Leads, CEO</p>\n</li>\n</ol>\n"}, {"id": 966403, "url": "https://remotive.io/remote-jobs/qa/application-tester-966403", "title": "Application Tester", "company_name": "GetResponse", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-05T01:40:12", "candidate_required_location": "Europe Only", "salary": "", "description": "<p><strong>Key responsibilities:</strong></p>\n<ul>\n<li>understanding test requirements, design and execution of test cases</li>\n<li>running manual and automated tests</li>\n<li>analyzing and reporting test outcomes</li>\n<li>cooperating closely with product owners and developers as well as other testers</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li><strong>experience in developing automated tests in any test framework</strong></li>\n<li>strong knowledge of software testing methods</li>\n<li>good insight into web technologies</li>\n<li>experience in designing test scenarios</li>\n<li>accuracy, inquisitiveness and patience</li>\n<li>very good communication skills</li>\n<li>strong desire to learn along with professional drive</li>\n<li>excellent attention to detail</li>\n<li>critical approach and constructive skepticism</li>\n<li>good English skills (at least B2 level)</li>\n<li>excellent command of Polish</li>\n</ul>\n<p><br>Nice to have:</p>\n<ul>\n<li>Java</li>\n<li>browser automation (Selenium)</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>remote work</li>\n<li>top-notch equipment</li>\n<li>home office subsidy</li>\n<li>#getremote fund</li>\n<li>private health insurance</li>\n<li>mental health supportline</li>\n<li>employee pension program (PPE)</li>\n<li>corporate life insurance</li>\n<li>sports card fund</li>\n<li>language classes</li>\n</ul>\n"}, {"id": 968831, "url": "https://remotive.io/remote-jobs/qa/life-sciences-quality-engineer-968831", "title": "Life Sciences Quality Engineer", "company_name": "TetraScience", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-04T21:40:34", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>Who We Are</strong></p><p>TetraScience provides the world’s first and only R&amp;D Data Cloud, with a mission to transform life sciences R&amp;D, accelerate discovery, and improve human life. Scientists at global pharma and biotech organizations rely on our innovative Tetra Data Platform for easy access to centralized, harmonized, and actionable scientific data to accelerate their digital lab transformation. With best-in-class SaaS performance, a team of industry innovators, and excellent product/market fit, Tetra is positioned to become an iconic life sciences software company.</p><p><strong>What You Will Do</strong></p><ul> <li>Work closely with Science and Engineering teams to support and maximize the quality and reliability of TetraScience data parsers </li> <li>Review business requirements, specifications, technical design documents and prototypes in order to eliminate potential predevelopment issues </li> <li>Research vendor instrument software, instrument specs, APIs, data formats to uncover all potential scenarios </li> <li>Develop, update and maintain test plans, cases, scripts and automation </li> <li>Prepare and maintain complex test datasets </li> <li>Utilize QA best practices, patterns, and processes through all the stages of SDLC Maintain traceability of tests to requirements and specifications </li> <li>Maintain a high degree of technical competence with the latest Web, API and Desktop application testing technologies</li> </ul><p><strong>Requirements</strong></p><p><strong>What You Have Done</strong></p><ul> <li>Experience in Life Sciences and Pharma workflows, working with scientific instrument systems and complex data outputs </li> <li>3+ years of hands-on Quality engineering experience in a fast-paced environment </li> <li>Undergraduate or graduate degree in chemistry, biology, computer science, statistics, public health, etc. </li> <li>Experience working in complex computing environments being able to formulate and implement effective test strategies, prepare and maintain complex test datasets </li> <li>Hands on in using scripting languages such as Python, JavaScript and working in AWS environment </li> <li>Passionate about science and building solutions to make the data more accessible to the end-users </li> <li>Excellent organizational, verbal, and written communication skills Analytical problem solving skills applied to issue identification and resolution</li> </ul><p><strong>Benefits</strong></p><ul> <li>100% employer-paid benefits for all eligible employees and immediate family members</li> <li>Unlimited paid time off (PTO)</li> <li>401K</li> <li>Flexible working arrangements - Remote work + office as needed</li> <li>Company paid Life Insurance, LTD/STD</li> </ul>"}, {"id": 968592, "url": "https://remotive.io/remote-jobs/qa/software-engineer-in-test-968592", "title": "Software Engineer in Test", "company_name": "Linode", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-03T09:48:10", "candidate_required_location": "USA Only", "salary": "", "description": "<p>As a Software Engineer in Test at Linode, you will work on our open source single page app and API used by developers like you around the world. These interfaces are used to manage hundreds of thousands of Linodes running on our global datacenter network. The front-end application is on <a href=\"http://cloud.linode.com\" rel=\"nofollow\">cloud.linode.com</a> and is an Open Source project hosted on Github <a href=\"https://github.com/linode/manager\" rel=\"nofollow\">https://github.com/linode/manager</a> and the API documentation can be found on <a href=\"https://developers.linode.com\" rel=\"nofollow\">https://developers.linode.com</a> .</p>\n<p>In this position, you will be in charge of reviewing the quality of the whole product, participating in maintaining the code quality and in charge of the test strategy of these applications. You will help to make sure our customer-facing applications are performant, accessible, and reliable. You will partner with other developers to ensure the test coverage can help us reliably deploy the application. Day to day responsibilities will include working on continuous integration, static analysis, unit, integration and end-to-end tests.</p>\n<p>Our work environment nurtures innovative solutions, rapid development cycles, and open communication. We're a closely-knit team with a focus on agile development and innovative solutions. We encourage and reward curiosity, ingenuity, and technical excellence.</p>\n<div class=\"h1\">TECHNOLOGIES</div>\n<p>You don't have to have experience with all of these, but you should have experience with some of them and an interest in learning others</p>\n<ul><li>Node.js, Cypress.io</li><li>Python, Pytest</li><li>Typescript, React</li><li>Jest, Enzyme, React Testing Library</li><li> Github Actions, Jenkins, Docker</li></ul>\n<div class=\"h1\">Must haves:</div>\n<ul><li>Experience with Node.js and/or Python</li><li>Excellent communication and interpersonal skills</li><li>About 2 years of experience in web application development and / or testing</li><li>Experience working with and testing RESTful APIs</li></ul>\n<div class=\"h1\">Nice to haves:</div>\n<ul><li>Experience with TypeScript, React, Flask</li><li>Bachelor's degree in Computer Science or a related field</li><li>Contributions to open-source projects as well as your own projects</li><li>Build and deployment automation experience</li></ul>\n<div class=\"h1\">Work With Us</div>\n<ul><li>Headquartered in one of the coolest buildings in Philadelphia, Linode has plenty of inviting office space to work from, plus remote work options for most positions.</li><li>Work/Life Balance: We have flexible work hours, remote work options, and a very generous paid time off package including volunteer time off and even a paid day off on your birthday!</li><li>Your health matters: We cover up to 90% of medical premiums plus pay for 100% of out of pocket costs that insurance doesn't take care of.</li><li>Retirement benefits: Linode provides a range of retirement benefits including contributions to your 401k plan, a generous profit sharing plan, and a pension plan.</li><li>Your family is important to us! Employees may benefit from fully paid parental leave, company sponsored 529(c) savings plans, and family-friendly company events.</li><li>Our benefits to support your wellbeing include fully paid access to online mental wellness programs through AbleTo for you and your family, $100 monthly wellness reimbursements, as well as a robust EAP (employee assistance plan) offering</li><li>Free hosting service: Take advantage of some Linode service - we'll pick up the tab.</li><li>Competitive salary: It all begins with fair compensation. We believe in paying people well and rewarding those who go the extra mile. The compensation range for this position is between $80,000 to $120,000 based on a full-time schedule. The salary could vary outside of this range based on your specific skills and experience. Employees may also qualify for a bonus on top of base salary depending on company and individual performance.</li><li>Take a look at our careers site for a full listing of benefits: <a href=\"https://www.linode.com/company/careers/benefits/\" rel=\"nofollow\">https://www.linode.com/company/careers/benefits/</a></li></ul>\n<p></p>\n<ul></ul>\n<p><strong>Equal Employment, Equal Treatment, No Judgment</strong><br>Linode is committed to a culture that creates a sense of inclusion and belonging. We understand that teams perform their best when they include people with diverse backgrounds and differing perspectives, but also that to achieve greatness, people need to feel like they can be themselves; they need to be equal, included, and comfortable in order to perform at their best. Linode stands for equal pay, equal treatment, and equal experiences for all of our people, past, present, and future, regardless of age, race, ethnicity, religion, gender, sexuality, socioeconomic class, disability status, or any other differentiating factor. We strive to make sure every last person we interact with feels like they belong and have the same opportunities as everyone else.<br><br>About Linode<br><br>Since 2003, Linode has been providing cloud computing services to customers around the world. Linode offers compute, storage, and networking services from ten data centers in regions spanning North America, Europe, Asia, and Oceania. We are committed to making Linode the most simple, powerful, and reliable hosting provider that thousands of customers—from the fastest-growing startups to established enterprises—trust. This industry moves fast, but we strive to hire the kind of people who can stay a step ahead and keep us - and themselves - at the top. We are an equal opportunity employer and we are committed to building a diverse, inclusive, and welcoming workplace for all.<br></p>\n"}, {"id": 953568, "url": "https://remotive.io/remote-jobs/qa/automation-test-architect-953568", "title": "Automation Test Architect", "company_name": "Ungerboeck", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-11-01T01:41:33", "candidate_required_location": "USA Only", "salary": "", "description": "<br><br><div class=\"h3\">Company Description</div><p><strong>Who We Are:</strong></p><p>Interested in joining our team?  Here is some more information about us!  Ungerboeck provides industry-leading event and venue management software to customers in over 50 countries around the world, serving thousands of customers that power millions of events.  In the age of digital transformation, our comprehensive platform offers event professionals leading-edge SaaS technology that provides a 360 view of their business, allowing them to cut costs, save time, and increase revenue. Ungerboeck is used for top shows from across the world, famous museums, global convention centers, performing arts venues, professional sports arenas, and other unique events.  Our client list includes The Apollo Theatre, Mercedes-Benz Stadium, Harvard University, Portland'5 Centers for the Arts, the Javitz Center, and St. Louis Art Museum.  Some of our global clients include: ExCel London,  Museum of Contemporary Art Australia, Omanexpo, the China National Convention Center, the Porsche Experience Center in Germany and the Sydney Opera House.</p><p><strong>Working @ Ungerboeck:</strong></p><p>We live by the unofficial motto of work hard play hard. Surround yourself with highly motivated co-workers that push you to be your best each day. Ungerboeck offers the career opportunities and fast-paced, exciting environment of a growth company where you can make a direct impact on our product and customers.</p><br><br><div class=\"h3\">Job Description</div><p>Ungerboeck is looking to hire an experienced Quality Engineer to lead  Automated Testing. This is a<strong> *new* position</strong> and candidates can work remotely.</p><p>The ideal candidate has proven experience in automation to create automation scripts for the new and existing test cases.  As a Quality Engineer, you’ll collaborate with many other teams at Ungerboeck, including software consulting, product management, software engineering, success management, client care, and more, to help ensure Ungerboeck delivers an engaging solution to meet our customers’ business and user needs. You will have the opportunity to work on many different types of solutions to meet the various needs of our customers across the following industries: conference, convention and exhibition centers, sporting venues, performing arts centers, colleges and universities, conference organizers, and many more.</p><p><strong>Responsibilities include:</strong></p><ul><li>Owns the testing automation strategy, test data management strategy, and test automation framework architecture.</li><li>Develops new or maintains existing test automation frameworks</li><li>Writes, debugs and executes code used in automated testing efforts.</li><li>Defines, implements, and manages processes and “best practices” with regard to automated testing.</li><li>Establishes processes to continually review and select manual test cases for automation test suites.</li><li>Provides metrics on business process and code coverage for automated test suites.</li><li>Review and analyze functional and design specifications documents</li><li>Identify test requirements from design document and mapping documents</li><li>Involvement in test planning, writing test cases/scripts, creating reusable test data, test case automation, and test execution</li><li>Develop automation test scenarios and enhance automation test platform</li><li>Create and facilitate test plans/reviews </li><li>Execute manual and automated test cases</li><li>Become an indispensable part of the team</li><li>Represent customers and their expectations of quality software</li><li>Provide insightful feedback on designs and requirements (pre-development) and on development results (post development) advocating for how your customers will use the software in real life situations</li><li>Work with users to reproduce and triage defects</li><li>Cultivate a reputation of paying close attention to the details while also understanding the big picture</li><li>Become an expert in not just how the software functionally works but how it delivers value to the customers</li><li>Offer ideas as to how the software could be improved in your area in order to deliver more value to the customers</li></ul><p> </p><br><br><div class=\"h3\">Qualifications</div><ul><li>3-5+ years software testing experience, preferably for web-based software applications</li><li>3-5+ years professional experience using commercial issue tracking, test plan management and automation tools such as Selenium</li><li>Experience leading a team of automated test engineers</li><li>Experience with building test plans and test cases</li><li>Experience with Agile-based development practices and working as part of a Scrum team</li><li>Understanding of user experience/usability concepts including WCAG accessibility testing</li><li>Working knowledge of Telerik Test Studio, Microsoft Azure DevOps and Azure Test Plans, Microsoft SQL Server, Git, etc.</li><li>Excellent problem-solving, communication and interpersonal skills, along with patience, a customer-friendly attitude, and the ability to work in a cross-functional team environment</li><li>Passionate about technology</li><li>Desire to learn - Ability to learn quickly in a self-directed environment</li><li>Is energized by playing detective and finding the defects that go unnoticed by mere mortals</li><li>Take pride in your area of expertise and be proud when customers are delighted with what you have delivered</li><li>Skilled in identifying and analyzing important issues faced by a diverse client base, finding new approaches, and proposing solutions to delight customers</li><li>Team player – energetic, dependable, responsive and promotes a positive work environment through teamwork and collaboration</li><li>Ability to troubleshoot, recreate and resourcefully solve difficult problems</li><li>Strong verbal and written, interpersonal, and communication skills</li><li>Bachelor's degree - Computer Science or a related technical field</li></ul><br><br><div class=\"h3\">Additional Information</div><p><strong>What’s</strong><strong> </strong><strong>in it for you?</strong>  </p><ul><li>Full benefits &amp; exceptional 401k match   </li><li>Working in a team of smart, yet down-to-earth marketers who challenge you to be your best everyday   </li><li>3 weeks PTO, 8 paid holidays, and 2 paid floating holidays per year  </li><li>Flex Time and Work from Home options   </li><li>Personal training and on-site gym  </li><li>Win at life by loving your job </li></ul><p>*All your information will be kept confidential according to EEO guidelines.</p><div></div><p>Ungerboeck is an equal opportunity employer and does not discriminate based on race, color, national origin, age, religion, creed, disability, veteran’s status, gender, sexual orientation, gender identity or gender expression.</p>"}, {"id": 955631, "url": "https://remotive.io/remote-jobs/qa/lead-quality-assurance-analyst-955631", "title": "Lead Quality Assurance Analyst", "company_name": "King Energy", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-31T01:39:33", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h3\">COMPANY OVERVIEW</div>\n<p>King Energy is a next generation energy company.</p>\n<p>We install solar power at multi-tenant commercial properties such as shopping centers, office buildings and medical plazas and deliver the power we generate to the businesses at the property.</p>\n<p>Our goal is to turn open rooftops into sources of clean, renewable power, and to do this in a way that generates increased rent revenue for property owners and lowers energy costs for small, local businesses.</p>\n<p>We have a welcoming culture that values intelligence and hard work.</p>\n<div class=\"h3\">POSITION</div>\n<p>King Energy is looking for a Lead Quality Assurance Analyst. This role reports to the Chief Technology Officer.</p>\n<div class=\"h3\">YOUR CONTRIBUTION</div>\n<ul><li>Be a founding member of a development team focused on independent verification of the most complex parts of King Energy's systems, such as billing, payments, and data pipelines</li><li>Gather information about products and/or processes by observations, interviewing stakeholders and team members, using related reports, etc</li><li>Define testing standards, SLA and strategies</li><li>Raise and mitigate risks</li><li>Understanding metrics of test scenarios</li><li>Perform initiatives related to User Acceptance Testing (UAT) process and product rollout into production</li><li>Ensure consistency and quality of processes across the organization. Exhibits in-depth understanding of concepts and procedures within own area and basic knowledge of these elements in other areas</li><li>Collaborate with stakeholders to ensure project stability and productivity</li></ul>\n<div class=\"h3\">KNOWLEDGE AND SKILLS REQUIRED</div>\n<ul><li>5+ years experience with a focus on quality engineering or independent verification efforts</li><li>Strong documentation skills and understanding of transitioning this into testing scenarios</li><li>Modern automation tooling technologies</li><li>Excellent knowledge of software testing techniques and testing tools</li><li>Knowledge of any well-known software development and testing life-cycle methodology</li><li>Requires communication and diplomacy skills and an ability to persuade and influence</li><li>College degree from major 4-year institution</li><li>Bonus if you have FinTech, Start Up and/or Solar domain experience</li></ul>\n<div class=\"h3\">LOCATION</div>\n<ul><li>Fully Remote</li></ul>\n<div class=\"h3\">COMPENSATION</div>\n<ul><li>Base salary range for this position is $85,000 - $115,000 and is based upon years of experience that is commensurate with the level of the position in addition to location.</li><li>Stock options with significant upside potential</li><li>Participation in company's benefits program: medical, dental, vision, disability, life, 401k</li></ul>\n"}, {"id": 954860, "url": "https://remotive.io/remote-jobs/qa/senior-quality-engineer-954860", "title": "Senior Quality Engineer", "company_name": "herohealth", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-28T21:39:26", "candidate_required_location": "USA Only", "salary": "", "description": "<div><strong>Hero: We Build Solutions to Healthcare's Hardest Problems</strong></div>\n<div> </div>\n<div>Hero was founded as the world’s most people-focused healthcare company, investing the time and effort required to create truly frictionless solutions to the hardest, most pervasive problems in healthcare. We’re starting with the largest universal yet avoidable cost to the US healthcare system: medication management.</div>\n<div> </div>\n<div>In 2018 we introduced a groundbreaking hardware device that automatically manages, sorts, and dispenses an individual's entire pill regimen, and it transformed how people manage their health. Combined with app-based notifications, and our direct-to-door prescription fulfillment service, Hero has driven medication adherence to levels never before achieved in healthcare.</div>\n<div> </div>\n<div>This is an exempt position, reporting directly to the Director of Manufacturing Operations. Work location is remote.</div>\n<p><br><br></p>\n<div class=\"h3\">Key Activities</div>\n<ul>\n<li>Lead manufacturing quality activities, domestic and international, to ensure production meets Hero’s specifications.</li>\n</ul>\n<ul>\n<li>Work with Product, Engineering teams to ensure quality is designed into HERO products and processes at all project phases.</li>\n</ul>\n<ul>\n<li>Support design reviews for manufacture, and new supplier &amp; part qualification.</li>\n</ul>\n<ul>\n<li>Develop incoming inspection processes, supplier qualification, supplier monitoring, corrective actions etc.</li>\n</ul>\n<ul>\n<li>Assist Supply Chain team to identify and vet new suppliers, assess capability, quality, and perform audits and assessments.</li>\n</ul>\n<ul>\n<li>Resolve field failures, and quality issues.</li>\n</ul>\n<ul>\n<li>Mentor and support site personnel on supplier quality activities, initiatives, and process effectiveness.</li>\n</ul>\n<ul>\n<li>Support supplier continuous improvement through monitoring and performance.</li>\n</ul>\n<ul>\n<li>Identify risk and systemic performance issues through metrics, auditing, etc.</li>\n</ul>\n<ul>\n<li>Identify and drive process improvement; Gage R&amp;R, Cp, Cpk, and SPC familiarity</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Activities</div>\n<ul>\n<li>Participates in customer-facing supplier quality activities and initiatives.</li>\n</ul>\n<ul>\n<li>Collectively lead supplier business reviews with Regional Commodity Managers for all key AMER suppliers to cover price, OTD, improvement goals, key initiatives, and market information.</li>\n</ul>\n<ul>\n<li>Periodic travel to suppliers will be required.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Main Qualifications</div>\n<ul>\n<li>5+ years of mass production experience preferably with Tier 1 manufacturers preferably within consumer electronics, CPG, or medical device</li>\n</ul>\n<ul>\n<li>Experience with CAPA, lean/6sigma, or other continuous improvement technique.</li>\n</ul>\n<ul>\n<li>Excellent project management, communication, and interpersonal skills.</li>\n</ul>\n<ul>\n<li>B.S. in Mechanical/Electrical/Manufacturing/Industrial engineering or technical master’s degree required.</li>\n</ul>\n<ul>\n<li>Excellent analytical and data analysis abilities to solve complex problems and drive results.</li>\n</ul>\n<ul>\n<li>Broad understanding of inspection and test  methods, manufacturing technologies and processes.</li>\n</ul>\n<ul>\n<li>Working knowledge of product/supplier compliance to the 21 Code of Federal Regulations (CFR), Part 820 Food and Drug Administration (FDA), Quality Systems Regulation (QSR), and/or ISO 13485 quality system standard</li>\n</ul>\n<div>HERO is proud to be an equal opportunity workplace. We value diversity and always treat all employees and job applicants based on merit, qualifications, personality and talent. We do not discriminate on the basis of race, religion, ancestry, color, national origin, gender, sexual orientation, gender identity, age, citizenship, marital status, veteran status, or disability status.</div>\n"}, {"id": 937464, "url": "https://remotive.io/remote-jobs/qa/quality-engineer-937464", "title": "Quality Engineer", "company_name": "Boxcast", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-27T17:41:18", "candidate_required_location": "USA Only", "salary": "", "description": "<div><b style=\"font-size: 11pt\">How You’ll Make an Impact</b></div><div><br></div><div><span style=\"font-size: 11pt\">At BoxCast, delivering quality products to our customers is paramount to our mission.  As a Quality Engineer, you will be part of the quality engineering team as well as an integral part of our agile development teams. You will engage with quality engineers, developers, UX designers, and product owners to help the team reach their goals and continuously deliver value to broadcasters and viewers.</span></div><div><br></div><div><span style=\"font-size: 14.6667px\">Note: BoxCast offers a hybrid work option. The Quality Engineer will have the freedom to work remotely or at an office whenever they choose.</span></div><br><br><div class=\"h3\">What You’ll Do</div><ul><li>Actively participate in sprint planning, kickoff, and review meetings</li></ul><ul><li>Collaborate with stakeholders to define requirements and acceptance criteria</li></ul><ul><li>Design and execute test plans and strategies</li></ul><ul><li>Contribute to the building, maintenance, and proper usage of test environments, frameworks, and tools</li></ul><ul><li>Write and maintain automated tests</li></ul><ul><li>Perform manual and exploratory testing</li></ul><ul><li>Provide visibility and insight into test results</li></ul><ul><li>Stay informed of technologies, tools, and vendors that BoxCast can or should be leveraging in order to improve our capabilities or efficiency</li></ul><ul><li>Support a DevOps culture through the extension of CI/CD best practices</li></ul><ul><li>Maintain good relationships with internal and external stakeholders</li></ul><ul><li>Support organizational strategies and objectives</li></ul><br><br><div class=\"h3\">How You’ll Display Our Values</div><ul><li><b>Integrity</b>: Leads by example by exhibiting personal integrity in all ways.  Takes responsibility for the organization’s effectiveness. Operates as a beacon of trust and ethical engineering guidance for a growing, high performing team</li></ul><ul><li><b>Collaboration</b>: Understands when to communicate and escalate information critical to business leaders and promotes a collaborative environment within the Engineering team</li></ul><ul><li><b>Judgment</b>: Thinks critically and makes decisions based on quantitative – not qualitative – measures</li></ul><ul><li><b>Achievement</b>: Thrives on execution and is motivated to develop great products that make an impact</li></ul><ul><li><b>Innovation</b>: Creates an environment that fosters creativity and smart risks in order to inspire indispensable solutions to complex problems and dramatic improvements to the business</li></ul><br><br><div class=\"h3\">Must Haves</div><ul><li>Bachelor's degree in quality engineering or a related field, or equivalent experience</li></ul><ul><li>3+ years experience in a quality engineering field</li></ul><ul><li>Experience writing API tests using Postman, SoapUI, or similar tools</li></ul><ul><li>Experience writing automated UI tests using Selenium in Ruby, Python, Java, or NodeJS</li></ul><ul><li>Knowledge of SDLC and testing fundamentals</li></ul><ul><li>Knowledge of CI/CD operations</li></ul><ul><li>Experience working in an agile environment</li></ul><ul><li>Demonstrated ability to follow directions and execute with minimal supervision</li></ul><ul><li>Excellent communication skillsHigh attention to detail and process</li></ul><br><br><div class=\"h3\">Nice to Haves</div><ul><li>Understanding of the live streaming ecosystem</li></ul><ul><li>Experience in a startup tech environment</li></ul><ul><li>Experience developing software applications</li></ul><ul><li>Load and performance testing with tools such as JMeter </li></ul><div><br></div><div><br></div><div>BoxCast is a live streaming company based in Cleveland, Ohio, but we serve broadcasters and viewers in more than 200 countries. Our founders launched BoxCast back in 2013 with one purpose: to make people part of the experience. </div><div><br></div><div>Since then, we’ve helped thousands of people connect with their communities and reach those who can’t attend events in person. Our vision is to be the best live streaming company for organizations — always evolving and pursuing better ways to amaze our customers. We pride ourselves on our company values of integrity, collaboration, judgment, achievement, and innovation.</div><div><br></div><div>BoxCast is proud to be an Equal Employment Opportunity employer.</div><div>Sponsorship for work authorization for foreign national candidates is not available for this position.</div>"}, {"id": 936182, "url": "https://remotive.io/remote-jobs/qa/qa-automation-engineer-936182", "title": "QA Automation Engineer", "company_name": "Nacelle", "category": "QA", "tags": [], "job_type": "", "publication_date": "2021-10-26T17:42:29", "candidate_required_location": "Anywhere", "salary": "", "description": "<div class=\"h2\"><strong>Who We Are</strong></div>\n<p>Nacelle was built for eCommerce brands who are dissatisfied with slow page load speeds and low mobile conversion rates. Our product is a headless commerce solution that converts traditional eCommerce stores into lightning-fast progressive web apps. The result is an increase in conversion rates of 25%+, larger average cart sizes, and improved infrastructure, which can handle large spikes in traffic. We integrate into existing platforms like Shopify within 15 minutes.</p>\n<p>Nacelle is an early stage, venture-backed, fully remote company. Recently closing our Series B round for $50m, our institutional investors include Tiger Global,  Index Ventures, Inovia and more. We also have raised from notable industry angels including leaders from Shopify Plus, Attentive, and Klaviyo.</p>\n<div class=\"h2\"><strong>The Role</strong></div>\n<div>\n<div>Come join a unique team of developers who are passionate about solving complex problems in simple and elegant ways. On a daily basis, you will be working on big data pipelines, scaling out API's, testing deployments and much more. Join up!</div>\n<div> </div>\n</div>\n<div class=\"h2\"><strong>The Impact You Will Have:</strong></div>\n<p><br>In your first 90 days:</p>\n<ul>\n<li>Complete your onboarding program and ramp up your knowledge on how our system works including our CI/CD strategy, and our mode of operation. </li>\n</ul>\n<p>In your first 6 months:</p>\n<ul>\n<li>Be on your way to revamping/revitalizing our testing strategy.</li>\n</ul>\n<p>In your first year:</p>\n<ul>\n<li>Have a rock solid automated testing culture and framework for ensuring bugs rarely make it to production.</li>\n</ul>\n<div class=\"h2\"><strong>Responsibilities Include:</strong></div>\n<ul>\n<li>Own all testing org-wide. This includes writing and maintaining tests, testing frameworks, automation, etc.</li>\n<li>Analyze bug reports and highlight problems to help identify fixes for them. Deliver regular reports identifying these bugs to other members of the engineering team.</li>\n<li>Determine priority for test scenarios and creating execution plans to implement these scenarios.</li>\n<li>Log and document errors in tracking systems.</li>\n<li>Take part in brainstorms to come up with new ideas and designs that improve existing features.</li>\n</ul>\n<div class=\"h2\"><strong>Skills &amp; Qualifications:</strong></div>\n<ul>\n<li>Advanced knowledge of Cypress, Jest, Puppeteer, Mocha or other comparable testing frameworks.</li>\n<li>Advanced understanding of where QA automation fits into a CI/CD pipeline and the overall SDLC.</li>\n<li>Advanced understanding of when and where unit, integration and e2e testing should be used/implemented.</li>\n<li>Advanced understanding of Continuous Delivery and Feature Flagging.</li>\n<li>Intermediate+ in at least one high level programming languge (JS/TypeScript preferred).</li>\n<li>Intermediate+ in at least one cloud provider (AWS preferred).</li>\n<li>Intermediate+ in Linux/Unix based operating systems.</li>\n</ul>\n<div class=\"h2\"><strong>Nice to Have:</strong></div>\n<ul>\n<li>Kubernetes experience.</li>\n<li>Kafka experience.</li>\n<li>Cassandra (NoSQL) experience.</li>\n</ul>\n<div class=\"h2\"><strong>Benefits &amp; Perks:</strong></div>\n<ul>\n<li>Robust health benefits packages</li>\n<li>Full support for remote work, including a stipend for getting your home work space setup </li>\n<li>Home internet plan paid for monthly</li>\n<li>Unlimited PTO</li>\n<li>An extremely enthusiastic team that appreciates collaboration</li>\n</ul>\n"}, {"id": 930571, "url": "https://remotive.io/remote-jobs/qa/data-quality-assurance-analyst-930571", "title": "Data Quality Assurance Analyst", "company_name": "Quest Analytics", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-26T09:44:39", "candidate_required_location": "USA Only", "salary": "", "description": "<div>Quest Analytics is one of the fastest growing companies in the Healthcare software space in the US. Healthcare providers and insurance companies rely on our software. We do the important work of providing access to healthcare for all Americans! </div>\n<div> </div>\n<div>We are looking for a Data Quality Assurance Analyst to join our Data and Analytics team. As a Data QA Analyst at Quest Analytics you will perform in depth QA on the data and APIs that support client-facing products with the goal of delivering 0 defects to production.  QA will be performed starting with the initial ingestion of data through an MDM solution, an Azure Data Lake, a CRM and a Marketing Automation tool.  </div>\n<div> </div>\n<div>The ideal candidate will have the technical skills to perform QA of the data, the business analysis skills to create in-depth test cases in an agile environment, and the organizational skills to manage testing and the associated defects.</div>\n<div> </div>\n<div>While we empower our teams to figure out the best solutions to the problems that need to be solved, we also hold those teams accountable to the results. We look for QA analysts that are not afraid of signing up for business outcomes.  #LI-Remote</div>\n<div> </div>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">In this role you will:</div>\n<ul>\n<li>Document test cases and test scripts based on Agile stories</li>\n</ul>\n<ul>\n<li>Create the code required to run test cases</li>\n</ul>\n<ul>\n<li>Execute test cases and identifying defects</li>\n</ul>\n<ul>\n<li>Participate in scrum team activities to monitor defect resolution</li>\n</ul>\n<ul>\n<li>Suggest creative and active solutions for problems</li>\n</ul>\n<ul>\n<li>Monitor and report on defect resolution to management</li>\n</ul>\n<ul>\n<li>Identify and document processes around the QA of data across multiple environments</li>\n</ul>\n<ul>\n<li>Support technical staff in the resolution of defects</li>\n</ul>\n<ul>\n<li>Identify missed business rules that need to be submitted for future development</li>\n</ul>\n<ul>\n<li>Provide actionable recommendations for improving data quality or integrity</li>\n</ul>\n<ul>\n<li>Work with stakeholders to understand, reproduce, and address defects identified by clients or internal parties</li>\n</ul>\n<ul>\n<li>Participate in the training and/or mentoring programs as assigned or required</li>\n</ul>\n<ul>\n<li>Adhere to the Quest Analytics Values and support a positive company culture </li>\n</ul>\n<ul>\n<li>Respond to the needs and requests of clients and Quest Analytics management and staff in a professional and expedient manner</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">What we are looking for:</div>\n<ul>\n<li>Bachelor’s degree; preferably in data analytics or computer engineering</li>\n</ul>\n<ul>\n<li>A minimum of 2 years' experience in a QA position specifically focused on data </li>\n</ul>\n<ul>\n<li>Experience working with large datasets</li>\n</ul>\n<ul>\n<li>Intermediate to advanced SQL skills</li>\n</ul>\n<ul>\n<li>Familiarity with best practices of quality assurance practices</li>\n</ul>\n<ul>\n<li>Ability to work independently and as part of a team</li>\n</ul>\n<ul>\n<li>Strong communication skills and customer focus</li>\n</ul>\n<ul>\n<li>Excellent troubleshooting, listening and problem-solving skills</li>\n</ul>\n<ul>\n<li>Able to work in a fast-paced, deadline-oriented environment</li>\n</ul>\n<ul>\n<li>Experience with data tools such as Databricks and Spark preferred</li>\n</ul>\n<ul>\n<li>Experience with healthcare data preferred</li>\n</ul>\n<div>We are not currently engaging with outside agencies on this role.</div>\n<div> </div>\n<div><strong style=\"font-size: 13.5pt;\">Ready to Evolve?</strong></div>\n<div><span style=\"font-size: 10.5pt;\"> </span></div>\n<div><span style=\"font-size: 10.5pt;\">We want smart, driven individuals to help us create Quest Analytics future. If you invest yourself in your work, live with enthusiasm, and thrive on results, we want to know you.  Bring your entrepreneurial spirit to a company that won’t limit you to a job description. At Quest Analytics, your ideas will be listened to and valued, your unique talents appreciated, and your contribution rewarded. You’ll enjoy a healthy work/life balance with Workplace Flexibility, a generous salary &amp; benefits package, and plenty of room to grow personally and professionally.  And you’ll have the opportunity to shape the future of an industry with systemic problems — working with more than 400 healthcare networks and nearly 500,000 providers to help improve access to healthcare in America.</span></div>\n<div><span style=\"font-size: 10.5pt;\"> </span></div>\n<div><span style=\"font-size: 10.5pt;\"> </span></div>\n<div><strong><em style=\"font-size: 13.5pt;\">What's in it for you</em></strong><em style=\"font-size: 13.5pt;\">:</em></div>\n<div> </div>\n<div><strong><u>Great benefits package with:</u></strong></div>\n<div>·<span style=\"font-size: 7pt;\">               </span>Competitive salary and success sharing bonus</div>\n<div>·<span style=\"font-size: 7pt;\">               </span>100% paid HDHP Health plan, Dental, Vision for Employee tier and cost-sharing for all other tiers</div>\n<div>·<span style=\"font-size: 7pt;\">               </span>Company matching 401(k) and HSA</div>\n<div>·<span style=\"font-size: 7pt;\">               </span>Generous PTO, Sick time, and 10 Holidays</div>\n<div>·<span style=\"font-size: 7pt;\">               </span>Paid Life, Short &amp; Long Term Disability</div>\n<div>·<span style=\"font-size: 7pt;\">               </span>Paid maternity / paternity and much more</div>\n<div>·<span style=\"font-size: 7pt;\">               </span>Wellness programs</div>\n<div>·<span style=\"font-size: 7pt;\">              </span>Flexible work arrangements so you can balance work/life  </div>\n<div>·<span style=\"font-size: 7pt;\">               </span>The opportunity to get in on ground floor and grow and learn as the company grows</div>\n<div>·<span style=\"font-size: 7pt;\">               </span>Work in a fun, flexible, casual environment with monthly Culture Club activities</div>\n<div>·<span style=\"font-size: 7pt;\">               </span>Workplace Flexibility - choice of working in the office, hybrid, or remote </div>\n<div>·<span style=\"font-size: 7pt;\">               </span>For those who chose to come into an office, we offer free gourmet coffee to fuel the brainpower necessary to conquer your goals, and free drinks and snacks.</div>\n<div><span style=\"font-size: 10.5pt;\"> </span></div>\n<div> </div>\n<div><span style=\"font-size: 10.5pt;\"> </span></div>\n<div><strong style=\"font-size: 10.5pt;\">Apply TODAY!</strong></div>\n<div><span style=\"font-size: 10.5pt;\"> </span></div>\n<div>Visa sponsorship is not available at this time.</div>\n<div> </div>\n<div><em>Quest Analytics provides equal employment opportunities to all people without regard to race, color, religion, sex, national origin, ancestry, marital status, veteran status, age, disability, sexual orientation or gender identity or expression or any other legally protected category.</em></div>\n<div> </div>\n<div><em>Applicants must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire.</em></div>\n"}, {"id": 931187, "url": "https://remotive.io/remote-jobs/qa/qa-automation-engineer-931187", "title": "QA Automation Engineer", "company_name": "Equip", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-23T21:41:47", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Equip is a virtual program helping families recover from eating disorders at home with comprehensive, gold-standard care created by experts in the field and people in recovery. Equip’s five-person care teams include dietitians, physicians, therapists, and mentors who deliver wrap-around support to provide families healing and lasting recovery.</p>\n<p>We created Equip to increase access to evidence-based treatment for all people affected by eating disorders. In line with this mission, we are committed to partnering closely with insurance companies and ensuring our team, patients, treatment, and brand reflect the diversity of those affected by eating disorders.</p>\n<p><strong>About the role:</strong></p>\n<p>We are looking for a QA Automation Engineer to help build our automation test suite through a period of rapid product and company growth. You’ll help us ship faster with confidence in the quality of Equip’s products helping to deliver sorely needed care to our rapidly growing base.</p>\n<p>Using your expertise in continuous integration with automated testing including front-end, API, and end-to-end testing, you’ll help shorten our cycle time from concept to production deploy with confidence in the quality of our features and services. Working closely with product managers, you’ll help clarify requirements as you derive test cases that you’ll use to build our automated testing suit as well as perform UAT for our releases.</p>\n<p> </p>\n<p><strong>What you will do:</strong></p>\n<ul>\n<li>Design and develop detailed, comprehensive and well-structured test plans and test cases</li>\n<li>Create end-end, functional, integration (API and UI) tests for complex business requirements</li>\n<li>Participate in Test Design Review meetings for test plans with focus on functional, business, complex scenarios, high impact projects and usability</li>\n<li>Work with engineers to promote TDD (test driven development) and assist as needed</li>\n<li>Collaborate with globally distributed team</li>\n<li>Monitor product or feature-level quality health metrics like testability, test health, test coverage, etc.</li>\n<li>Work closely with developers, testers, PO, and UX to ensure their features are delivered to meet business and quality requirements</li>\n<li>Test the limits of software at both the project and application level, data pipeline, including integration with related applications</li>\n<li>Create and track to RTM (requirements traceability matrix)</li>\n<li>Analyze and communicate test results and defect tracking</li>\n<li>Innovate best automation, agile and continuous testing practices</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>3+ years of experience in software engineering, quality assurance / engineering in web and web services</li>\n<li>Proficiency in Java, Java Script, Selenium WebDriver or similar programming languages.</li>\n<li>Experience working on GIT, Jenkins and on any other CI/CD tools.</li>\n<li>Proven testing experience in Web Services/ API endpoints</li>\n<li>Working knowledge of JSON, XML, HTML and DHTML</li>\n<li>Working knowledge on Postman, SoapUI or JMeter</li>\n<li>Strong knowledge of software QA methodologies, tools and processes</li>\n<li>A broad grasp of software QA approaches: automated front-end (UI) testing for SaaS products, back-end testing, unit/integration/system testing, black/white-box testing, coverage analysis, penetration testing, performance testing, cross-platform testing, QA reporting</li>\n<li>Experience in writing clear, concise and comprehensive test plans and test cases</li>\n<li>Experience with test management tools</li>\n<li>Hands-on experience with both white box and black box testing and automated testing tools</li>\n<li>Solid knowledge of SQL and scripting</li>\n<li>Experience with health care applications</li>\n<li>Excellent communication skills with clear emphasis on collaboration</li>\n<li>Strong problem-solving skills</li>\n</ul>\n<p><strong>Bonus if you have the following:</strong></p>\n<ul>\n<li>Bachelor's Degree (or its equivalent foreign degree) in Computer Science, Engineering or a relative field</li>\n<li>Good analytical skills, and exposure to Cloud and Web Applications</li>\n<li>Experience on HIPAA, HITRUST, or other high security environments</li>\n<li>Experience with Zephyr Scale, Zephyr Squad or similar Jira integrated frameworks</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>Competitive salaries and bonuses, flexible hours from home, flexible time-off, health benefits, career development opportunities, and exciting team retreats are among the myriad benefits you'll experience while working at Equip.</p>\n<p>Equip is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p>\n"}, {"id": 929413, "url": "https://remotive.io/remote-jobs/qa/quality-assurance-analyst-929413", "title": "Quality Assurance Analyst", "company_name": "MessageMedia", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-20T13:47:25", "candidate_required_location": "Philippines", "salary": "", "description": "<p>MessageMedia provides innovative mobile messaging solutions that help businesses of all sizes – from SMBs to enterprise-level – better connect with customers. With 90 percent of messages read within 90 seconds, MessageMedia drives business success by creating engaging mobile experiences that customers love. Our messaging solutions for alerts and notifications, billing and payments, appointment reminders, marketing, and staff scheduling are trusted by over 50,000 customers in industries such as healthcare, education, retail, and utilities. With offices across Australia, United States, United Kingdom, and New Zealand, MessageMedia is the number one choice for easy and engaging business messaging.</p>\n<p>MessageMedia has a solid track record in the market and are looking to expand their technology team here in the Philippines. They are currently assembling their pioneering team of developers and they are in search of a passionate, skillful, and self-motivated Software Assurance Analyst.</p>\n<p>This is an amazing career opportunity for someone who dreams to work on an exciting and innovative platform in a vibrant and highly collaborative working environment. This is the perfect career move for someone who is looking for career growth and skills enhancements by being exposed to a highly diversified and collaborative technical team.</p>\n<p>In a nutshell, as a Quality Assurance Analyst you will plan, develop and execute quality tests across their respective technology platform/s to ensure that delivered software meets the acceptance criteria, business objectives and customer needs.</p>\n<p>MessageMedia are looking to recruit a Quality Assurance Analyst to work remotely from the Philippines. Reporting to the Development Manager, located in Australia, key responsibilities of the QA Analyst will include the following:</p>\n<ul>\n<li>Participation in stand-ups, grooming, story kick-offs with team</li>\n<li>Configuration/setup of test environments, stacks, data</li>\n<li>Manual testing of functionality as described in requirements/acceptance criteria</li>\n<li>Creation and execution of automated tests using frameworks or tools</li>\n<li>Analysis, investigation and documentation of test failures or other issues</li>\n<li>For projects/larger releases, create and execute test plans, clearly documenting results</li>\n</ul>\n<p>The successful candidate will need to have:</p>\n<ul>\n<li>Bachelor's Degree in Information Technology, Computer Science and other related field is preferred but not required</li>\n<li>Deep understanding of software testing, concepts, and processes</li>\n<li>3 to 5 years of experience in manual testing and at least 1 year of QA automation testing</li>\n<li>At least 1 year of experience in testing APIs using Postman or similar</li>\n<li>Ability to analyze, investigate and document issues</li>\n<li>Test requirement analysis, test design, test plan and documentation</li>\n<li>Excellent verbal and written English communication skills</li>\n<li>Ability to work independently with minimal guidance</li>\n<li>Ability to work collaboratively with cross-functional and virtual teams.</li>\n<li>Working laptop or desktop and stable internet connection</li>\n</ul>\n<p>Advantageous skills or nice-to-haves:</p>\n<ul>\n<li>Experience with CRM/ERP software such as SalesForce or NetSuite</li>\n<li>Good working knowledge of AWS</li>\n<li>Experience with testing frameworks such as Cucumber, Selenium or similar.</li>\n<li>Knowledge of NodeJS, Java or similar</li>\n<li>Experience with a CI/CD environment</li>\n</ul>\n<p>If interested in this opportunity, please apply now by sending us a link to your resume or cv.</p>\n"}, {"id": 921734, "url": "https://remotive.io/remote-jobs/qa/quality-assurance-implementation-specialist-921734", "title": "Quality Assurance Implementation Specialist", "company_name": "Castoredc", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-14T09:48:03", "candidate_required_location": "Anywhere", "salary": "", "description": "<p><strong>Who is Castor? </strong></p>\n<p dir=\"ltr\">Castor is a leading cloud-based clinical data platform working with some of the world’s largest pharmaceutical and medical device companies, as well as renowned academic and research institutes like the World Health Organization.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">We simplify the clinical trial process, from recruitment to analysis, with user-friendly, patient-centric technology. Our mission is to bring medical research into the digital age. Why? Because medical research is still largely run using free-text, paper, and legacy technology.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">Our self-service platform enables our users to run remote (decentralized), device-enabled, patient-centric trials. By helping our users capture high-quality data and making it machine-readable, we are fundamentally changing the flawed evidence-based medicine process.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><strong>How is Castor supporting the Coronavirus crisis?</strong></p>\n<p dir=\"ltr\">Castor has joined the global fight against the Coronavirus by making our research data capture system available for free for all COVID-19 research projects. Castor is supporting more than 200 COVID-19 studies across the world, including the World Health Organization’s <a href=\"https://news.un.org/en/story/2020/03/1059722\" rel=\"nofollow\">SOLIDARITY trial</a>.</p>\n<p dir=\"ltr\"><strong>What you’ll do</strong></p>\n<p dir=\"ltr\">As a Quality Assurance Implementation Specialist (QAIS) you will be responsible for ensuring the highest level of quality is achieved for every customer’s software implementation and configuration project, including:</p>\n<p> </p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Develop and maintain the quality assurance testing processes and procedures which are needed for customer project validation;</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Apply risk-based testing to projects and create summary reports for delivery back to the implementation teams;</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Analyze test execution reports, assist in recreating issues, and record defects for tracking purposes;</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Assess and implement a new automation tool and create an innovative automated test system.</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>What you’ll bring</strong></p>\n<p dir=\"ltr\">You will have experience in software quality assurance testing, as well as the ability to create implementation test processes and contribute to their continued improvement;</p>\n<p dir=\"ltr\"> </p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">You will have experience in an automated test environment;</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Be a technical expert including fluency in one or more popular programming languages;</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Knowledge of test/defect management tools (i.e., Jira)</p>\n</li>\n</ul>\n<p><strong>What you’ll learn</strong></p>\n<p>It’s a crucial time for Castor. We’re on ‘full power mode’ and scaling-up at an exponential rate. For you, the opportunities are endless:</p>\n<p> </p>\n<ul>\n<li>The opportunity to work with an international and diverse team, who are extremely passionate to help researchers achieve their goals and you better believe that we will!</li>\n<li>The chance to be involved in maximizing the impact of medical research and improving healthcare.</li>\n</ul>\n<p> </p>\n<p><strong>What you'll get </strong></p>\n<p>At Castor we truly live and breathe our core values, believing we can achieve anything with a healthy and happy team.' With this in mind, we offer the following benefits:</p>\n<p> </p>\n<ul>\n<li>A flexible and remote working opportunity</li>\n<li>A competitive salary and a guaranteed 'happy holidays' bonus</li>\n<li>Investing in our talent with a strong Employee Stock Option Plan</li>\n<li>Up to 30 days annual leave (plus national holiday days)</li>\n<li>Interested in ‘lifelong learning’? You’ll love using our development and training budget</li>\n<li>Flexible approach to working - nobody is tracking your time</li>\n<li>A MacBook or Dell laptop, we’re a tech start-up after all ;)</li>\n<li>Like to feel zen? You’ll love our company subscription to Calm for meditation and yoga</li>\n</ul>\n<p> </p>\n<p>Want to know more? Check out the <a href=\"https://recruitee-main.s3.eu-central-1.amazonaws.com/uploads/wrddhclcs7/Quality_Assurance_Implementation_Specialist_role_profile.pdf\" rel=\"nofollow\">role profile</a> for some further insights or apply now!</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Castor continues to grow as an Equal Opportunities Employer. We strongly encourage applications from women, people of colour, and people from the LGBTQ(+) community. In your application, please feel free to share the pronouns you use (for example, she/her/hers, he/him/his, they/them/theirs, etc.).</p>\n"}, {"id": 911956, "url": "https://remotive.io/remote-jobs/qa/sr-qa-engineer-911956", "title": "Sr. QA Engineer", "company_name": "ETIQA SRL", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-09T21:44:15", "candidate_required_location": "Europe Only", "salary": "", "description": "<p>Are you totally obsessed with quality and improvement? Do you find yourself fighting for days on linter settings, design patterns, process optimizations and you only have one rule: “Never give up first”?</p>\n<p>Do you ask hundreds of questions until people around you just surrender and ask for forgiveness?</p>\n<p>Do you see something others cannot just see, a balance in the Force that shows you the right way of doing things? </p>\n<p>Then you might be the person we are looking for!</p>\n<p><strong>Skill requirements</strong></p>\n<ul>\n<li>8+ years of software testing experience.</li>\n<li>Experience in both manual and automation testing.</li>\n<li>Experience in Unit Testing, Component Testing, Integration Testing, and E2E testing.</li>\n<li>Experience in System Integrity Testing, Data Integrity Testing, Stress Testing, Capacity Testing, Endurance Testing, Reliability and Failover/Recovery Testing.</li>\n<li>Experience in REST API and Web application testing using tools such as Postman, Ghost Inspector, BrowserStack, Selenium, or similar software. </li>\n<li>Experience in branching and code merge to custom needs of the development team using GitHub.</li>\n<li>Ability to handle a fast-paced environment for iterative projects with Agile development methodologies such as Scrum.</li>\n<li>Provide oversight and direction for the QA strategy and process.</li>\n<li>Must be able to communicate effectively with users, executives, and senior leaders at all levels.</li>\n<li>Experience working with JIRA and Confluence or a comparable issue tracking tool</li>\n<li>Successfully deliver in a deadline-driven highly regulated environment.</li>\n<li>Experience with TestRail.</li>\n<li>Familiarity with CI/CD environments.</li>\n<li>Experience in Insutech is a plus but is not required.</li>\n</ul>\n<p>Benefits:</p>\n<ul>\n<li>Permanent contract (with full remote option)</li>\n<li>Competitive salary</li>\n<li>International environment</li>\n<li>Ticket restaurants</li>\n<li>MacBook Pro </li>\n<li>Continuous training</li>\n<li>Free English course</li>\n</ul>\n<p> </p>\n"}, {"id": 910851, "url": "https://remotive.io/remote-jobs/qa/qa-engineer-910851", "title": "QA Engineer", "company_name": "INDG", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-08T17:47:58", "candidate_required_location": "Europe Only", "salary": "", "description": "<p><strong>About INDG</strong></p>\n<p>At INDG we develop technology that enables engaging, hyper-realistic digital product experiences. Our goal is to make \"every product playable\", by combining the science of technology with the artistry of computer-generated content. Our offices are in Amsterdam, Bucharest and New York. Clients include Adidas, Yamaha, Ralph Lauren, Electrolux, and Philips.</p>\n<p> </p>\n<p>Our CG artists, interactive designers, and developers focus on creating virtual versions of our clients' products, so lifelike it feels like you could reach out and touch them. Our culture brings together creative, tech and business individuals. It’s a heady cocktail that keeps us inspired, empowered and passionate.</p>\n<p> </p>\n<p><strong>What’s Grip?</strong></p>\n<p>Grip supports brands to cope with the fast-accelerating challenge of the exponential grow and need for content. Grip is web-based software that automatically generates visual content. It’s based on photorealistic 3D, capitalising on INDG’s twenty-year-long experience in that field. 3D is good because once your beer or your juicer or your rocket is on Grip, it can be used and re-used for multiple media: images, videos, iOS apps, and such.<br> </p>\n<p><strong>Responsibilities</strong></p>\n<p>• Create and maintain scalable test automation frameworks,</p>\n<p>• Integrate auto tests in CI/CD pipelines,</p>\n<p>• Review and test project documentation (specifications, designs etc.),</p>\n<p>• Create and support test documentation (test plans, suites, cases, check-list, test data),</p>\n<p>• Perform functional and non-functional testing,</p>\n<p>• Defects management and monitoring,</p>\n<p>• Test process improvement and implementation.</p>\n<p> </p>\n<p><strong>Mandatory</strong></p>\n<p>• At least 3 years of experience on similar role,</p>\n<p>• Solid knowledge of test theory and SDLC,</p>\n<p>• Strong skills in test design, test documentation creation and support,</p>\n<p>• Hands on experience (both, manual and automation) in: - UI testing (Web) - API testing,</p>\n<p>• Test automation of Web applications: - Protractor/Selenium WebDriver - Page object - Cucumber, Mocha, xUnit - TypeScript /  C#,</p>\n<p>• English at least intermediate level (able to communicate verbal and written).</p>\n<p> </p>\n<p><strong>Nice to have</strong></p>\n<p>• Experience in load testing,</p>\n<p>• Experience with CI/C.</p>\n<p> </p>\n<p>This is a remote-friendly position.</p>\n"}, {"id": 905772, "url": "https://remotive.io/remote-jobs/qa/qa-engineer-905772", "title": "QA Engineer", "company_name": "Maple-finance", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-05T21:48:56", "candidate_required_location": "Europe or Asia", "salary": "", "description": "<div><strong>About Maple</strong></div>\n<div>Maple is the next evolution of DeFi protocols creating an institutional capital marketplace. Premium crypto institutions borrow from Lending Pools funded by the DeFi ecosystem transparently and efficiently. The protocol is governed by the Maple Token (MPL), which was successfully launched in May.</div>\n<div> </div>\n<div>Join our world class team, backed by some of the leading Venture Capitalists in the space including Framework Ventures, Polychain Capital, Alameda Research, One Block, Aave CEO - Stani Kulechov and Synthetix Founder - Kain Warwick.</div>\n<div> </div>\n<div>Together we'll embark on a mission to power the capital markets of the future - efficient, permissionless and global.</div>\n<div> </div>\n<div><strong style=\"font-size: 18px;\">Competitive Salary + Token Allocation | Full Time | Contract | Remote anywhere in Europe or Asia</strong></div>\n<div> </div>\n<div><strong style=\"font-size: 11pt;\">Role</strong></div>\n<div><span style=\"font-size: 11pt;\">We are looking for an experienced Quality Assurance Analyst that has a passion for high quality software applications and user experience. As a QA Analyst at Maple, you will be assisting with release testing, bug hunting and Business Functionality Testing. As well as designing, implementing and improving end-2-end automation processes.</span></div>\n<div> </div>\n<div><span style=\"font-size: 11pt;\">You will have a significant impact on bringing exciting new features to the Maple marketplace and its Users. Your critical assessments will shape these new features and maintain the standard of software excellence our first class engineering team strives for.</span></div>\n<div> </div>\n<div><strong style=\"font-size: 11pt;\">The Opportunity</strong></div>\n<div><span style=\"font-size: 11pt;\">This is the first QA role we have hired. Being a start up in growth mode, we all wear a lot of hats and the elements of this function have been covered by the engineering team collectively so far. We are at a stage, where, to operate at the level of excellence Maple strives for, a dedicated QA is paramount. Whomever joins us to perform this role has great scope to define and shape the way this function is executed. </span></div>\n<div> </div>\n<div><span style=\"font-size: 11pt;\">You will report in to one of our two world class Engineering Leads (previously at MakerDAO and Horangi, respectively), work closely with and have the support of, Maple’s Senior Product Manager (previously at Google and Ripple), Senior DevOps Engineer (previously JP Morgan) and of course the rest of the Maple team, who boast a similar pedigree of backgrounds and experience. You will have the enviable opportunity to work with, learn from and mentor the best and the brightest people in the most exciting FinTech space there is today - DeFi!</span></div>\n<p><br><br></p>\n<div class=\"h3\">Responsibilities</div>\n<ul>\n<li>End to end test automation</li>\n</ul>\n<ul>\n<li>Managing Bug Bounty and Security Audit programs</li>\n</ul>\n<ul>\n<li>UI/UX product based testing (i.e. using an app)</li>\n</ul>\n<ul>\n<li>Security and Vulnerability auditing</li>\n</ul>\n<ul>\n<li>Load and performance testing</li>\n</ul>\n<ul>\n<li>Creating and managing testing strategies</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Requirements</div>\n<ul>\n<li>5 years of professional development  experience</li>\n</ul>\n<ul>\n<li>Expert level TypeScript language fluency</li>\n</ul>\n<ul>\n<li>3+ year's experience as a QA in a FinTech environment</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Really Nice if you have it</div>\n<ul>\n<li>Web3 and Ethereum Knowledge</li>\n</ul>\n<ul>\n<li>Successful experience in a high performing start up environment</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Our Tech Stack</div>\n<ul>\n<li><strong>All:</strong></li>\n</ul>\n<ul>\n<li>TypeScript</li>\n</ul>\n<ul>\n<li>NodeJS</li>\n</ul>\n<ul>\n<li><a class=\"postings-link\" href=\"http://ethers.js/\" rel=\"nofollow\">Ethers.js</a></li>\n</ul>\n<ul>\n<li>Hardhat</li>\n</ul>\n<ul>\n<li>Docker</li>\n</ul>\n<ul>\n<li>Solidity</li>\n</ul>\n<div> </div>\n<ul>\n<li><strong>Frontend:</strong></li>\n</ul>\n<ul>\n<li>React</li>\n</ul>\n<div> </div>\n<ul>\n<li><strong>Backend:</strong></li>\n</ul>\n<ul>\n<li>Graph Protocol</li>\n</ul>\n<ul>\n<li>GraphQL</li>\n</ul>\n<div> </div>\n<ul>\n<li><strong>Devops:</strong></li>\n</ul>\n<ul>\n<li>Terraform</li>\n</ul>\n<ul>\n<li>Bash</li>\n</ul>\n<ul>\n<li>GCP/AWS</li>\n</ul>\n<div>With our current two lending pools being well on their way to reaching the $200M point collectively, and further pools imminent, now is the time to join the most exciting project in DeFi. If you subscribe to the values of Maple - Personal Ownership, Focused Execution, User Prioritisation, Innovative Mindset - and want to be part of a collaborative culture focused on bringing Global Finance into the future, then we want to hear from you!</div>\n<div> </div>\n<div>We look forward to receiving your application and will be in touch after having a chance to review. </div>\n<div> </div>\n<div>In the meantime, here are some links to more information about Maple to help you check us out:</div>\n<div><a class=\"postings-link\" href=\"https://www.maple.finance/\" rel=\"nofollow\">https://www.maple.finance/</a></div>\n<div><a class=\"postings-link\" href=\"https://maplefinance.gitbook.io/maple/\" rel=\"nofollow\">https://maplefinance.gitbook.io/maple/</a></div>\n<div><a class=\"postings-link\" href=\"https://github.com/maple-labs\" rel=\"nofollow\">https://github.com/maple-labs</a></div>\n<div><a class=\"postings-link\" href=\"https://twitter.com/maplefinance?s=11\" rel=\"nofollow\">https://twitter.com/maplefinance?s=11</a></div>\n<div><a class=\"postings-link\" href=\"https://discord.com/invite/9WdQHNp9Ja\" rel=\"nofollow\">https://discord.com/invite/9WdQHNp9Ja</a></div>\n"}, {"id": 904454, "url": "https://remotive.io/remote-jobs/qa/software-developer-engineer-in-test-user-management-904454", "title": "Software Developer Engineer in Test - User Management", "company_name": "Otus", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-10-03T17:51:34", "candidate_required_location": "USA Only", "salary": "", "description": "<p><span style=\"font-weight: 400;\">Otus is creating a culture of success while maximizing learning in the K-12 space. We do this by implementing amazing ideas from awesome people and we need more awesomeness on our team. Are you passionate, collaborative, love to geek out on technology, and want to work for a mission-driven company that is shaping the way teachers, students and parents of students learn together? If so, we want to hear from you. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Our diverse team consists of talented designers, developers, coaches, and leaders who share a variety of interests. You'll find musicians, world travelers, beer enthusiasts, nerds, sports fans, and all-around great people who shape our positive culture.</span></p>\n<p> </p>\n<div class=\"h3\"><strong>Your Role</strong></div>\n<p><span style=\"font-weight: 400;\">We are looking for a talented and highly motivated Software Developer Engineer in Test with experience full stack testing web applications to be a member of our User Management product team in order to help bring the best possible software solution to educators.</span></p>\n<p><span style=\"font-weight: 400;\">As an early member of a growing team, you must possess a strong work ethic and be upbeat, driven, intelligent, well-organized, articulate, share a passion for learning new technology, and thrive in a fun, fast-paced environment.</span></p>\n<p><span style=\"font-weight: 400;\">You will have the opportunity to immediately contribute and see the results of your work in use by students, teachers, parents and district administrators across the country. This position reports to our Director of Quality Assurance.</span></p>\n<div class=\"h3\"><strong>Responsibilities</strong></div>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Participate and contribute to all QA team deliverables which include; test strategy, test planning, manual test development, test automation, design reviews and defect triage.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Work closely with developers to review unit, integration and functional tests to ensure proper test coverage through pull requests</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Determine the proper test strategy for manual and automated testing for new functionality based upon analyzing and decomposing project plan design and requirements.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Investigate, debug and reproduce district reported field issues, using logs and database queries, validating the fixes when ready, perform escaped defect analysis where necessary</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Groom, execute and complete QA work items to align with development work items.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Participate in Otus application delivery team application release deliveries where needed</span></li>\n</ul>\n<div class=\"h3\"><strong>Required Qualifications</strong></div>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">3+ years experience of software testing/development</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experience in web application test development writing automated tests with the following technologies; Java, TestNG, Javascript and NestJS</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experience in testing web application backend development and 3rd party integrations and their interaction within the application</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Demonstrated experience testing applications with the following technologies; SQL, Angular/React, GraphQL, Javascript and Typescript</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Demonstrated ability to review logs and perform database queries using technologies such as; Elasticsearch, Grafana, MySQL Workbench</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Demonstrated ability to solve complex technical issues through analysis and a variety of problem solving techniques</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Strong understanding of SDLC and software testing methodologies that contribute to the release of quality software</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Ability to work in a self organizing team, working on your own daily tasks in a fast paced environment</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Highly motivated, passionate, and self-driven</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Value iterative progress over perfection</span></li>\n</ul>\n<div class=\"h3\"><strong>Nice to Haves</strong></div>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Knowledge of CI/CD process, in the particular area of build &amp; deployment tools in a Kubernetes and Docker environment</span></li>\n</ul>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experience developing and performing application security testing</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Demonstrable experience performing data warehouse testing and verifying data integrity</span></li>\n</ul>\n<div class=\"h3\"><strong style=\"font-size: 13px;\">Benefits and Perks</strong></div>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Competitive salary and stock options </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">20 PTO days a year, plus a day off for your birthday (or a loved one), an interest day (to do something you love) and paid holidays  </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Up to 12 weeks of parental leave, and great work/life balance</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Flexible hours and work from home policy so you can be at your most productive</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Excellent medical, dental, and vision insurance</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Life Insurance and disability benefits</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">401K with an employer match (up to 4%)</span></li>\n</ul>\n<p><strong>Otus is an Equal Opportunity Employer and embraces diversity of every kind. </strong><span style=\"font-weight: 400;\">You must be legally authorized to work in the US. Unfortunately, the company is unable to support sponsorships at this time. </span></p>\n<p> </p>\n"}, {"id": 904535, "url": "https://remotive.io/remote-jobs/qa/manual-qa-engineer-904535", "title": "Manual QA Engineer", "company_name": "Docler Holding", "category": "QA", "tags": [], "job_type": "contract", "publication_date": "2021-09-30T10:11:22", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h3\">Company Description</div>\n<p><strong>Unique, exciting, fun-loving, and fast-growing</strong> – Welcome to Docler Holding! Since launching in 2001, we have created products and experiences that entertain millions of people across the globe. We now serve more than 50 million users a day and are consistently among the top visited websites in the world with following in the millions!</p>\n<p><strong>Some of our top-ranking websites include:</strong></p>\n<ul>\n<li><strong>Livejasmin.com</strong>, a market leader in the live streaming industry</li>\n<li><strong>Jasmin.com</strong>, a platform that helps people make authentic connections</li>\n<li><strong>Oranum.com</strong>, a pioneer in the online esoteric space and the world’s biggest live esoteric site</li>\n<li><strong>BeMyFan.com</strong>, a link sharing tool that helps influencers connect with their fans</li>\n<li><strong>Bimbim.com</strong>, an innovative, mobile -focused platform for content creators</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong>With us, you will...</strong></p>\n<ul>\n<li>Carry out full range of software testing activities (functional, structural, manual, automated tests)</li>\n<li>Design, develop, run and improve automated tests</li>\n<li>Possibility to work with multiple technologies: C++, PHP, Flash, JavaScript, Selenium</li>\n<li>Assist developers with reproducing and debugging problems</li>\n<li>Participate in Requirement and Functional Specification reviews of new features to convert them to comprehensive Test Specifications</li>\n<li>Document, troubleshoot and follow-up on issues found during testing</li>\n<li>Report, prioritize, track, and manage deficiencies</li>\n<li>Mentor other testers</li>\n<li>Work closely together with developers</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<p><strong>What we expect from you...</strong></p>\n<ul>\n<li>MSC or BSC in Information Technology or equivalent experience</li>\n<li>4+ years of experience in Software QA</li>\n<li>Should be familiar with desktop application testing on Windows</li>\n<li>Experience with Manual testing</li>\n<li>Basic knowledge about JIRA</li>\n<li>Really good knowledge about the JasminCam desktop application</li>\n<li>Good communication skills</li>\n<li>Excellent team player attitude</li>\n<li>Should be able to handle the monotonous work</li>\n</ul>\n<p><strong>We'd love meet someone with...</strong></p>\n<ul>\n<li>Know the major release steps</li>\n<li>Agile/Scrum knowledge</li>\n<li>Experience with the different testing methodologies and the qTest</li>\n<li>Some development processes knowledge</li>\n<li>Extra point if the candidate know the desktop application testing on Mac OS, Linux</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p><strong>In return you will get...</strong></p>\n<ul>\n<li>The opportunity to have huge and amazing influence, in what we know will be a career-defining role</li>\n<li>The skills and experience you bring add to our collective strength</li>\n<li>Full accountability to manage your own working hours as well as the opportunity to work remotely</li>\n<li>A fun, friendly and collaborative work culture where we guarantee there is never a dull day.</li>\n</ul>\n<p><strong><strong>Due to the global pandemic situation we are looking for professionals who are willing to work remotely, on contract base, full-time, based in the USA, especially in the East-Coast part.</strong></strong></p>\n<p>Docler Group is an equal employment opportunity employer. We consider individuals for employment based on their skills, abilities and experience. We thrive to attract and hire a strong, talented and diverse workforce, prohibiting discrimination based on race, color, religious or political beliefs, age, nationality, physical, mental or developmental disability, gender, sexual orientation.</p>\n<p><strong>DISCLAIMER:</strong> This job description is a summary of the primary duties and responsibilities of the job and position. It is not intended to be a comprehensive or all-inclusive listing of duties and responsibilities. Contents are subject to change at management's discretion. </p>\n<p><strong>NOTE: </strong>Docler Group does not accept unsolicited resumes from agencies. We consider any resume (CV) or biography received from an agency without prior approval from our Legal and Recruiting Department to be unsolicited, and such submissions will not be recognized for purposes of “ownership” of the candidate.</p>\n<p><strong>We are in it for the long haul so your future is safe with us.<br>We are always on the lookout for fresh talent to join our #doclersquad!</strong></p>\n"}, {"id": 900675, "url": "https://remotive.io/remote-jobs/qa/qa-engineer-m-w-x-900675", "title": "QA Engineer (m/w/x)", "company_name": "Styla", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-09-25T17:54:17", "candidate_required_location": "Europe Only", "salary": "", "description": "<p dir=\"ltr\">With our Styla team of about 40 employees, we are changing how brands and retailers are able to interact with their customers digitally. Our technology allows stores to run a decoupled store-frontend on top of their headless shopsystem with subsecond loading time and unprecedented stability thanks to a Jamstack technology, with automatic ad-hoc generation of product-pages as well as category-pages and a progressive web app, so that stores will be able to deliver cutting edge experiences on the most modern frontend infrastructure as a service. Our customers include companies such as Henkel, FootLocker, General Electric, OTTO, Thomas Sabo and many more.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">We are looking for a QA Engineer who will be the quality guardian of our IT department.</p>\n<p><br><br></p>\n<p dir=\"ltr\">Challenges you will solve:</p>\n<p> </p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">You become part of one of our core teams and focus on further improving our highly successful automatic design technology.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Be the quality guardian of the team.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Help your team to define user stories with particular attention to acceptance criteria.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Play the role of QA mentor and assist developers in writing their own tests</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Define, plan, and execute tests according to the priorities defined with the team.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Apply quality engineering principles throughout the Agile product lifecycle.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Provide support and documentation.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Work on improving the continuous integration pipeline.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Integrate or build new tools and frameworks to improve and automate QA and development processes even further.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Collaborate with your colleagues on improvements to common practices/tools/processes, and share knowledge and experience.</p>\n</li>\n</ul>\n<p dir=\"ltr\">What you bring with you:</p>\n<p> </p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">At least 5 years of experience in a comparable position.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Understanding of the modern testing and delivering approaches (unit tests, automated tests, TDD, load testing, continuous integration, etc.).</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Experience with CI tools.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Knowledge of quality assurance methodology, tools, and processes in an agile setup.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Knowledge of quality metrics gathering and presentation.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">You are eager to learn and use new technologies and want to contribute your ideas.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Nice to have: You have experience in Fullstack-Development or either in Frontend or Backend. Ideally, you have in-depth knowledge with at least one modern frontend technology and have had a past need to actively implement an end to end testing suite validating the functionality of your code.</p>\n</li>\n</ul>\n<p><br><br></p>\n<p dir=\"ltr\">What we offer:</p>\n<p dir=\"ltr\"> </p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Career opportunity in a fast growing international company.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Use 10% of your time on self-guided projects of your choice related to work.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Working in an entrepreneurial and dynamic work environment of international professionals and experienced founders.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Company events twice a year, quarterly Hack Days / Team Events (currently as digital events).</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Budgets for further education and conferences.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Apple working equipment (if you like) and freedom to choose the tools you want to use.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Flexible working hours, remote working possibility (also after Covid-19) and an appealing salary.</p>\n</li>\n</ul>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">If you are interested in this position, you’re welcome to contact our People and Culture Team directly for more information!</p>\n<p> </p>\n"}, {"id": 896531, "url": "https://remotive.io/remote-jobs/qa/software-development-engineer-in-test-896531", "title": "Software Development Engineer in Test", "company_name": "Testery", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-09-17T21:52:09", "candidate_required_location": "USA Only", "salary": "", "description": "<p>The Testery Professional Services team helps our clients get a jump start on start automation. We do this by setting up CI/CD to run tests, configuring testing frameworks, providing coaching and training, etc. Typical projects include setting up test automation from scratch, converting legacy frameworks to modern frameworks, and getting larger test suites to run more quickly and reliably. Our clients include organizations from startups to Fortune 500.</p>\n<p>As a Software Development Engineer in Test on the Testery Professional Services team, you will help our clients organize their teams to do test automation, provide the training they need to be successful, implement automated tests, set up CI/CD configurations, and build pipelines.<br><br><strong>Location: </strong>US-based, Remote<br><br><strong>Responsibilities</strong></p>\n<ul>\n<li>Write automated tests for multiple clients with varying tech stacks.</li>\n<li>Interface with clients in regular check-ins and throughout the sprint using Slack.</li>\n<li>Coach clients on all aspects of automated testing in the Software Development Life-Cycle.</li>\n<li>Research and development of test automation and continuous integration.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>Two or more years of experience writing test automation.</li>\n<li>One of more years experience with Cucumber, BDD, or SpecFlow.</li>\n<li>Any two of the following: C#, Java, JavaScript, Python, TypeScript</li>\n</ul>\n<p><strong>Keywords: </strong>Cucumber, BDD, Unit Test, End-to-End Test, Test Automation, Selenium, CI, CD</p>\n<p> </p>\n"}, {"id": 890942, "url": "https://remotive.io/remote-jobs/qa/qa-engineer-redtrack-890942", "title": "QA Engineer (RedTrack)", "company_name": "Genesis", "category": "QA", "tags": [], "job_type": "", "publication_date": "2021-09-14T02:21:48", "candidate_required_location": "Anywhere", "salary": "", "description": "<p><strong><a href=\"https://gen.tech/\" rel=\"nofollow\">Genesis</a> - </strong>is a full-service international IT company. More than 1,500 people in five countries create products for more than 200 million unique monthly users. We are one of the largest partners of Facebook, Google, Snapchat, and Apple in Eastern Europe. Our ecosystem consists of more than 15 companies and a venture capital fund.</p>\n<p><a href=\"http://flyerone.vc\" rel=\"nofollow\">Flyer One Ventures</a> is a venture capital fund made by entrepreneurs with an unparalleled track record and practical experience in building large international digital businesses from Ukraine. We invest in seed-stage startups founded by exceptional founders from Central Eastern Europe. In addition to financial investment, we provide a wide range of practical support activities in business building and fundraising from the Investment Team.</p>\n<p>Currently, we are looking for a full-time remote <strong>Q</strong><strong>A Engineer</strong><strong> </strong>for external (non-Genesis) product company — <a href=\"https://redtrack.io/\" rel=\"nofollow\">RedTrack.io</a></p>\n<p><a href=\"https://redtrack.io/\" rel=\"nofollow\">RedTrack.io</a> - ad tracking and conversion attribution platform. We started RedTrack in 2017 to make it easy for media buyers to consolidate and report data. While that principle still lies on the basis of our business, it has transformed into our core value to solve growth-related challenges in media-buying through sophisticated technology and human assistance. Today, our team works in 5 countries and engages with customers from 107 countries daily.</p>\n<p>RedTrack takes their people as a source of success. Encourages and helps them to grow within a company. Values proactive and ambitious individuals, and provides a lot of freedom to carry out their ideas.</p>\n<p><strong>Who we are looking for:</strong></p>\n<ul>\n<li>Commercial experience at least 2+ years;</li>\n<li>Experience in QA process;</li>\n<li>Test cases;</li>\n<li>Issue tracking.</li>\n</ul>\n<p><strong>Bonus hard skills:</strong></p>\n<ul>\n<li>Experience with Selenium, JavaScript, API testing.</li>\n</ul>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Respond to bug reports by support team: confirm, create tickets</li>\n<li>Implement and maintain automatic testing;</li>\n<li>Test new features before release.</li>\n</ul>\n<p><strong>RedTrack provide:</strong></p>\n<ul>\n<li>Both vertical and horizontal growth from current position, it really depends on your aspirtion and goals.</li>\n<li>Ability to work remotely or in a coworking space.</li>\n<li>Flexible working hours.</li>\n<li>Paid sick leaves and vacation.</li>\n<li>Equipment for work.</li>\n</ul>\n<p><strong>Join our team!</strong></p>\n"}, {"id": 882251, "url": "https://remotive.io/remote-jobs/qa/qa-engineer-882251", "title": "QA engineer", "company_name": "AppFollow", "category": "QA", "tags": [], "job_type": "full_time", "publication_date": "2021-09-08T06:25:58", "candidate_required_location": "Europe Only", "salary": "", "description": "<p><strong>AppFollow</strong> is an App Monitoring, App Store Optimization, and Customer Support platform.</p>\n<p>Our primary goal is to simplify the everyday routines of app developers, product managers, <span class=\"chrome-extension-FindManyStrings chrome-extension-FindManyStrings-style-11 CE-FMS-marketing\">marketing</span> teams, customer support, etc. AppFollow helps you gather and manage your apps and games data, increase app average rating, improve app store rankings, and app user loyalty.</p>\n<p>This is a fully remote opportunity for the <strong>Quality assurance specialist</strong> to build an effective quality assurance process together with the team in order to help companies worldwide grow their business using AppFollow.</p>\n<p> </p>\n<p><strong>Your activities will include:</strong></p>\n<ul>\n<li>Participate in problem-solving sessions and polish quality assurance process together with the team</li>\n<li>Conduct manual testing of API and UI using various methods (functional, regression, integration)</li>\n<li>Create and maintain test documentation</li>\n<li>Help a team prepare and write autotests (API, UI, Load &amp; Performance)</li>\n</ul>\n<p><strong>Benefits we offer</strong></p>\n<ul>\n<li>Full-time remote job. Though you’re always welcome to spend time with us in our office in Helsinki. Or to meet in a co-working with the colleagues who live in the same location as you</li>\n<li>Quarterly and annual bonuses based on achieving KPIs and your personal performance and extra efforts</li>\n<li>35 days of paid vacation. Take the time you need to stay charged. By prior agreement, you can have days off for special occasions, we are pretty flexible here</li>\n<li>Paid corporate meet-ups. We get together twice a year at various locations (St. Petersburg, Moscow, Helsinki, Riga, etc.) to work and spend time together offline. We bear all the travel costs for your accommodation, flights, lodging, and other business travel expenses</li>\n<li>We compensate 50% of all of your education costs, including English courses</li>\n<li>Health insurance</li>\n<li>You’ll have executive-level visibility into how the company is running and performing</li>\n<li>We’re always ready to provide dedicated support and fast-track your on-boarding, give you the tools you need to be successful</li>\n</ul>\n<ul>\n<li>3+ years of manual testing with strong expertise in applying different types of testing</li>\n<li>1+ years of autotests, preferably using Java+ Junit5 + Selenide + Selenoid and <span class=\"chrome-extension-FindManyStrings chrome-extension-FindManyStrings-style-5 CE-FMS-rest\">Rest</span> Assured API</li>\n<li>Deep understanding of software development process from a testing perspective, microservice architecture is a plus</li>\n<li>Basic knowledge SQL</li>\n<li>Experience with CI/CD is a plus</li>\n</ul>\n"}]}