{"0-legal-notice": "Legal warning - Hey, thanks for using Remotive's API, we appreciate it! Please note that API documentation and access is granted so that developers can share our jobs further. Please do not submit Remotive jobs to third Party websites, including but not limited to: Jooble, Neuvoo, Google Jobs, LinkedIn Jobs. Please link back to the URL found on Remotive AND mention Remotive as a source in order to Remotive to get traffic from your listing. If you don't do that, we'll terminate your API access, sorry! Jobs displayed are delayed by 24 hours, the goal being that jobs are attributed to Remotive on various platforms. Displaying our jobs in order to collect signups/email addresses to show a listing constitutes a breach of our terms of services. We offer a private, paid-for API, please email us at hello(at)remotive(dot)io for more information (starting budget is $5k/mo). Please find out terms of services on https://remotive.io/api-documentation. Please note that there is absolutely no need to request Remotive Job data too frequently. Typically, you only need to GET Remotive job data through this API a couple of times a day (we advise max. 4 times a day). Our data is not changing much faster than that anyway. Note that excessive requests will be blocked. Many thanks (Rodolphe & the Remotive team!)", "job-count": 50, "jobs": [{"id": 978037, "url": "https://remotive.io/remote-jobs/writing/content-manager-978037", "title": "Content Manager", "company_name": "Hunter", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-12-04T08:08:08", "candidate_required_location": "Europe", "salary": "", "description": "<br><p>Hunter's marketing team is hiring a Content Manager! You'll have critical responsibilities in Hunter's communication on the blog, social media, and elsewhere on the web. </p><br><p>This is the first time we hire for this role, so this is a rare and exciting opportunity to join the team and start new projects. You'll be part of the marketing team alongside Irina (Head of Marketing) and François (Co-Founder).</p><p><strong><br></strong></p><p><strong>About the role</strong></p><p>In Hunter's small team, the Content Manager is the voice of the company and creates content for various channels: our blog, social media, and other websites. </p><br><p>As a Content Manager, you will:</p><ul> <li>Write in-depth articles about cold emailing and marketing for the blog. You will discuss the article ideas that bring the most value for Hunter's users and create the content schedule in collaboration with Irina.</li> <li>Work closely with the engineering team to promote product updates with emails, blog articles, and posts on social media.</li> <li>Be responsible for Hunter's social media, from the elaboration of the strategy to the regular publishing of content.</li> <li>Write guest posts for other blogs and participate in content partnerships with other publishers and SaaS companies.</li> <li>Write a monthly newsletter for Hunter's users.</li> </ul><p>Hunter is a fully remote team, and this is a remote job. It is open to anyone located in Europe.</p><p><strong><br></strong></p><p><strong>About you</strong></p><ul> <li>Writing is your passion. Your grammar and writing skills are excellent.</li> <li>You understand how copywriting can drive engagement. You can be in your audience's shoes, understand their concerns, and write stories that will resonate with them.</li> <li>You know SEO. You've learned how to create content that is great for readers and for search engines, too.</li> <li>You're very familiar with LinkedIn, Twitter, and Facebook. You can write for each channel.</li> <li>You've already produced content in the B2B SaaS industry. You are no stranger to sales and marketing software.</li> </ul><p><strong><br></strong></p><p><strong>About us</strong></p><p><a class=\"external\" href=\"https://hunter.io/\" rel=\"nofollow\">Hunter</a> is used by salespeople, marketers, and recruiters to reach out to the people that matter for their business. We index B2B data from millions of public web pages and make it convenient to explore with simple but powerful tools.</p><p>Hunter is the most popular solution to find professional email addresses. It is used by almost 3 million people and leading companies such as Google, Adobe, Microsoft, or IBM.</p><br><p>Hunter was founded in 2015 and is a self-funded company. We’re a small team working remotely from Europe, America, and Asia. Twice a year, the team meets in a company retreat in Europe.</p><br><p>Learn more:</p><ul> <li><a class=\"external\" href=\"https://hunter.io/blog/how-we-hire/\" rel=\"nofollow\">How We Hire</a></li> <li><a class=\"external\" href=\"https://hunter.io/about\" rel=\"nofollow\">About Us</a></li> </ul><p><strong><br></strong></p><p><strong>Benefits</strong></p><p>Being part of Hunter will also get you:</p><ul> <li>A competitive salary</li> <li>Five weeks of paid vacations per year</li> <li>Fully-paid setup (including a MacBook Pro, standing desk, and ergonomic chair)</li> <li>$5,000 vacation bonus per year</li> </ul>\n", "company_logo_url": "https://remotive.io/job/978037/logo"}, {"id": 1004973, "url": "https://remotive.io/remote-jobs/writing/brand-copywriter-1004973", "title": "Brand Copywriter", "company_name": "Fuzzy Pet Health", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-12-03T21:41:04", "candidate_required_location": "USA Only", "salary": "", "description": "<div><b>The Company</b></div><div><br></div><div><span style=\"font-size: 10.5pt\">Fuzzy is your pet health partner. On a mission to make pet care more accessible, Fuzzy is a subscription-based service offering members 24/7 Live Vet Chat support, virtual vet consultations, and on-demand answers from a team of licensed, on-staff pet health experts. Fuzzy also offers pet parents vet-tested and recommended products and personalized programs for nutrition, training, and obedience.</span> </div><div><br></div><div><span style=\"font-size: 10.5pt\">Through technology, we're creating a different type of relationship between pet parents and their veterinary caregivers – one that's personal, empowering, and focused on improving the lives of animals.</span></div><div><br></div><div><b>The Role</b></div><div><br></div><div><span style=\"font-size: 11pt\">We’re looking for an experienced Brand Copywriter to join the growing Marketing team, working in direct partnership with the VP of Marketing, Director of Brand, Art Director, and cross functional stakeholders. As Fuzzy’s first Brand Copywriter, you’ll play a critical role in defining our copy and messaging strategies, bringing our verbal identity to life in ads, landing pages, email marketing, packaging, print, production descriptions, video/audio scripts, performance marketing channels, and more. If you’re a storyteller with a track record of developing content in a fast-paced environment, there’s never been a better time to join Fuzzy!</span></div><br><br><div class=\"h3\">Responsibilities</div><ul><li>Lead and execute Fuzzy’s DTC-focused messaging impact strategy </li></ul><ul><li>Improve the Fuzzy brand experience by leveraging customer persona modeling and verbal brand identity to map key messaging for multiple states of the member experience</li></ul><ul><li>Develop copy frameworks and guidelines for the marketing team </li></ul><ul><li>Own end-to-end execution of translating creative briefs, long-form content, and campaign ideas to production-ready copy with veterinary support and other brand team stakeholders</li></ul><ul><li>Work closely with Fuzzy’s Growth Team to identify strategic messaging and creative opportunities that will stop pet parents mid-scroll, driving measurable member acquisition </li></ul><ul><li>Own all copywriting and performance copy across a variety of digital and print channels</li></ul><ul><li>Edit the work of cross-functional partners efficiently, while balancing style with creativity </li></ul><ul><li>Contribute to the Fuzzy voice, tone, and style guide to ensure brand consistency </li></ul><br><br><div class=\"h3\">Requirements</div><ul><li>Mission-oriented with a passion for pets and the informed health decisions pet parents must make to give their pets a long and happy lives</li></ul><ul><li>At least 4 years of copywriting experience, ideally at an e-commerce or direct-to-consumer brand (DTC). Start-up experience is preferable</li></ul><ul><li>A portfolio of content samples that how how you balance creativity with business objectives </li></ul><ul><li>Ability to multi-task and deliver copy for a variety of marketing projects, shifting priorities, and deadlines</li></ul><ul><li>Excellent writer with the ability to translate both medical and generally informative content into concise, impactful statements that drive action across a variety of mediums or placements </li></ul><ul><li>Attention to detail and strong grasp of DTC messaging fundamentals</li></ul><ul><li>Experience with Figma design systems, Asana, Google Office, Zoom, Slack and other team collaboration software</li></ul><ul><li>Agency or agency partnership experience a plus</li></ul><ul><li>Willingness to jump in with both feet as an early member of growing, all-hands-on-deck team</li></ul><div><b style=\"font-size: 11pt\">Core Fuzzy Principles We’re Looking For</b></div><div><br></div><div><b style=\"font-size: 11pt\">You’re Proactive</b></div><div><span style=\"font-size: 11pt\">You’re comfortable taking initiative, thinking outside the box, and have outcome-focused approaches to the work you do.</span></div><div><br></div><div><b style=\"font-size: 11pt\">We’re With You</b></div><div><span style=\"font-size: 11pt\">You’re excited about working cross functionally, collaborating with different personalities and remote teams while driving towards something great together</span></div><div><br></div><div><b style=\"font-size: 11pt\">You’re a Superhero</b></div><div><span style=\"font-size: 11pt\">You love to aim high and save the day. You equally want to inspire others to deliver superhero results that help define a new category within an outdated industry. Fuzzy is here to help pet parents all across the country but we’re also playing to win. It takes superhero efforts from everyone and you’re ready to assemble! </span></div><div><br></div><div><i style=\"font-size: 11pt\">We know that great work comes from great, and inclusive teams. At Fuzzy, we specifically look for individuals of varying strengths, skills, backgrounds, and ideas. We believe this gives us a competitive advantage to better serve our members and helps us all grow as Fuzzyrs and individuals.</i><i> </i></div><div><br></div><div><i style=\"font-size: 11pt\">We hire candidates of any race, color, ancestry, religion, sex, national origin, sexual orientation, gender identity, age, marital or family status, disability, veteran status, and any other status. Fuzzy is proud to be an Equal Opportunity Employer and will consider qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance. If you have a disability or special need that requires accommodation, please let us know.</i></div>"}, {"id": 1006578, "url": "https://remotive.io/remote-jobs/writing/content-writer-1006578", "title": "Content Writer", "company_name": "FitXR", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-12-02T17:41:08", "candidate_required_location": "Europe and North America", "salary": "", "description": "<p>FitXR is a fitness technology company working at the cutting edge of virtual, augmented and mixed reality. We started life in a garden shed in the UK. Fast forward to today, we’re known as the team behind the award-winning VR App <a class=\"external\" href=\"https://www.youtube.com/watch?v=6DEbnbjqHlM\" rel=\"nofollow\">FitXR</a> which is one of the top-selling games on the Oculus and Steam stores. In 2020 we raised a $7.5 million Series A which has enabled us to scale, be on track to hit 1M downloads by the end of 2021 and change even more people's lives through virtual reality fitness.</p>\n<p>We are a global remote first company and our team spans across the UK, US and Spain. Our team comes from a variety of backgrounds including fitness and some of the most successful technology and gaming companies in the world. Our mission is to redefine fitness and prove that exercise can be fun - and for everyone. We believe in a future where exercise everywhere - whether that is the gym, the park, or at home - is enhanced through engaging technology that extends your reality.</p>\n<p> </p>\n<p><strong>What you’ll do</strong> 👀</p>\n<ul>\n<li>Contribute to building a content marketing strategy that delivers on our values</li>\n<li>Own customer storytelling initiatives across the blog, weekly email, and social media</li>\n<li>Sit within the Community team but work cross-functionally with other departments (e.g. product, creative…) when necessary</li>\n</ul>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<p><br><strong>You should apply if</strong> ✅</p>\n<ul>\n<li>You have worked in a similar role before at mid-senior level</li>\n<li>You’ve written extensively for consumer apps or health/fitness brands</li>\n<li>Your writing process starts with questions: Who is this for? Why should they care? How do I respect their time?</li>\n<li>You’re relentlessly customer-focused in your approach to content writing and content strategy</li>\n<li>You’re comfortable owning the process from strategy, ideation and planning through to execution and delivery</li>\n<li>You’re excited by the idea of making fitness fun and accessible for everyone, and enabling people to reclaim their relationship with their bodies</li>\n<li>You like taking an active role in determining your workload: not just waiting around for tasks to be assigned</li>\n</ul>\n<p> </p>\n<p>Our mission is to make fitness fun and accessible for everyone. To build inclusive products, we need to build an inclusive team. Please know that this list is indicative and that we would still love to hear from you even if you feel you only are a 75% match. Skills can be learnt, diversity cannot. We promote a diverse and inclusive culture at FitXR.</p>\n<p><strong>Benefits</strong></p>\n<p><strong>Logistics</strong> 🛠</p>\n<p>Unfortunately, we are unable to offer visas of any kind at this time!</p>\n<p>Our interview process takes place on Google Hangouts and tends to consist of the following stages:</p>\n<ul>\n<li>Initial screen</li>\n<li>Hiring Manager + team interviews</li>\n<li>Founder / Exec Interview</li>\n</ul>\n<p><em>Some roles will have a take home task after the initial screen. </em></p>\n<p>Please let us know if you require any accommodations for the interview process, and we’ll do our best to provide assistance.</p>\n<p><strong>Benefits</strong> 🌱</p>\n<p>Our benefits are hosted on <a class=\"external\" href=\"https://www.thanksben.com/\" rel=\"nofollow\">Ben</a> which gives you flexibility to make choices that work for you.</p>\n<p>🌎 Remote first: your life, your way of working</p>\n<p>🏝 Unlimited annual leave</p>\n<p>💰 Competitive salary with half year and end of year reviews</p>\n<p>📈 Stock options</p>\n<p>🌱£800 per annum learning budget</p>\n<p>🧘 £900 per annum wellbeing budget (⛑ Private Health Insurance available within this through our benefits platform)</p>\n<p>🏡£400 work from home budget</p>\n<p>🤗 Bi-annual company retreat &amp; regular get togethers</p>\n<p>💻 Laptop &amp; VR headset</p>\n<p>🚴‍♂️ Annual travel pass &amp; cycle to work scheme</p>\n<p>👶 12 weeks full paid family leave</p>\n"}, {"id": 1003372, "url": "https://remotive.io/remote-jobs/writing/sr-copywriter-1003372", "title": "Sr. Copywriter", "company_name": "Beacon Digital", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-12-01T13:40:27", "candidate_required_location": "USA Only", "salary": "", "description": "<div><span style=\"font-size: 11pt;\">Beacon Digital is excited to bring a Senior Copywriter on to lead creative execution across our digital campaigns. This person will sit within the Creative Department, managing a team of Copywriters and working closely with our Strategy, Design and Production teams. As a Senior Creative for a B2B Digital Marketing Agency, you’ll collaborate with clients and a cross-functional internal team to deliver the best concepts that generate meaningful results. </span></div>\n<p><br><br></p>\n<div class=\"h3\">You’ll get the chance to</div>\n<ul>\n<li>Conceptualize, write, and edit copy for integrated marketing campaigns including paid media, video, audio,  web and email</li>\n</ul>\n<ul>\n<li>Bring creative ideas to life from brainstorm to execution, collaborating with Art Director, designers, and creative producers</li>\n</ul>\n<ul>\n<li>Lead branding initiatives to establish voice, tone, and visual guidelines for client marketing efforts</li>\n</ul>\n<ul>\n<li>Lead a team of copywriters in developing their crafts and effectively communicating brand stories across digital platforms</li>\n</ul>\n<ul>\n<li>Partner with marketers and creatives at innovative B2B companies to execute campaigns that drive measurable results</li>\n</ul>\n<ul>\n<li>Be a key player on a results-driven, digital-first team. </li>\n</ul>\n<ul>\n<li>Learn the ins and outs of innovative industries like fintech, regtech, cybersecurity, and B2B SaaS </li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Here’s what we have in mind for the role. Someone who:</div>\n<ul>\n<li>Has a demonstrated ability to write creative copy that maintains a brands’ integrity and style while accomplishing campaign objectives</li>\n</ul>\n<ul>\n<li>Brings enthusiasm and passion for all things digital - you are on top of user behavior trends and how to bring ideas to life</li>\n</ul>\n<ul>\n<li>3+ years of B2B copywriting experience</li>\n</ul>\n<ul>\n<li>5+ years of digital agency experience,  preferably in a manager role</li>\n</ul>\n<ul>\n<li>Is eager for projects that challenge their skillset and fulfill their desire to grow as a creative digital marketer</li>\n</ul>\n<ul>\n<li>Bachelor’s degree in Marketing, Communications, Journalism or English preferred </li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Benefits</div>\n<ul>\n<li>Medical, Vision, and Dental Insurance</li>\n</ul>\n<ul>\n<li>401K</li>\n</ul>\n<ul>\n<li>Paid Time Off</li>\n</ul>\n<ul>\n<li>Paid Family Leave</li>\n</ul>\n<ul>\n<li>Tax Advantaged Savings Accounts</li>\n</ul>\n<ul>\n<li>Option to work remotely from your own space, or in a beautiful, modern office in scenic Beacon, NY.</li>\n</ul>\n<ul>\n<li>Work with a creative and hard-working team of marketing professionals.</li>\n</ul>\n<ul>\n<li>Professional Development Opportunities</li>\n</ul>\n<ul>\n<li>A fun, supportive team with a strong and growing client base around the globe</li>\n</ul>\n<div><strong style=\"font-size: 18px;\">We’re in the Happiness Business</strong></div>\n<div> </div>\n<div>That's why everyone on the team has a voice at the table. We're working together to build a great workplace with supportive colleagues, and opportunities for advancement and leadership.</div>\n<div> </div>\n<div>At Beacon Digital, our mission is to help B2B companies generate more leads, gain greater awareness among target audiences, and leverage technology to become more efficient marketing organizations. Drawing on many years of experience working with top global brands across a variety of industries, we work closely with our clients to achieve measurable business results with our online strategies. Our team includes a number of seasoned marketing professionals, expertly assembled to meet the unique needs of each client.</div>\n<div> </div>\n<div>Our services span many facets of marketing, including: digital marketing strategy consulting; lead generation and lead nurturing campaigns; online advertising strategy and management (SEM/PPC); search engine optimization (SEO); social media strategy, management, contests and advertising; email marketing; marketing automation and CRM integrations; marketing analytics, and much more. Beacon Digital is located in New York City, as well as Beacon, NY, in the scenic Hudson Valley.</div>\n<div> </div>\n<div>Learn more about us at <a class=\"postings-link\" href=\"http://beacondigitalmarketing.com/\" rel=\"nofollow\">http://beacondigitalmarketing.com/</a></div>\n<div> </div>\n<div><strong><span style=\"font-size: 18px;\">Everyone belongs at Beacon</span></strong></div>\n<div> </div>\n<div>We welcome those from all walks of life, across race, gender, sex, age, religion, identity, education, disability, and citizenship or veteran status.</div>\n<div> </div>\n<div>The path to more diverse representation in marketing and within our company does not end with a statement. In fact, a statement is where it begins. Our greatest strengths will always be our differences, pushing us to reach global audiences and to challenge the status quo.</div>\n<div> </div>\n<div>We promise to keep listening, keep learning, and keep paying attention to ensure that we are building a culture in which all voices are included and heard.</div>\n<div> </div>\n<div><strong>Apply Now:</strong> Interested candidates should submit a resume and cover letter. No agencies, please.</div>\n"}, {"id": 1016481, "url": "https://remotive.io/remote-jobs/writing/ux-copywriter-m-f-x-1016481", "title": "UX Copywriter (m/f/x)", "company_name": "Kontist GmbH", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-30T12:52:36", "candidate_required_location": "Anywhere", "salary": "", "description": "<p>Do you know how many obstacles freelancers face when it comes to their finances? It starts with opening a business bank account and leads to taking care of all painful tax issues. We want to make it easy to run your own business when being self-employed and offer tailored solutions that address the pressing and unique problems freelancers face.</p>\n<p>First we created a smart mobile bank account with superpowers to help with finances, taxes and savings. Now, we also offer a tax service for the self-employed to really take care of all of their needs</p>\n<div class=\"h2\"><strong>Your mission:</strong></div>\n<p>You are experienced in working with products and brands? You have a feeling and understanding for how nuances in different channels can make a decisive difference? Then you might be our perfect match! In this challenging position you will actively support our Product &amp; Marketing teams in creating exciting copies that are geared towards our great audience - Freelancers &amp; Self-employed.</p>\n<div class=\"h2\"><strong>Your tasks</strong></div>\n<ul>\n<li>You develop Kontist’s tone of voice further in German and English and significantly shape the brand</li>\n<li>You have an agile mindset and are experienced working with multiple stakeholders (designers, marketeers, etc.)</li>\n<li>You will actively support our Product Team in writing conversion-oriented copy for product launches, in-app, UX, website, landing pages, lifecycle, and emails— driving activation, retention and engagement efforts</li>\n<li>You have the ability to convey technical features in an exciting and appealing user-centric way</li>\n<li>You support our Marketing team regarding paid ads and campaigns in general</li>\n</ul>\n<div class=\"h2\"><strong>Your Profile:</strong></div>\n<ul>\n<li>Minimum 3 years of experience in Copywriting, preferably in a fast-paced environment (please share your portfolio with us)</li>\n<li>You have a good understanding of brand and product communications</li>\n<li>You are a native German speaker (C2), have a very good command of English (C2), and are not afraid to present your work in front of the entire company</li>\n<li>Nice to have: You have already gained professional experience in a fast-growing digital company, in a start-up environment, at a FinTech, or in general in a company in the field of self-employment</li>\n</ul>\n<div class=\"h2\"><strong>How we show you our love:</strong></div>\n<ul>\n<li>Grow with us! We are a fast-growing, well-funded startup and we will also give you a very steep learning curve in a short time.</li>\n<li>We offer you the opportunity to work with our personal coach once a week.</li>\n<li>We offer weekly German classes.</li>\n<li>We are a multicultural and extremely motivated team that has a lot of fun at work.</li>\n<li>You can choose your preferred setup: working fully remote or coming to our beautiful office with office dogs in the middle of Prenzlauer Berg.</li>\n<li>As soon as the pandemic is over, we will again offer daily team lunches in the office as well as fresh fruit, regular team events, offsites and much more.</li>\n<li>We sponsor your Urban Sports Club membership.</li>\n<li>When it's time for vacation, you can take full advantage with 30 vacation days and an extra day off on your birthday</li>\n<li>And to make sure your bank account is happy, we pay above average (regardless of turnover).</li>\n</ul>\n<div class=\"h2\"><strong>💜</strong></div>\n<div class=\"h2\">Last but not least:</div>\n<p>If this role excites you, but you are worried that you don’t fit all of the requirements, please send in your application anyway. We would love to get in-touch!</p>\n<p>Kontist is an Equal Opportunity Employer 🏳️‍🌈</p>\n<p>We believe in fully accepting people as they are. Celebrating our differences has shown us, not just the positive impact on the growth and performance of Kontist, but also on how much better we feel when we come home from work (or close the laptop) at the end of the day. That said, Kontist gives people the same opportunities for employment, pay, and promotion, without discrimination. We are committed to creating an inclusive environment for all candidates and employees. We relate diversity amongst others to the dimensions of cultural or social origin, religion, age, disability, gender, sexual orientation and sexual identity – We look forward to applications from candidates who contribute to the diversity of our company!</p>\n"}, {"id": 1005531, "url": "https://remotive.io/remote-jobs/writing/writer-sports-betting-1005531", "title": "Writer, Sports Betting", "company_name": "Minute Media", "category": "Writing", "tags": [], "job_type": "part_time", "publication_date": "2021-11-30T09:40:14", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h1\">Description</div>\n<p><strong><u>Company Description</u></strong></p>\n<p>BetSided, a brand of FanSided and Minute Media, is home to entertaining and informative multimedia sports content presented through the lens of athletes and experts using betting insights to help tell the story. We're not talking about who you should bet on based on a million analytical insights here. We're talking about which quarterback your team should draft or why your favorite player is primed for a massive game that week based on what Vegas' odds tell us. And let's be honest, Vegas usually gets it right. Through this unique view, BetSided aims to cultivate strong, engaging relationships with fans and ultimately make everyone who wants to feel more comfortable learning and discussing sports betting.  </p>\n<p> </p>\n<p><strong><u>Position Summary</u></strong></p>\n<p>BetSided, a new sports betting content venture from Minute Media, is looking for a creative hourly writer with a background and passion for covering sports and sports betting. </p>\n<p> </p>\n<p>This is an exciting opportunity to join the fastest-growing industry in sports media and make your mark in the industry. Sports betting coverage has expanded exponentially over the last two years and will only continue to grow as more states legalize sports betting. This is a chance to help influence the strategy of a new brand through daily pitches, writing and editing. </p>\n<p> </p>\n<p>We are looking for dynamic individuals who thrive under a 24/7, fast-moving editorial newsroom and who understand the challenges and opportunities that come with working at a quickly expanding start-up. This is a part-time position that will require work on weekends, evenings and holidays. </p>\n<p> </p>\n<p><strong><u>What You’ll Do</u></strong></p>\n<p>As an Hourly Writer, you’ll be responsible for assisting in the execution of our editorial vision which involves: the ability to write about all major sports topics quickly and accurately, write knowledgeably about sports betting, follow content strategy, and create pieces of opinion and analysis for a team of editors. Articles will range from 250-500 words depending on the type of article and will cover all major sports. The writer will be expected to learn the CMS to submit content. Once articles are completed, the writer will submit them via the CMS for approval and edits.</p>\n<p><br><br>Brand: <br>BetSided<br><br>Benefits:</p>\n<p><strong><u>What You’ll Get</u></strong></p>\n<ul>\n<li>Opportunity to make a meaningful impact in a fast-growing company</li>\n<li>Career development opportunities &amp; workshops</li>\n<li>Collaborative team environment &amp; fun company events!</li>\n<li>100% remote</li>\n</ul>\n<p> </p>\n<p>Minute Media is committed to creating a diverse and inclusive work environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.  </p>\n<p> </p>\n<p>Not sure that you're 100% qualified but are up for the challenge? We want you to apply!</p>\n<div class=\"h1\">Requirements</div>\n<p><strong><u>What You Have</u></strong></p>\n<ul>\n<li>Ideally, 1-3 years of sports and/or sports betting writing experience</li>\n<li>Ability to quickly produce clean and interesting analysis on a variety of trending/viral topics</li>\n<li>Ability to support arguments with stats and facts, not just opinion</li>\n<li>Passion for and strong knowledge of all major professional sports in the United States</li>\n<li>Able to closely follow direction and style</li>\n<li>Strong attention to detail, and ability to meet deadlines and multitask at a fast pace</li>\n<li>Energetic, well organized and proactive team player</li>\n<li>Flexible schedule with availability on nights and weekends</li>\n</ul>\n"}, {"id": 1005533, "url": "https://remotive.io/remote-jobs/writing/entertainment-staff-writer-1005533", "title": "Entertainment Staff Writer", "company_name": "Minute Media", "category": "Writing", "tags": [], "job_type": "part_time", "publication_date": "2021-11-29T05:39:51", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h1\">Description</div>\n<p>FanSided, one of the fastest-growing digital content networks, is looking for an entertainment staff writer to join the team.</p>\n<p>We believe that culture is our core, and we foster an environment that encourages creativity, teamwork, and openness. We are a group of passionate, hardworking, and talented individuals who love to work collaboratively and get sh*t done. If this sounds like you, read on....</p>\n<p> </p>\n<p><strong>What You’ll Do:</strong></p>\n<p>As a Part-Time Staff Writer, you'll work 29 hours a week and report directly to the Entertainment and Lifestyle Director. You’ll be responsible for contributing a variety of content across our TV and movie site, Hidden Remote. You will follow a content strategy, identify and execute real-time coverage based on breaking news, create SEO content, and occasionally create longer features, slideshows, and opinion pieces. </p>\n<p>You will be working closely with the Entertainment and Lifestyle Director, the Head of Content and the Hidden Remote Editor to receive assignments. The opportunity to pitch stories is also an option. Content for other sites you’re not currently assigned to must be approved by the Entertainment and Lifestyle Director. </p>\n<ul>\n<li>Collaborate with the Entertainment and Lifestyle Director, Head of Content and the Hidden Remote Editor on content strategies and implementation of those strategies</li>\n<li>Write about 5-10 stories a day on Hidden Remote, taking into consideration the occasional longform content will take longer and meetings might come up</li>\n<li>Implement SEO strategy and FanSided best practices using provided resources and SEO templates</li>\n<li>Assist with the execution of Entertainment Division special events, tentpole content and podcasts, as needed</li>\n<li>Prioritize growing Hidden Remote during your working hours. Any work that is not related or approved as part of your responsibilities needs to be done outside of working hours</li>\n<li>Be a strong team player by coming to team meetings with a positive attitude and celebrating team wins while providing insightful updates</li>\n<li>Attend virtual meetings and communicate with your direct manager over Gmail and Slack on a consistent basis</li>\n</ul>\n<p><strong>What You Have:</strong></p>\n<ul>\n<li>At least 2 years of entertainment and digital writing experience</li>\n<li>A strong passion for entertainment and the ability to keep up with the latest entertainment news across different topics</li>\n<li>Expertise in at least 3 of the following topics: Netflix, general fantasy/sci-fi, Star Wars, general TV, The Bachelor, or celebrity culture (Kardashians, etc.)</li>\n<li>The ability to follow directions, a specific content strategy, and assignments</li>\n<li>Attention to detail</li>\n<li>Enthusiasm and willingness to be a team player</li>\n<li>Communication skills as this is a remote position</li>\n</ul>\n<p>Minute Media, is a leading media and technology brand focused on two main pillars—platform and content. Minute Media’s platform serves as the company’s foundation, powering its content as well as enabling the evolution of other market-leading digital media brands. To date, Minute Media’s owned and operated destinations include The Players’ Tribune, 90min, DBLTAP, Mental Floss, The Big Lead and FanSided.</p>\n<p>Minute Media is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.  </p>\n<p>Feel like you're a good fit for the role? Apply here for consideration. If you are not sure that you're 100% qualified, but up for the challenge- we want you to apply!</p>\n<p><br><br>Brand: <br>FanSided<br><br>Benefits: </p>\n<p><strong><u>What You’ll Get</u></strong></p>\n<ul>\n<li>Opportunity to make a meaningful impact in a fast-growing company</li>\n<li>Career development opportunities &amp; workshops</li>\n<li>Collaborative team environment &amp; fun company events!</li>\n<li>100% remote schedule</li>\n</ul>\n<p>Minute Media is committed to creating a diverse and inclusive work environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.   </p>\n<p>Not sure that you're 100% qualified but are up for the challenge? We want you to apply!</p>\n<div class=\"h1\">Requirements</div>\n<p>None</p>\n"}, {"id": 991535, "url": "https://remotive.io/remote-jobs/writing/associate-writer-healthcare-991535", "title": "Associate Writer - Healthcare", "company_name": "Devoted", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-27T01:39:50", "candidate_required_location": "USA Only", "salary": "", "description": "<div><strong>A bit about us: </strong></div>\n<div> </div>\n<div>We’re on a mission to change healthcare — how it’s paid for, delivered, experienced. We want to put people center stage, not process or profit. We are guided by a deep belief that every person on Medicare should be treated like we would treat a member of our own family: with loving care and a profound commitment to their health and well-being. </div>\n<div> </div>\n<div>That’s why we’re gathering a whole bunch of smart, big-hearted people to create a new kind of healthcare company — one that combines compassion, health insurance, clinical care, and technology seamlessly. </div>\n<div> </div>\n<div><strong style=\"font-size: 15px;\">\"We want to partner with people we love for a cause we believe in. Life is short. Join us.</strong><span style=\"font-size: 15px;\">\"</span></div>\n<div> </div>\n<div> </div>\n<div><strong style=\"font-size: 12pt;\">About this role:</strong></div>\n<div> </div>\n<div><span style=\"font-size: 12pt;\">Do you like to write? Devoted Health is looking for an associate writer to develop a wide assortment of articles, helpful resources, and content assets to engage and educate older Americans.</span></div>\n<div> </div>\n<div><span style=\"font-size: 12pt;\">In this role, you’ll write everything from articles, webinars, tutorials, letters, website copy, and more—all with a health and wellbeing focus. You don’t need to have a background in healthcare or Medicare to apply, but you should have a journalist’s love of researching new topics and writing about them in a way that’s clear, compelling, and meets our audience where they are.</span></div>\n<div> </div>\n<div><span style=\"font-size: 12pt;\">The ideal candidate is interested in working in a fast-paced, deadline-driven environment. You’re a curious self-starter who’s unafraid to ask questions. You’re open to digging into new topics and technologies and becoming a subject matter expert. You love obsessing over the little details—like word choice and punctuation—but you can also work fast and pivot quickly when priorities change. </span></div>\n<p><br><br></p>\n<div class=\"h3\">Responsibilities will include:</div>\n<ul>\n<li>Researching and writing long-form articles on health, wellness, financial resources</li>\n</ul>\n<ul>\n<li>Creating easy-to-understand guides and tip sheets </li>\n</ul>\n<ul>\n<li>Writing content that’s in our brand voice and aligns with our overall brand strategy</li>\n</ul>\n<ul>\n<li>Editing and de-jargoning emails, letters, forms, and regulatory documents</li>\n</ul>\n<ul>\n<li>Working alongside designers to make sure your copy sings in layout </li>\n</ul>\n<ul>\n<li>Establishing relationships with in-house subject matter experts to guarantee our materials are accurate and helpful</li>\n</ul>\n<ul>\n<li>Work with team members on various initiatives to improve the engagement and impact of content</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Desired skills and experience:</div>\n<ul>\n<li>Preferably 1-3 years of experience writing for a brand or news site</li>\n</ul>\n<ul>\n<li>Bachelor’s degree in English, journalism, or a similar field</li>\n</ul>\n<ul>\n<li>Interest in a very fast-paced or startup environment </li>\n</ul>\n<ul>\n<li>History of success in working with a team and on deadline</li>\n</ul>\n<ul>\n<li>Ability to research and write about complex topics</li>\n</ul>\n<ul>\n<li>Strong grasp of English language and grammar</li>\n</ul>\n<ul>\n<li>Excellent organizational and communication skills</li>\n</ul>\n<ul>\n<li>A can-do attitude </li>\n</ul>\n<ul>\n<li><strong>Portfolio and cover letter required</strong></li>\n</ul>\n<ul>\n<li>Healthcare background a plus, but not required</li>\n</ul>\n<div>#LI-EM1</div>\n<div>#LI-REMOTE</div>\n<div> </div>\n<div>If you love running towards complex challenges and transforming them into solutions, if you want to make a potentially huge impact on many lives, and if you are looking for a disruptive startup with an inspiring and talented team, Devoted Health may be the place for you!  If you lack a specific credential for this position but believe that your strengths and life experiences will propel our mission, we would love to hear from you.</div>\n<div> </div>\n<div><em>Devoted is an equal opportunity employer.  We are committed to a safe and supportive work environment in which all employees have the opportunity to participate and contribute to the success of the business. We value diversity and collaboration. Individuals are respected for their skills, experience, and unique perspectives. This commitment is embodied in Devoted’s Code of Conduct, our company values and the way we do business.</em></div>\n<div> </div>\n<div><em>As an Equal Opportunity Employer, the Company does not discriminate on the basis of race, color, religion, sex, pregnancy status, marital status, national origin, disability, age, sexual orientation, veteran status, genetic information, gender identity, gender expression, or any other factor prohibited by law. Our management team is dedicated to this policy with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, employee activities and general treatment during employment.</em></div>\n<div> </div>\n<div><strong>COVID-19 Vaccination Requirement:</strong> Where permitted by applicable law, candidates must have received or be willing to receive the COVID-19 vaccine by date of hire to be considered. The Company will provide reasonable accommodations to qualified employees with disabilities or for a sincerely held religious belief, practice, or observance.</div>\n"}, {"id": 990127, "url": "https://remotive.io/remote-jobs/writing/content-writer-and-editor-990127", "title": "Content Writer and Editor", "company_name": "rotunda-software", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-11-25T21:40:05", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Do you want to use your communication and writing skills to help make a positive impact on the world? </p> <p><a class=\"external\" href=\"http://www.rotundasoftware.com\" rel=\"nofollow\">Rotunda Software</a> is looking for a Content Editor, who is eager to take ownership of all of Rotunda Software’s communications. This is a remote role where you’ll join a talented team of passionate professionals. A successful candidate will have extensive experience framing ideas, architecting information, and inspiring customers. If you take great pleasure in deconstructing ideas, communicating simply and engaging customers, you will thrive in this position. </p> <p>Our two flagship products are <a class=\"external\" href=\"http://www.ministryschedulerpro.com\" rel=\"nofollow\">Ministry Scheduler Pro</a> and <a class=\"external\" href=\"http://www.volunteerschedulerpro.com\" rel=\"nofollow\">Volunteer Scheduler Pro</a>, scheduling tools actively used by over 3,500 organizations to schedule over one million volunteers. Our newest product <a class=\"external\" href=\"http://www.unison.io\" rel=\"nofollow\">Unison.io</a> is a communication tool for connecting and organizing groups of people, and has explosive growth potential. The individual who fills this position will oversee all content produced for MSP, VSP and Unison.io, as well as for the Rotunda Software brand.</p> <p>Rotunda is a talented, dedicated, international team, passionate about doing meaningful work and building extraordinary products that people love. Our mission is to help people do good things, and our unique culture is rooted in a set of <a class=\"external\" href=\"http://www.rotundasoftware.com/values\" rel=\"nofollow\">shared values</a>.</p><p><strong>Responsibilities</strong></p><ul> <li>Become familiar with the features and benefits of Rotunda's products.</li> <li>Ensure all communications are engaging, helpful, and on-brand. </li> <li>Write and edit short and long form copy for social media, email campaigns, videos, blog posts, advertisements, marketing collateral, Google Ads, and more.</li> <li>Provide high-level framing when working with marketing and sales team members.</li> <li>Proofread materials for spelling, grammar, punctuation, syntax, consistency, and brand voice.</li> </ul><p><strong>Requirements</strong></p><ul> <li>A love for good copy. </li> <li>Excellent verbal and written communication skills. </li> <li>Previous experience working as a copywriter and / or editor.</li> <li>Exceptional copywriting, proofing and editing skills, with an understanding of how to adapt copy to different target audiences and promote calls to action.</li> <li>Ability to work independently and deliver quality work in a time-efficient manner.</li> <li>Strong teamwork, time management, and project management skills.</li> <li>Able to accept constructive feedback and adapt ideas as needed.</li> <li>Experience with email campaign systems such as Pardot a plus.</li> </ul><p><strong>Benefits</strong></p><ul> <li>Meaningful work in a service-focused environment.</li> <li>Big challenges with favorable circumstances.</li> <li>Stability (Rotunda has been self funded and profitable for over 15 years).</li> <li>Work-life balance.</li> <li>Dedicated, professional co-workers free of ego issues.</li> </ul><p>This role starts as a part-time, 5-10 hour per week contract position with opportunity for full-time employment for the right candidate.</p>"}, {"id": 862315, "url": "https://remotive.io/remote-jobs/writing/math-lesson-writer-862315", "title": "Math Lesson Writer", "company_name": "Study.com", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-11-24T20:12:34", "candidate_required_location": "", "salary": "", "description": "<p><u><strong>Online Lesson Writer - Math (Contract)</strong></u></p><p><u><strong><br></strong></u></p><p>Study.com is dedicated to making education easily accessible and highly valuable. Our math lesson writers develop rich, quality lessons for students from middle school to college level. We’re looking for instructors, course developers, and educational copywriters to contribute to our library of engaging online lessons in math subjects, including: </p><ul><li>Basic arithmetic </li><li>Algebra </li><li>Geometry </li><li>Trigonometry </li><li>Calculus </li><li>Statistics </li></ul><p><u><strong><br></strong></u></p><p><u><strong>Project Description</strong></u> </p><br><p>Given a lesson outline with optimized section headings and content prompts, you’ll create an engaging written lesson between 1000-2000 words as well as a descriptive title for the lesson. Each lesson will culminate in a brief summary to emphasize key concepts and prepare students for a short quiz. You’ll also write short, targeted answers for 2-6 preselected FAQs related to your lesson. </p><p>You can choose what you want to work on from a pool of lesson outlines covering a variety of mathematical topics, including algebra, calculus, and statistics. You will perform research to support the information in your lesson.  </p><p><u><strong><br></strong></u></p><p><u><strong>Requirements</strong></u></p><ul><li>You have a bachelor's degree or equivalent experience  </li><li>You have very strong writing skills </li><li>You have familiarity with online educational content  </li><li>You’re committed to providing high-quality, accurate information  </li><li>You have a working knowledge of online research methods </li><li>You have excellent communication skills and are responsive and collaborative </li></ul><p><strong><br></strong></p><p><strong>Preferred qualifications</strong></p><ul><li>You have developed online academic course or lesson content </li><li>You have 1-3 years’ teaching experience at the high school and/or college level </li><li>You have experience with HTML, Wiki code, Latex, or imaging software </li></ul><p><u><strong><br></strong></u></p><p><u><strong>What We Offer</strong></u> </p><ul><li>Reliable Payments: Timely, reliable payments twice a month via PayPal. All work is paid per piece. Per piece rates vary based on complexity and length of content. </li><li>Independence: No waiting, no assignments, and a massive library of lessons for you to choose from </li><li>Flexibility: Work from anywhere, at any time, completely online </li><li>Supportive Staff: Access to a supportive in-house team to answer your questions </li></ul><p><strong><br></strong></p><p><strong>The Contract Process</strong> </p><ol><li>Complete the application and submit with your resume. </li><li>If your application is approved, we'll email you a link to a contract, and your second step is to read it over and sign it.</li><li>The following week, you'll receive emails with access information and project documentation. Your third step is to follow the instructions to set up your accounts and get started on your project.</li></ol><p>You can view a step-by-step overview of the contract process here: <a href=\"https://study.com/blog/how-to-become-a-freelancer-for-study-com-online-freelance-writing-editing-work.html\" rel=\"nofollow\" target=\"_blank\">How to Become a Freelancer with Study.com</a> </p><p><u><strong><br></strong></u></p><p><br></p>\n"}, {"id": 990685, "url": "https://remotive.io/remote-jobs/writing/magazine-production-editor-990685", "title": "Magazine Production Editor", "company_name": "Pride Media", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-24T09:40:23", "candidate_required_location": "USA Only", "salary": "", "description": "<br><br><div class=\"h3\">Company Description</div><p>Pride Media is the largest LGBTQ+ media company in the U.S. We publish four magazines: Out, The Advocate, Out Traveler, and Plus. We have 5 websites, a podcast, and multiple web series (including the daily wrap-up, Pride Today). Pride Media is a community of storytellers, innovators, and influencers who believe in giving voice to all people and we’ve been around, in one form or another, since 1967. Learn more at PrideMedia.com</p><br><br><div class=\"h3\">Job Description</div><p><strong>Print responsibilities include</strong>:</p><p>·       Trafficking, trafficking, and coordinating all aspects of production work on four different magazines for both print and online.</p><p>·       Maintaining consistent formats and styles in Adobe InDesign CC</p><p>·       Keeping templates up to date</p><p>·       Flowing copy, making corrections in magazine layouts</p><p>·       Cropping and sizing images for print</p><p>·       Locating stock and supplied imagery</p><p>·       Preparing and archiving files for conversion to press-ready PDFs</p><p>·       Inspection of files with Production Director (preflighting for accurate bleeds, correct imported file formats, color errors, font styles, folio errors, picture/image verification, and trim sizes)</p><p>·       Co-creation and enforcement of editorial and shipping schedules </p><p> </p><p><strong>Online responsibilities include</strong>:</p><p>·       Scheduling, prioritizing, and trafficking of assets</p><p>·       Creating online images to be used on the websites and in emails</p><p>·       Creating custom PDFs for publicists, companies, interviewees</p><p>·       Work with vendor to close-caption videos</p><p>·       Uploading content using Drupal after the print issue wraps</p><br><br><div class=\"h3\">Qualifications</div><p>·       3-5 years’ experience in a similar position at a magazine or other publishing environment would be great, but any experience with InDesign and editorial production would qualify you for consideration so don’t rule yourself out</p><p>·       Adobe CC (fluent in InDesign a must; prefer also Photoshop, Illustrator, and Acrobat Professional)</p><p>·       Microsoft Office (musts: Word, Excel; prefer also PowerPoint)</p><p>·       Experience using a CMS for web publishing is ideal</p><p>·       Ability to self-motivate when working remotely and ask for help when needed</p><br><br><div class=\"h3\">Additional Information</div><p><strong>Some benefits that we offer:</strong></p><p>·       Health, dental, vision, life, accident, and long-term disability insurance</p><p>·       Matching 401(k) Retirement Plan</p><p>·       Optional Critical Illness and Accident insurance</p><p>·       Flexible Spending Account</p><p>·       LifeSmart/ADP discounts</p><p>·       Unlimited PTO</p><p>·       Mandatory 15 days of vacation, including five consecutive days</p><p><strong>How do you know this is the job for you</strong></p><p>·       Ability to prioritize workflow, coordinate all deadlines for editorial, design, and production with the Chief Content Officer and Production Director</p><p>·       Ability to work remotely, communicating via slack/email/phone/zoom with very diverse employees and differing work styles is important </p><p>·       Attention to detail and flexibility is a necessity</p><p>·       Must have excellent communications skills</p><p>·       Open to working with a diverse and underrepresented community</p><p> </p><p><strong>We believe representation matters at Pride Media and strongly encourage people of color, members of the LGBTQ+ community (including trans and nonbinary individuals), those with disabilities, veterans, and anyone from other underrepresented groups to apply.</strong></p><p>Current states we are hiring in are New York, California, Washington, Massachuttes, South Carolina, and Louisiana. </p>"}, {"id": 992079, "url": "https://remotive.io/remote-jobs/writing/senior-copywriter-992079", "title": "Senior Copywriter", "company_name": "Medium", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-23T05:41:59", "candidate_required_location": "USA Only", "salary": "", "description": "<div>Medium’s mission is to deepen understanding of the world and spread ideas that matter. Medium is building the best place for reading and writing on the internet—a place where today’s smartest writers, thinkers, experts, and storytellers can share big, interesting ideas; a place where ideas are judged on the value they provide to readers, not the fleeting attention they can attract for advertisers.</div><div><br></div><div>Our team is growing, and we are looking for an experienced copywriter to join our Creative Studio reporting to the Creative Director. The position will play a pivotal role in developing and defining messaging across all marketing channels and product experiences. The ideal candidate is a natural storyteller and leader with 5-7 years experience working at an agency or in-house brand team. They have a knack for creative problem solving and are comfortable taking an idea from concept through execution. They share an eagerness to learn and are very comfortable working in a highly collaborative, fast-paced environment. </div><br><br><div class=\"h3\">What you’ll do:</div><ul><li>Conceptualize, oversee, and write all brand, growth marketing, and product copy for Medium including email, paid media, social, landing pages, video and audio scripting, product launches and more.</li></ul><ul><li>Collaborate with design team to develop creative concepts and messaging for all marketing campaigns and product launches.</li></ul><ul><li>Work closely with marketing leaders to develop and craft narratives that deliver on strategy, goals, and KPIs.</li></ul><ul><li>Lead evolution and implementation of brand voice and tone and ensure both are consistently applied across all channels.</li></ul><ul><li>Partner with product team to define in-product UX messaging.</li></ul><ul><li>Participate and lead brainstorming sessions with Creative Studio.</li></ul><ul><li>Develop and maintain copy resource repository.</li></ul><ul><li>Utilize writing skills to craft brand stories that deliver on Medium’s mission.</li></ul><br><br><div class=\"h3\">Who you are and what you’ll bring:</div><ul><li>An exceptional writer, with 5-7 years experience working at an agency or in-house creative team.</li></ul><ul><li>Strong portfolio demonstrating ability to execute large 360 brand campaigns.</li></ul><ul><li>Proactive leader, always looking for new and interesting ways to tell stories.</li></ul><ul><li>Just as comfortable working independently on smaller initiatives as you are at leading projects from concept through execution.</li></ul><ul><li>Ability to align strategy and goals with creative storytelling.</li></ul><ul><li>Experience A/B testing creative and using data to help inform creative decisions.</li></ul><ul><li>Detail-oriented with strong organization, presentation, and leadership qualities.</li></ul><ul><li>Always interested in learning and expanding skill set.</li></ul><ul><li>Experience working in digital-first environment, preferably on a digital product.</li></ul><ul><li>General understanding of product design and engineering process.</li></ul><ul><li>Up-to-date on best practices and trends within the creative and marketing industries.</li></ul><ul><li>Comfortable working remotely across multiple time zones.</li></ul><div>At Medium, we foster an inclusive, supportive, fun yet challenging team environment. We understand the value of diverse backgrounds and respect the healthy expression of diverse opinions. We embrace experimentation and the examination of all kinds of ideas through reasoning and testing. Come join us as we continue to change the world of digital media. Medium is an equal opportunity employer.</div>"}, {"id": 990283, "url": "https://remotive.io/remote-jobs/writing/technical-writer-990283", "title": "Technical Writer", "company_name": "Amplication", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-22T01:40:30", "candidate_required_location": "Israel", "salary": "", "description": "<p>At Amplication we are creating a new standard for development tools, building an open-source PaaS for cloud development. Amplication is eliminating all the boilerplate, repetitive coding, infrastructure, and other boring tasks while keeping the developers with full control over their code and apps.</p>\n<p>We are a small and dedicated team, working on making cloud development faster and easier for professional developers, with funding from top-tier investors in Israel and the Silicon Valley. </p>\n<p>We are a developer-first company, focused on community and button-up adoption, and our software is open-source. </p>\n<p>Work is either remote or in our office in Tel Aviv, Israel.</p>\n<p>Our offices are located in Tel Aviv, near HaShalom train station. </p>\n<div class=\"h2\">Your Role</div>\n<p>We are looking for a skilled Technical Writer who will produce high-quality documentation that contributes to the overall success of our products. You will work collaboratively with developers, quality engineers, product managers, and usability experts to make our products easier to use.</p>\n<p>You should possess outstanding writing and presentational skills and be able to efficiently collaborate with your peers. We also expect you to have decent experience with IT systems and to be interested in learning something new. </p>\n<div class=\"h2\">Your job will include:</div>\n<ul>\n<li>\n<p>Collaborate with internal teams to obtain an in-depth understanding of the product and the documentation requirements</p>\n</li>\n<li>\n<p>Create high-quality documentation that meets applicable standards and is appropriate for its intended audience</p>\n</li>\n<li>\n<p>Write plain, detailed, and straightforward user interface text, online help, and developer guides</p>\n</li>\n<li>\n<p>Prepare tutorials to help end-users use a variety of applications</p>\n</li>\n<li>\n<p>Analyze existing and potential content, focusing on reuse and single-sourcing opportunities</p>\n</li>\n<li>\n<p>Develop and maintain the information architecture</p>\n</li>\n<li>\n<p>Write and review blogs and other marketing material</p>\n</li>\n</ul>\n<div class=\"h2\">Requirements:</div>\n<ul>\n<li>\n<p>2+ years' experience of working as a Technical Writer or other relevant position</p>\n</li>\n<li>\n<p>Significant experience in creating quality documentation with an attention to detail</p>\n</li>\n<li>\n<p>Strong ability to quickly grasp complex technical concepts and explain them</p>\n</li>\n<li>\n<p>Excellent written English skills</p>\n</li>\n</ul>\n"}, {"id": 993221, "url": "https://remotive.io/remote-jobs/writing/grant-writer-993221", "title": "Grant Writer", "company_name": "Precious Project Inc.", "category": "Writing", "tags": [], "job_type": "part_time", "publication_date": "2021-11-21T01:40:32", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>Mission</strong></p>\n<p>The mission of Precious Project is to provide high-quality education and care to orphaned and vulnerable children in rural Tanzania. We partner with the local community to provide a primary school, children's home, organic farm, and agricultural practices all grounded in sustainable environmental principles. Precious Project also supports women's empowerment groups that foster economic self-sufficiency. Precious Project is entering a new phase in its growth with the opening of a newly constructed secondary school in January 2022.  </p>\n<p>Precious Project is a U.S. registered 501(c)(3) non-profit organization that functions as a grantmaker to a registered NGO in Tanzania.  </p><p><br></p><p>Precious Project is seeking an experienced and enthusiastic Grant Writer with a track record of success to identify, prepare, and submit grant proposals to government agencies, corporations, and philanthropic foundations to secure funding for the organization.  The Grant Writer will maintain existing and identify new funding opportunities, develop, and organize the yearly calendar and generate grant progress reports.  Operating under the oversight of the Director of Development, the Grant Writer will create a plan, submit grant applications and gain approval for grants that will achieve these goals.</p>\n<p><strong>Responsibilities</strong></p>\n<p>The Grant Writer will assist in the planning and implementation of a multi-year, comprehensive fundraising effort to significantly increase philanthropic revenues from corporations and foundations to support the Precious Project mission and vision.</p>\n<p><strong><em>Grant Writing</em></strong></p>\n<ul><li>         Responsible for the management of all grants within the organization.</li><li>         Write high-quality grant proposal narratives, applications, and supporting documents for federal and state government grants, public/private foundation funders, and other sources when applicable.</li><li>         Create a concise system for tracking grant submission and reporting timelines to ensure deadlines are met.</li><li>         Write and submit all grant report requirements as requested.</li><li>         Work closely with the Director of Development and Board of Directors to develop an annual grants strategy.</li><li>         Create and maintain a grant calendar highlighting deadlines and reporting dates.</li><li>         Coordinate and follow-ups on the progress of submitted proposals.</li><li>         Prepare quarterly grant reports for the Board of Directors.</li><li>         Track grant-related activity by entering interactions and strategies into our database.</li><li>         Assists the team externally with significant foundation funders and foundation prospects on phone calls and meetings. Participates in these meetings, and other cultivation and solicitation activity.</li></ul>\n<ul>\n<li>Determines      proposal concept by identifying and clarifying opportunities and needs,      studying requests for proposal (RFPs), and leading strategy meetings.</li>\n</ul>\n<ul>\n<li>Actively researches new funding      opportunities.</li>\n</ul>\n<ul>\n<li>Work with the Director      of Finance and Operations to      compile financials and draft the budget narratives.</li>\n<li>Manage the      proposal submission process to ensure timely submission of all required      materials.</li>\n</ul>\n<p><strong><em>Other</em></strong></p>\n<ul><li>         Collaborate with the Director of Finance and Operations on grant-related budgets and budget narratives to align fundraising efforts with financial progress and operating budgets. </li><li>         Collaborate with staff and Board of Directors to maintain cloud-based project management tools, to ensure organizational workflow efficiency. </li><li>         Attend a bi-weekly Zoom meeting with the Director of Development to discuss grant research progress, new grant opportunities, and communication initiatives.</li></ul>\n<ul>\n<li>Maintain      appropriate levels of communications to accomplish objectives. </li>\n</ul>\n<ul>\n<li>Other      duties as assigned in keeping with our mission and values.</li>\n</ul>\n<p><strong>Qualifications </strong></p>\n<ul>\n<li>Bachelor's      degree in English, journalism, international development, public      relations, non-profit management, or communications is preferred.</li>\n<li>Excellent writing, verbal, proofreading,      editing, and professional email communication.</li>\n<li>Minimum of 5+      years of experience in professional grant writing is preferred, to ensure the level of experience      and commitment we are looking for and expect.</li>\n<li>Flexible and self-motivated.</li>\n</ul>\n<ul><li>         Detail-oriented, with the ability to prioritize under deadlines.</li><li>         Proficient in Microsoft Office products, specifically Word, Excel, as well as Internet search tools.</li><li>         Previous experience and track record in research and/or grant writing.</li></ul>\n<ul>\n<li>Passionate      commitment to poverty alleviation in the developing world.</li>\n<li>Exceptional      oral and written communications skills, with a strong ability to articulate      programs to individuals, as well as small and large groups. </li>\n<li>Experience      in working collaboratively with other staff and the board of directors to      build and maximize a small non-profit organization. </li>\n<li>Willingness      to be flexible, take project direction, and complete assignments ahead of the deadline.</li>\n<li>Outstanding      work ethic, flexibility, and sense of humor.</li>\n<li>Curiosity      and demonstrated sensitivity to cultural differences. </li>\n<li>Ability      to work independently from home using cloud-based technology</li>\n<li>Experience      with the Network For Good donor management system, MailChimp, and Dropbox a      plus.</li>\n</ul>\n<p><strong>Additional Details</strong></p>\n<ul><li>         Part-time – 20 hours a week</li><li>Salary negotiable based on experience.   $25-$30 hr.</li><li>         100 % Remote</li><li>         Travel Required:  None</li><li>          Physical requirements: None</li><li>         Hazards or weather exposure: None</li><li>         Supervisory Responsibility:  None</li><li>         Precious Project Inc. is an equal opportunity employer and does not discriminate based on age, race, gender, or religious belief.</li></ul>\n"}, {"id": 995060, "url": "https://remotive.io/remote-jobs/writing/ux-content-writer-995060", "title": "UX Content Writer", "company_name": "Krisp", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-20T17:45:51", "candidate_required_location": "Europe Only", "salary": "", "description": "<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p>At Krisp, we build products to enhance professional and effective communication for everyone. Krisp mutes background noise bi-directionally during calls, becoming a virtual microphone and speaker within Windows, Mac OS. Our team is defining the future for remote employees' voice and video communication.Krisp is an award winning product, loved throughout the world.<br>Krisp received 6 prestigious awards in the last 3 years:</p>\n<ul>\n<li>Webby Awards in Productivity and Collaboration 2021</li>\n<li>Gartner Cool Vendor 2020</li>\n<li>TIME 100 Best Inventions 2020</li>\n<li>Forbes Cloud 100 Rising Star 2020</li>\n<li>Forbes AI 50 most promising AI startup 2020</li>\n<li>Product of the Year on Product Hunt 2018</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong>The Role:</strong></p>\n<p>We at Krisp are looking for a writer to team up with our growth pods and deliver a copy that focuses on the user experience, their optimal journey and is backed by quantitive and qualitative data.</p>\n<p>Krisp is a new category builder in noise cancelling and communication enhancement field which means there are plenty of challenges in crafting the perfect story, micro copy that is concise, informative but also creative.</p>\n<p>Krisp's missions is to make everyone an effective communicator and we are sure you ,like no one else, are passionate about it.</p>\n<p>You are also someone who is passionate about developing strategies based on insights from real people, has the proficiency in their craft to turn these insights into appealingly designed copy and product.</p>\n<p>Our team's work fuels the growth of our business, so come prepared to work hard, contribute ideas and be resourceful.</p>\n<p><strong>What You'll Do:</strong></p>\n<ul>\n<li>Write clear and concise content across multiple touch points (including email drip campaigns, landing pages, titles, labels and navigational elements)</li>\n<li>Create email templates for product drip campaigns and work with the team to optimize for the impact on the certain area/metric</li>\n<li>Use CRM tools to help with email campaign experiments</li>\n<li>Offer a content strategy perspective and influence strategic decisions across and within products to improve the overall experience and ensure consistency across platform</li>\n<li>Work with data team and analytic tools to subtract data than can drive a hypothesis behind a crafted copy</li>\n<li>Work with designers on prototype testing. </li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<p><strong>What We’re Looking For:</strong></p>\n<ul>\n<li>5+ years professional writing experience</li>\n<li>Excellent writing and editing skills</li>\n<li>Experience writing content for web/mobile products</li>\n<li>Experience writing emails, landing pages, or editorial content</li>\n<li>Experienced at writing or editing content for the web and mobile experiences, as a UX writer, information architect, content strategist, or similar. Experience designing for B2B and SaaS tools are big plus.</li>\n<li>Proven ability to collaborate successfully with cross-­functional partners</li>\n<li>A growth-mindset. You're open and receptive to feedback, and can adapt quickly in a fast-paced environment.</li>\n<li>Solid understanding of email marketing and social channels</li>\n<li>Portfolio of writing samples.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p><strong>Benefits at Krisp:</strong></p>\n<ul>\n<li>Competitive compensation</li>\n<li>Stock options</li>\n<li>Learning and development assistance</li>\n<li>Health, dental and vision insurance</li>\n<li>Paid Time Off and Sick Time Off</li>\n<li>Paid Parental Leave</li>\n<li>Maternity Leave Top-up</li>\n<li>Gym reimbursement</li>\n<li>Referral bonus program</li>\n<li>Work from forest (remote work initiatives)</li>\n</ul>\n<p><br><strong>Krisp is an Equal Opportunity Employer:</strong></p>\n<p>All applicants are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation. We do not tolerate discrimination or harassment of any kind. All employees and contractors of Krisp treat each other with respect and empathy.</p>\n<p><em>All your information will be kept confidential according to EEO guidelines.</em></p>\n"}, {"id": 988600, "url": "https://remotive.io/remote-jobs/writing/b2b-sales-copywriter-988600", "title": "B2B Sales Copywriter", "company_name": "Web Profits", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-11-19T13:45:07", "candidate_required_location": "Australia, the US, and Singapore", "salary": "", "description": "<p>We are looking for a B2B copywriter to join our team to write sales copy for landing pages, websites and email sequences. We only work with the best, and can offer either full-time or contract work for the right person.</p>\n<p><strong>Requirements</strong></p>\n<p>It's simple...</p>\n<p>What we want to see are examples of work you have done for challenger brands that have a strong digital presence where your copy has been used in key assets for digital campaigns.</p>\n<p>You need to be able to quickly understand our clients' business and create compelling 'hooks' that talk directly to the pain points of their customers, and craft a sales message that talks to that audience in the language they're used to and compels them to take action on that page.</p>\n<p>Speed of execution is a must as the volume is high, and expectations of quality are even higher.</p>\n<p>If that sounds like you, send through 3 examples of B2B copy you've written that fits this brief.</p>\n<p><strong>Benefits</strong></p>\n<p>Webprofits employs the best minds in strategy, marketing, and technology throughout Australia, the US, and Singapore and delivers on a 15-year history at the frontlines of digital marketing. We are dedicated to understanding our clients’ businesses and delivering measurable results, with our team working closely with clients to tailor digital growth efforts that will reach and resonate with their specific audiences and deliver growth.</p>\n<p>Webprofits is a remote-first team, with a culture that promotes transparency, learning and excellence. Webprofits prides itself on its ability to always find a better and smarter way and we share that through our Growth Manifesto Podcast.</p>\n"}, {"id": 986755, "url": "https://remotive.io/remote-jobs/writing/environmental-justice-fellow-986755", "title": "Environmental Justice Fellow", "company_name": "Grist", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-17T05:40:37", "candidate_required_location": "USA Only", "salary": "", "description": "<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p>Grist is a nonprofit, independent media organization dedicated to highlighting climate solutions and uncovering environmental injustices. Since 1999, we have used the power of journalism to engage the public about the perils of the most existential threat we face. Now that three-quarters of Americans recognize that climate change is happening, we’ve shifted our focus to show that a just and sustainable future is within reach. Grist’s editorial team leads the conversation on climate change and climate action, producing daily news and analysis pieces, as well as video and longform stories, on humanity’s attempt to grapple with the most critical issue it faces.</p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p>Grist is seeking an Environmental Justice Fellow to join our Editorial team. This fellowship will run for six months, beginning Jan 31, 2022. The fellow will report to the articles editor.</p>\n<p>With the mentorship and support of Grist’s editorial staff, the environmental justice fellow will report on the connections between social inequality and the environment. You will explore the ways in which the environmental movement can become more inclusive, especially in the current moment — and how communities of color are developing new ways to fight for cleaner air and water and safer neighborhoods. We’re especially interested in journalism that identifies communities and people working on homegrown solutions.</p>\n<p><strong>THE GRIST FELLOWSHIP PROGRAM</strong></p>\n<p>As an environmental justice fellow at Grist, you will be a part of our larger fellowship program, which aims to provide a formative experience in a geographically distributed but tight-knit newsroom and professional development for early-career journalists. We will encourage full participation in staff discussions and meetings and seek input on issues large and small. </p>\n<p>Fellows can be based anywhere in the United States. Global health conditions permitting, at a future date there may be opportunities to work out of Grist’s Seattle office or New York co-working space. All fellows who work remotely will be encouraged to report on stories in their home community.</p>\n<p><strong>DUTIES &amp; RESPONSIBILITIES</strong></p>\n<ul>\n<li>\n<p>Identify and pitch ideas for stories that look at the effects of climate change and pollution on marginalized communities — as well as what those communities are doing to protect themselves</p>\n</li>\n<li>\n<p>Write multiple stories — quick news or analysis pieces — each week</p>\n</li>\n<li>\n<p>Other duties, like research, web production, and fact-checking, may be assigned from time to time</p>\n</li>\n<li>\n<p>Pitch and write one enterprise/feature story in the second half of your fellowship</p>\n</li>\n<li>\n<p>Contribute periodically to larger projects</p>\n</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<ul>\n<li>\n<p>Four-year degree, or equivalent professional experience</p>\n</li>\n<li>\n<p>Strong understanding of Grist’s brand</p>\n</li>\n<li>\n<p>Demonstrated familiarity with environmental and climate justice</p>\n</li>\n<li>\n<p>Demonstrated experience in research or reporting</p>\n</li>\n<li>\n<p>Demonstrated comfort with writing on deadline</p>\n</li>\n<li>\n<p>Ability to make a full-time, six-month commitment</p>\n</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p><strong>BENEFITS</strong></p>\n<ul>\n<li>\n<p>This fellowship is a paid, six-month opportunity ($3334/month) for early-career journalists</p>\n</li>\n<li>\n<p>Fellows are eligible for Grist health benefits coverage, including medical, vision, and dental</p>\n</li>\n<li>\n<p>Fellows come away with six months of solid newsroom experience, a body of clips, and fluency in climate and environmental justice issues</p>\n</li>\n<li>\n<p>Fellows across Grist meet regularly as a cohort with members of the editorial staff to develop skills and content knowledge specific to climate journalism</p>\n</li>\n<li>\n<p>Through our Newsroom Training Series, fellows are also trained on a range of crucial skills, from filing FOIA requests to audio/video script-writing</p>\n</li>\n<li>\n<p>Fellows benefit from full integration into the workings of a busy and exciting nonprofit media organization</p>\n</li>\n</ul>\n<p><strong>THE APPLICATION</strong></p>\n<p>Applicants must submit the following application materials.  <u><strong>Applications without both a resume and cover letter will not be considered.  </strong></u></p>\n<ol>\n<li>\n<p>Resume</p>\n</li>\n<li>\n<p>Cover letter, including links to two writing samples. We are looking for a succinct, thoughtful cover letter that explains what you think are the most important environmental news and politics topics and stories to follow in the next six months — and why you're the right person to cover them for Grist. Please also include links to two writing samples within your cover letter (or alternatively, append them to the end of your cover letter).</p>\n</li>\n</ol>\n<p><strong>SUBMISSION INSTRUCTIONS:  <em>PLEASE READ</em></strong></p>\n<p>Cover letters must be uploaded as a separate attachment via Smart Recruiter. Please include “Environmental Justice Fellow” in the document title. Incomplete applications will not be considered. <u><strong>For fellowships that begin January 31 2022, please submit applications by November 15, 2021. </strong></u></p>\n<p>No phone calls, please.</p>\n<p> </p>\n<p><strong> </strong><em>Cultivating an inclusive staff is central to Grist’s focus on advancing equity. We’re interested in hearing from people who can work with diverse colleagues of varied experience. Candidates of all backgrounds are strongly encouraged to apply. Grist is an equal-opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</em></p>\n<p><br> </p>\n"}, {"id": 966278, "url": "https://remotive.io/remote-jobs/writing/associate-editor-investor-education-966278", "title": "Associate Editor Investor Education", "company_name": "Stockopedia", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-14T21:45:00", "candidate_required_location": "UK Only", "salary": "", "description": "<p>Stockopedia.com, the award-winning online stock market research service, is looking for an <strong>Associate Editor Investor Education</strong> to join the team. To succeed you must be passionate about the stock market and have a strong drive to help educate the investment community.</p>\n<p>You’ll lead the development of a body of work - articles, research, ebooks &amp; guides - across stock selection, factor investing, trend following, portfolio construction &amp; management and more. You’ll act as “player coach” for this area, acting as a primary contributor while working with others (internal staff and freelancers) to build the body of work. You’ll have all of Stockopedia’s powerful data &amp; research insights as sources for new material.</p>\n<p>This is an outstanding opportunity for a skilled content creator with a love of the stock market to join a rapidly growing international B2C brand. Join us and see your work have immediate tangible impact.</p>\n<p><strong><em>(Note: Market commentary is outside the scope of this role).<br></em></strong></p>\n<p> </p>\n<div class=\"h3\">Responsibilities</div>\n<ul>\n<li>Shape the content strategy for investor education and consideration content to elevate Stockopedia’s position as a “trusted authority” amongst private investors.</li>\n<li>Create, edit and curate content to develop a growing portfolio of evergreen content.</li>\n<li>Lead content calendar scheduling and enforcing deadlines, working with analysts, writers and marketing campaign managers to deliver on briefs/projects.</li>\n<li>Collaborate with data, product and marketing teams to find compelling content angles &amp; topics.</li>\n<li>Leverage in-house and freelance writers / analysts through well drafted briefs.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Proven experience in a writing &amp; editorial position, with knowledge of content briefing and publishing workflows. (ideally within a financial regulator environment)</li>\n<li>You are an active investor &amp; know the private investor mindset. Domain expertise is a must.</li>\n<li>Exceptional ability as a content developer (writing &amp; other formats) &amp; editor.</li>\n<li>You understand which content is required at different phases of a private investor’s journey (awareness, consideration, onboarding, retention) and related SEO principles.</li>\n<li>A CFA qualification or equivalent (highly desirable).</li>\n<li>Experience building and managing a roster of freelancers (desirable)</li>\n<li>Bsc/BA in English, Finance or similarly relevant field.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>There are many benefits to working at Stockopedia.com but the best are the great work/life balance principles at our core.</p>\n<ul>\n<li>Work Flexibility - we provide complete work flexibility - whether you wish to be fully remote, part remote or wish to work full time from our Oxford office.</li>\n<li>Time Off - Great results need rest. With 24 days holidays plus bank holidays you'll have ample time to climb mountains or kick back the tires.</li>\n<li>Sharpen the saw - we'll cover the costs of any education and training you want to take.</li>\n<li>Expenses - expense every lunch that builds connections &amp; any book that improves the mind. If it's work related we'll pay for it.</li>\n<li>Gear up - With a great gear budget for every hire we'll help you get all the tools you need to do your best work.</li>\n</ul>\n<p> </p>\n<p><em>When you apply for a job with us, we process some of your personal information. You can read about how we handle personal information in our candidate privacy policy <a class=\"external\" href=\"https://www.stockopedia.com/page/candidate-privacy-policy/\" rel=\"nofollow\">here</a>.</em></p>\n"}, {"id": 966279, "url": "https://remotive.io/remote-jobs/writing/equity-investment-analyst-writer-966279", "title": "Equity Investment Analyst / Writer", "company_name": "Stockopedia", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-13T21:40:45", "candidate_required_location": "UK Only", "salary": "", "description": "<p>Stockopedia.com, the award-winning online stock market research service, is looking for an <strong>Investment Analyst / Writer</strong> with strong domain expertise in equities to join the team and radically enhance our data-driven equity research.</p>\n<p>To succeed you must have expertise in the use of financial data for equity analysis, a proven track record of writing/research/publishing and an interest in how technology &amp; algorithms can be used to enhance the investment research process.</p>\n<p>You’ll be empowered to work closely with a dedicated team of developers and data analysts to create unique long and short form equity research insights to help investors make better and more timely decisions. These insights may span both written and graphical formats to be used in multiple use cases across our platform.</p>\n<p>This is an outstanding opportunity for a skilled analyst with interest in technology and a love of the stock market to join a growing international B2C brand. Join us and see your work have immediate tangible impact.</p>\n<p> </p>\n<div class=\"h3\">Responsibilities</div>\n<ul>\n<li>Spearhead the editorial development of equity research insights from Stockopedia’s data.</li>\n<li>Ideate, research and write compelling and actionable content across a wide range of data-driven topics relevant to private investors.</li>\n<li>Ensure the highest quality of investment analysis in our publishing.</li>\n<li>When required, support the editorial and marketing teams delivering other elements of our content strategy (research, ebooks &amp; guides, newsletter and more).</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Experience as Equity research analyst (prefered), or investment journalist - ideally within a financially regulated environment.</li>\n<li>You are an active investor &amp; know the investor mindset. Domain expertise is a must.</li>\n<li>Highly numerate, a CFA qualification or equivalent is highly desirable.</li>\n<li>Interest in technology and leveraging algorithm powered content.</li>\n<li>Understand marketing SEO principles (nice to have - we can teach you).</li>\n<li>You are a team player, obsessed over the details and extremely well-organised.</li>\n<li>BA+ in English, History or Politics or other essay-driven degree favourable, but should be backed up with strong numeracy.</li>\n<li>BSc+ in Maths, Finance, Science or other numerate subjects is a big plus, but should be backed up with relevant writing experience.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>There are many benefits to working at Stockopedia.com but the best are the great work/life balance principles at our core.</p>\n<ul>\n<li>Work Flexibility - we provide complete work flexibility - whether you wish to be fully remote, part remote or wish to work full time from our Oxford office.</li>\n<li>Time Off - Great results need rest. With 24 days holidays plus bank holidays you'll have ample time to climb mountains or kick back the tires.</li>\n<li>Sharpen the saw - we'll cover the costs of any education and training you want to take.</li>\n<li>Expenses - expense every lunch that builds connections &amp; any book that improves the mind. If it's work related we'll pay for it.</li>\n<li>Gear up - With a great gear budget for every hire we'll help you get all the tools you need to do your best work.</li>\n</ul>\n<p> </p>\n<p><em>When you apply for a job with us, we process some of your personal information. You can read about how we handle personal information in our candidate privacy policy <a class=\"external\" href=\"https://www.stockopedia.com/page/candidate-privacy-policy/\" rel=\"nofollow\">here</a>.</em></p>\n"}, {"id": 966581, "url": "https://remotive.io/remote-jobs/writing/freelance-content-writer-dutch-966581", "title": "Freelance Content Writer - Dutch", "company_name": "Camaloon", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-12T09:42:39", "candidate_required_location": "Europe Only", "salary": "", "description": "<p><strong>Description</strong></p>\n<p>Camaloon is an international e-commerce based in Barcelona that offers the customization of a wide variety of promotional merchandise (bags, notebooks, cups, key chains, badges, stickers, magnets, t-shirts...) for companies and individuals.</p>\n<p>We are seeking smart, talented, and hardworking<strong> Content Writers</strong> to collaborate as a freelancer in our<strong> Marketing</strong> team.</p>\n<p>You will be responsible for the creation of Camaloon’s corporate image, branding and social network content! In this role, you will be tasked with writing content for our entire website such as blogs, product descriptions, and webpage content. You will be using SEO metrics and digging into large datasets to create quality content, with the goal of growing and building our website.</p>\n<p> </p>\n<p><strong>Duties and Responsibilities</strong></p>\n<ul>\n<li>Research industry-related topics (combining online sources, interviews and studies)</li>\n<li>Write clear blog posts and marketing copy to promote our products/services</li>\n<li>Prepare well-structured drafts with SEO guidelines in mind using Content Management Systems</li>\n<li>Proofread and edit blog posts before publication</li>\n<li>Submit work for input and approval</li>\n<li>Coordinate with marketing and design teams to illustrate articles</li>\n<li>Conduct simple keyword research if needed and use SEO guidelines to increase web traffic</li>\n<li>Ensure all-around consistency (style, fonts, images and tone)</li>\n</ul>\n<p><br><strong>Eligibility</strong></p>\n<ul>\n<li>Proven work experience as a Content Writer or Copywriter</li>\n<li>Portfolio of published articles in Dutch</li>\n<li>Experience doing research using multiple sources</li>\n<li>Familiarity with web publications</li>\n<li>Excellent writing and editing skills in <strong>Dutch</strong> language and professional English to be able to connect with the team</li>\n<li>Hands-on experience with Content Management Systems (WordPress)</li>\n<li>High degree of accuracy, strong timeline management, follow-through and attention to detail</li>\n<li>Comfortable in a multifaceted, fast-paced environment in which projects can be switched based on prioritization</li>\n<li>You are Online passionate and Culturally aware</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Working in a rapidly growing company where you can really make a difference</li>\n<li>Remote work</li>\n<li>Flexible shift</li>\n<li>Dynamic and Multicultural environment</li>\n<li>Weekly team meetings</li>\n<li>Excellent products and an attractive industry</li>\n</ul>\n<p> </p>\n<p>We are seeking to build up a Marketing team that will help us retain clients and grow. Would you like to work in an energetic and fresh environment? Hype your career! Join us.</p>\n<p> </p>\n<p><em>Camaloon is an equal opportunities employer and welcomes applications from all sections of society and does not discriminate on grounds of race, religion or belief, ethnic or national origin, disability, age, citizenship, marital, domestic or civil partnership status, sexual orientation or gender identity. We believe passionately that employing a diverse workforce is central to our success.</em></p>\n<p>#CamaloonCareers</p>\n<p>Find more information on the company: <a class=\"external\" href=\"http://www.camaloon.com/\" rel=\"nofollow\" target=\"_blank\">www.camaloon.com</a></p>\n<p>By applying for this position you will be included in our itnig talent pool, accessible by all itnig startups. We will use your personal data for recruitment purposes only and will contact you should we find any other position than this that might be of interest to you and for which we would like to consider your candidature. For further information, you can find our privacy policy here: <a class=\"external\" href=\"https://itnig.net/privacy-policy\" rel=\"nofollow\" target=\"_blank\">https://itnig.net/privacy-policy</a>.You can ask us at any time to delete your CV and contact information from our database by contacting us at work@itnig.net</p>\n"}, {"id": 959883, "url": "https://remotive.io/remote-jobs/writing/advertorial-monetization-editor-959883", "title": "Advertorial/Monetization Editor", "company_name": "ConsumerTrack ", "category": "Writing", "tags": [], "job_type": "", "publication_date": "2021-11-11T05:40:58", "candidate_required_location": "USA Only", "salary": "", "description": "<p>ConsumerTrack™ is unique in the digital marketing and media industry - we combine marketing, digital, content and fintech. Our performance based approach increases brand awareness and generates targeted audience engagement on our internal web properties and partner sites.</p><p><a class=\"external\" href=\"https://www.consumertrack.com/what-we-do/\" rel=\"nofollow\" target=\"_blank\">Learn More About What We Do</a></p><p>GOBankingRates.com, a division of ConsumerTrack Inc., has an immediate need for an Editor who specializes in monetization and advertorial content to join our Content Team. This individual will leverage their sincere curiosity about how the economy and personal finance impact everyday life, investigative skills, knowledge of popular culture, advertorial expertise, and overall digital know-how to take articles and videos and use them to collaborate with our business and media teams. <br>We need a stand-out editor who is comfortable analyzing data and dissecting complex information as they look to build our cross-team partnerships. He/she will work directly with a multitude of expert in-house and contributing writers and editors to publish and share relevant advertorial and sponsored content.<br></p><p><strong>How do you make an Impact? </strong></p><p>This role is heavily focused on utilizing our fast-paced content production to build the relationship with our in-house media team and achieve growth month over month. This Editor will be expected to:</p><ul> <li>Outline and follow a defined strategy that helps to increase volume and boost overall engagement</li> <li>Tell a visual story and be able to quickly source photos to pair with content in production</li> <li>Adapt new content in production to align with changing audience needs and industry trends to achieve monthly growth goals</li> <li>Work across teams to prioritize initiatives and promote growth</li> <li>Contribute to the editorial content team with time dedicated to editing, brainstorming and data analysis</li> </ul><p><strong>Requirements</strong></p><p><strong>What do you bring to us? </strong></p><ul> <li>BA/BS from a four-year accredited university or college, preferably with a degree in Journalism, Marketing, and/or a similar field – or similar equivalent experience</li> <li>Full command of grammar and journalistic best practices.</li> <li>Experience using analytics tools to make decisions.</li> <li>You’re an idea generator who can think of new, fresh ways to package content and is used to regularly in the context of advertorial promotions and sponsorships.</li> <li>You have great time management and strong organizational and people skills, plus a strong attention to detail.</li> </ul><p><br></p><p><strong>Benefits</strong></p><ul> <li>Competitive salary with excellent growth opportunity; we pride ourselves in having a team that exudes leadership, high initiative, creativity and passion.</li> <li>Awesome medical, dental and vision plans with heavy employer contribution</li> <li>Paid maternity leave and paternity leave programs</li> <li>Paid vacation, sick days and holidays</li> <li>Company funding for outside classes and conferences to help you improve your skills</li> <li>Contribution to student loan debt payments after the first year of employment</li> <li>401(k) -- employees can start contributing immediately. After the first year, CTI matches your contribution up to 4% of your salary</li> </ul><p>A note about our response to COVID -19 and our new norm: The world has changed and we know it’s important to adapt and to do our part to take care of our teams in this global pandemic. Our number one priority is to have our ConsumerTrackers feel safe, balanced and connected. We’re committed to providing our teams with the best resources and tools to navigate this new virtual world that we’re living in. We've also reinvented the ways in which we recognize, celebrate, and engage with each other to keep our culture strong!</p><p>Here’s a peek into our world at ConsumerTrack -</p><ul> <li>Our teams are working remotely 100% for the foreseeable future and have flex time. We’re in the digital media space so we’re mobile and flexible!<ul><li>*Option to work from an office (if you need to get away!)</li></ul> </li> <li>Tools &amp; resources are available to keep our team connected across North America. (JIRA, Trello, Airtable, Slack, Zoom and so much more!)</li> <li>To keep our community of ConsumerTrackers engaged and connected, virtual team building events are held weekly and monthly.</li> <li>For wellness and balance, weekly virtual fitness classes such as yoga are available.</li> <li>To care for the local communities that we’re a part of across the U.S our team members host socially distanced philanthropic events every quarter.</li> <li>And most importantly, we’ve committed to consistent and transparent communication to help us all stay informed, engaged and to keep us on our path to success and #greatness.</li> </ul><p><em>We are an equal-opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.</em></p><p><br></p><p>#LI-REMOTE<br></p>"}, {"id": 961570, "url": "https://remotive.io/remote-jobs/writing/technology-copywriter-961570", "title": "Technology Copywriter", "company_name": "Kuno Creative", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-10T01:54:05", "candidate_required_location": "USA Only", "salary": "", "description": "<p>*This is a remote position in the U.S. operating primarily in the ET and CT time zones.</p><div class=\"h3\">About Kuno Creative<br> </div><p>Are you interested in becoming an employee-owner at a leading digital marketing agency and Diamond HubSpot partner? We are <a class=\"external\" href=\"https://www.nceo.org/article/working-esop\" rel=\"nofollow\">employee-owned,</a> continuously on the frontlines of buyer engagement. We do marketing that matters, helping companies make the world a better place. This mission penetrates our daily lives and well-being, and, ultimately, enables us to help clients achieve measurable results. All company profits are distributed to Kuno employees each year.</p><div class=\"h3\">Responsibilities<br> </div><p>As a technology copywriter, you will help Kuno technology/SaaS clients tell their brand stories. You will interview stakeholders, create buyer personas and develop messaging, which will inform the writing of content assets, emails, advertisements and more. </p><p>Your goal is to help our tech clients build brand awareness, get found online, and capture and nurture leads, and request demos to grow revenue.</p><p>You will work directly with internal account consultants and be “client-facing,” responsible for presenting, strategizing and communicating effectively with clients. Attention to detail and strong communication skills are a must.</p><p><strong>General Responsibilities</strong></p><ul> <li>Create and manage editorial schedules for several technology clients</li> <li>Conduct client interviews and build strategy from information garnered</li> <li>Manage other writers when additional help to complete deliverables is needed</li> <li>Write at least one blog post per month for Kuno</li> <li>Help to plan and execute marketing campaigns, paid ads, emails and video scripts</li> <li>Research, strategize &amp; create content to capture leads (eBooks, whitepapers, etc.)</li> <li>Create content to nurture leads through the sales funnel (emails, CTAs, landing pages)</li> <li>Measure the success of content and materials produced and use the data to make recommendations and develop best practices to maximize the effectiveness of future materials</li> <li>Service multiple clients concurrently while meeting deadlines</li> <li>Input client blogs into HubSpot</li> </ul><p><strong>Requirements</strong></p><p><em>Education &amp; Training</em><br></p><p>Kuno uses <a class=\"external\" href=\"https://www.hubspot.com/?__hstc=68161230.de80ffb4aec79683831d676d6031728d.1628605489076.1630520261235.1630586902247.23&amp;__hssc=68161230.6.1630586902247&amp;__hsfp=814967395\" rel=\"nofollow\">HubSpot</a> sales and marketing software for most clients. Experience with HubSpot is helpful but not required. You will be given access to the <a class=\"external\" href=\"https://academy.hubspot.com/?__hstc=68161230.de80ffb4aec79683831d676d6031728d.1628605489076.1630520261235.1630586902247.23&amp;__hssc=68161230.6.1630586902247&amp;__hsfp=814967395\" rel=\"nofollow\">HubSpot Academy</a> online courses for ongoing training and education. During the first six months of employment, you will be asked to complete several video courses that provide certifications for a variety of topics that will help you have the most success in this position. Most courses are composed of a few hours of watching videos followed by a short exam of around 50 multiple-choice questions. The certifications need to be renewed annually. </p><p><em>Job-Specific Requirements:</em></p><ul> <li>Knowledge of and experience writing about software development, information technology (IT), artificial intelligence (AI), data management, and cloud technologies</li> <li>Strong organizational skills and attention to detail</li> <li>Experience in marketing and/or communications writing</li> <li>Significant experience in making complex concepts easily understood and remembered</li> <li>Demonstrated ability to write clear, concise, conversational, grammatically correct documents</li> <li>Able to thrive in a fast-paced, deadline-driven environment</li> <li>This is a remote position and requires the ability to work from home using online meeting software such as Zoom, GoToMeeting or WebEx. </li> <li>Experience working with content management systems (CMS) such as WordPress or HubSpot is a plus but not required</li> </ul><p><strong>Benefits</strong></p><ul> <li> Healthcare (medical, dental, vision, short/long-term disability, and life insurance)</li> <li>Paid Time Off (sick and  vacation time) in addition to ten paid national holidays </li> <li>Six weeks paid medical/maternity/compassionate care leave; four weeks parental leave (for births, adoptions, or foster care placement)</li> <li>401k with company match, fully vested</li> <li>Employee-owned company with profit-sharing</li> </ul><p><strong>Compensation</strong><br></p><ul> <li>Based on industry knowledge, geography (cost of living), and work experience in comparison to other candidates at the same job level</li> <li>Salary range: $60,000 - $75,000.</li> </ul><div class=\"h3\"><br></div><div class=\"h3\">Mission<br> </div><p>Kuno Creative’s mission is to help companies we believe in get results, and our success is fostered by our core values: Team Oriented... Proactive...Take Ownership.   If you thrive in a collaborative, relationship-building environment, take initiative and use innovation to drive success, deliver quality work and take action to constantly improve, then we want you on our team! </p><div class=\"h3\">Diversity &amp; Inclusion<br> </div><p>Kuno is proud to be an equal opportunity employer and is committed to creating a diverse environment. We are fully focused on promoting equality, and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, disability, age, or veteran status. </p><div class=\"h3\">Geography<br> </div><div class=\"h3\"></div><p>Kuno has a fully remote workforce consisting of the top talent across the country. This position is open to anyone authorized to work in the United States without sponsorship who is residing in the United States.</p><p><br></p><p><br></p><p><br></p>"}, {"id": 963260, "url": "https://remotive.io/remote-jobs/writing/content-editor-963260", "title": "Content Editor", "company_name": "YouGov", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-09T01:39:54", "candidate_required_location": "USA Only", "salary": "", "description": "<br><br><div class=\"h3\">Company Description</div><p><strong>About</strong></p><p>YouGov Chat is a new way for the public to share their views on the topics that matter.</p><p>Every day, we round up the biggest political and current affairs stories in the UK and US and ask the public to share their opinion.</p><p>Our team of in-house writers use our unique chatbot technology to write ‘chats’ that are interactive, interesting and worthwhile for people to engage with. </p><p>Hundreds of thousands of people are now using YouGov Chat to stay informed, share their opinion and see what others have to say.</p><br><br><div class=\"h3\">Job Description</div><p><strong>The Role</strong></p><p>As we launch a new content proposition - DailyChat - we are looking to expand our team of talented and curious content editors to drive our mission forward.</p><p>You will be responsible for pitching, researching, writing and editing content, working directly with the Head of Content and the rest of the editorial team. You should be able to write clearly and informatively about the day’s biggest talking point and think laterally about the most important and interesting questions to ask our audience.</p><p>The right candidate will be an innovative thinker, passionate about politics and current affairs, with experience writing sharp, high quality content.</p><p><u>What You Will Be Doing</u></p><ul><li>Write content (using our in-house CMS) for our DailyChat email newsletter.</li><li>Identify and pitch stories you think the American public have strong opinions on and will therefore appeal to the YouGov Chat audience.</li><li>Bring ideas to life in a succinct but engaging manner suitable for our unique ‘chat’ format.</li><li>This role mainly focuses on writing news and current affairs chats, but will also involve writing a few weekly chats on other interesting topics (health, entertainment, sport, persona).</li><li>Use analytics platforms to monitor the performance of your content post-publication, striving to hit ambitious audience targets.</li><li>Work with other team members to brainstorm ideas and sub-edit content.</li><li>Promote chats on social media platforms and monitor performance.</li><li>Think outside of the box to implement ideas and innovations to drive user growth and engagement.</li></ul><br><br><div class=\"h3\">Qualifications</div><p><u>What We Are Looking For</u></p><ul><li>A strong interest and knowledge of news, politics and current affairs in the USA.</li><li>Additional knowledge of news, politics and current affairs in the UK is a plus.</li><li>2-3 years of writing experience OR experience creating compelling content in other forms (e.g. blog, newsletter, Twitter, etc).</li><li>A passion for identifying the ‘big talking points’ and asking interesting questions.</li><li>Ability to write clear and engaging copy in the YouGov Chat style.</li><li>Excellent organisation skills and attention to detail.</li><li>Ability to deliver results, meet deadlines and manage time effectively.</li><li>Be comfortable wearing many hats as we build, adapt and deliver to meet our members’ needs</li><li>Applicant must be US based </li></ul><br><br><div class=\"h3\">Additional Information</div><p><u>What We Offer</u></p><ul><li>A competitive salary.</li><li>Equipment - whatever you need to succeed.</li><li>The opportunity to join the early stages of a new project initiative with ambitious plans.</li><li>Flexible/remote working</li></ul>"}, {"id": 981736, "url": "https://remotive.io/remote-jobs/writing/scientific-technical-writer-981736", "title": "Scientific Technical Writer", "company_name": "Colabra", "category": "Writing", "tags": [], "job_type": "part_time", "publication_date": "2021-11-06T21:08:23", "candidate_required_location": "", "salary": "", "description": "<p style=\"box-sizing: inherit; margin-bottom: 12px; line-height: 1.6; color: #000000; font-family: 'Inter var', sans-serif; font-size: 14px;\">Colabra's mission is to increase the world's scientific output.</p>\n<p style=\"box-sizing: inherit; margin-bottom: 12px; line-height: 1.6; color: #000000; font-family: 'Inter var', sans-serif; font-size: 14px;\">We're backed by top investors including Village Global, Builders, Inovia, Jude Gomila, the Technical Director of OpenAI, and founders of several biotech startups.</p>\n<p style=\"box-sizing: inherit; margin-bottom: 12px; line-height: 1.6; color: #000000; font-family: 'Inter var', sans-serif; font-size: 14px;\">We are looking for a contract Technical Writer passionate about documentation, scientific workflows, and data management.</p>\n<p style=\"box-sizing: inherit; margin-bottom: 12px; line-height: 1.6; color: #000000; font-family: 'Inter var', sans-serif; font-size: 14px;\">The ideal candidate will have professional experience in writing technical sales documents for scientific audiences.</p>\n<div class=\"h2\" style=\"box-sizing: inherit; margin-top: 24px; margin-bottom: 8px; font-size: 20px; font-weight: bold; line-height: 1.4; color: #000000; font-family: 'Inter var', sans-serif;\">Responsibilities</div>\n<ul style=\"box-sizing: inherit; margin-bottom: 12px; padding-left: 24px; line-height: 1.6; color: #000000; font-family: 'Inter var', sans-serif; font-size: 14px;\">\n<li style=\"box-sizing: inherit; margin-bottom: 6px;\">\n<p style=\"box-sizing: inherit; line-height: 1.6;\">Develop content for Colabra (help articles, case studies, release notes, and user guides) to be shared across a variety of communication channels (including social media, webinars, industry websites, Colabra's blog and <a href=\"https://www.colabra.app/community/\" rel=\"nofollow\" style=\"box-sizing: inherit; text-decoration: underline; outline-color: #d5d5d5;\" target=\"_blank\">researcher community</a>).</p>\n</li>\n<li style=\"box-sizing: inherit; margin-bottom: 6px;\">\n<p style=\"box-sizing: inherit; line-height: 1.6;\">Work closely with the founding team to brainstorm new topics, then write evergreen content that can be shared for lead generation and nurturing. Track the performance of the content to strategically select future topics for SEO and outreach.</p>\n</li>\n<li style=\"box-sizing: inherit; margin-bottom: 6px;\">\n<p style=\"box-sizing: inherit; line-height: 1.6;\">Become an expert in Colara and help to create product marketing content (including presentations, demos, and competitive positioning). Partner with the product team to support product releases with technical content that showcases the strengths of Colabra.</p>\n</li>\n</ul>\n<div class=\"h2\" style=\"box-sizing: inherit; margin-top: 24px; margin-bottom: 8px; font-size: 20px; font-weight: bold; line-height: 1.4; color: #000000; font-family: 'Inter var', sans-serif;\">Requirements</div>\n<ul style=\"box-sizing: inherit; margin-bottom: 40px; padding-left: 24px; line-height: 1.6; color: #000000; font-family: 'Inter var', sans-serif; font-size: 14px;\">\n<li style=\"box-sizing: inherit; margin-bottom: 6px;\">\n<p style=\"box-sizing: inherit; line-height: 1.6;\">3+ years in a biotechnology industry setting (ideally with laboratory experience in R&amp;D functions).</p>\n</li>\n<li style=\"box-sizing: inherit; margin-bottom: 6px;\">\n<p style=\"box-sizing: inherit; line-height: 1.6;\">1+ year of technical or scientific writing experience.</p>\n</li>\n<li style=\"box-sizing: inherit; margin-bottom: 6px;\">\n<p style=\"box-sizing: inherit; line-height: 1.6;\">Basic understanding of content SEO (you know what Google crawls through on a piece of content and incorporate that into your content).</p>\n</li>\n<li style=\"box-sizing: inherit; margin-bottom: 6px;\">\n<p style=\"box-sizing: inherit; line-height: 1.6;\">Solid knowledge of demand generation funnels and tactics used to drive conversion and growth.</p>\n</li>\n<li style=\"box-sizing: inherit; margin-bottom: 6px;\">\n<p style=\"box-sizing: inherit; line-height: 1.6;\">Exceptional editorial skills for interest-piquing content to support both short-form and long-form content pieces on social media, white papers, case studies, etc.</p>\n</li>\n</ul>\n", "company_logo_url": "https://remotive.io/job/981736/logo"}, {"id": 968038, "url": "https://remotive.io/remote-jobs/writing/content-editor-968038", "title": "Content Editor", "company_name": "QS", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-06T13:41:13", "candidate_required_location": "UK Only", "salary": "", "description": "<p>If you've got a love of writing, a nose for a good story and a drive to inspire an audience of millions then you could be a perfect fit for our Content Editor role. </p>\n<p>We're looking for an experienced writer and editor to join our Marketing team at QS Quacquarelli Symonds, a global higher education data and services company with a vision to empower a billion future learners.  </p>\n<p>Working within our Content team, you will be responsible for commissioning, writing, editing and publishing content across our two student-facing websites, TopUniversities.com and TopMBA.com. You'll be expected to contribute to content campaigns that are aligned with our editorial strategy, identifying new ways to grow our global audience and help millions of students make crucial decisions about their education and future career. </p>\n<p>Through your content, you'll support wider QS initiatives, such as our range of university and business school rankings and our in-person and virtual events. Collaborating between key teams will be essential, including the wider content team, design team, product team, social media team, acquisitions &amp; engagements team, PR, data teams and more. </p>\n<p>You'll be a trusted ambassador for our brand voice and style guide, raising the quality of our written output, incorporating SEO into all your work and using internal performance data to identify areas of improvement within our existing content output. </p>\n<p>Sitting within the Content Team, this role will report into the Senior Editorial Lead. </p>\n<p><strong><em>This role is open to remote working, based in the UK </em></strong></p>\n<p><strong>Key responsibilities include:</strong> </p>\n<ul>\n<li>Pitching, writing and publishing content for our undergraduate and postgraduate audiences across both websites </li>\n<li>Supporting the release of QS rankings and data through content creation </li>\n<li>Provide support to the Senior Content Editor, including editing and publishing copy </li>\n<li>Work with the content team to improve SEO implementation and best practices across TopUniversities.com and TopMBA.com </li>\n</ul>\n<ul>\n<li>Using article performance data to identify areas of improvement and optimise copy to maximise performance </li>\n<li>New content development, including articles, interviews, long-form reports and guides </li>\n</ul>\n<p>Knowledge, skills and abilities: </p>\n<ul>\n<li>Excellent written English with experience of writing content for a student audience </li>\n</ul>\n<ul>\n<li>Superb journalistic instincts for what makes a compelling story </li>\n<li>Ability to distil data and insights into clear, engaging content </li>\n<li>Confident interviewer, able to develop relationships with people from a range of backgrounds </li>\n<li>Understand Search Engine Optimization and able to incorporate SEO best practices into your work </li>\n</ul>\n<ul>\n<li>Excellent communication skills; present yourself professionally to all levels of the organization  </li>\n<li>Ability to execute independently, yet also collaborate well with others on your team(s)  </li>\n<li>Hyper organised and deadline driven with a collaborative and positive attitude </li>\n</ul>\n<p>Qualifications, training and experience </p>\n<ul>\n<li>Bachelor's or postgraduate degree in journalism, marketing or similar field required </li>\n<li>Prior experience of writing content for a global and/or student audience </li>\n<li>Experience within the higher education sector is advantageous but not essential </li>\n<li>Experience with Drupal preferred </li>\n</ul>\n"}, {"id": 964939, "url": "https://remotive.io/remote-jobs/writing/assistant-editor-964939", "title": "Assistant Editor", "company_name": "Frontiers", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-11-05T09:42:40", "candidate_required_location": "UK Only", "salary": "", "description": "<p><strong>Assistant Editor (Remote)</strong></p>\n<p><strong>We are on a mission to make science open so everyone can live healthy lives on a healthy planet</strong></p>\n<p><strong><br>Who we are</strong></p>\n<p>Frontiers is an award-winning open science platform and leading open access scholarly publisher.</p>\n<p>We are one of the largest and most cited publishers globally. To date, our 200,000 freely available research articles have received more than 1 billion views and downloads and 2 million citations. Our journals span science, health, humanities and social sciences, engineering, and sustainability. And we continue to expand into new academic disciplines so more researchers can publish open access.</p>\n<p>Be part of the publishing revolution and help us transform the way research is published, evaluated, and communicated to the world.</p>\n<p><strong>The Role </strong></p>\n<p>We are looking for an Assistant Editor (Oncology) to join our Review Operations department on a 12 month FTC. You will be providing strong subject knowledge expertise to our Editorial Boards with the aim of retaining good quality articles at the beginning of our peer review process. You will also be contributing to a faster and high quality peer review for our top-contributing authors and editors.</p>\n<p><strong>Our office is located in London, however remote working options are available for candidates across the UK.</strong></p>\n<p><strong>Key Responsibilities </strong></p>\n<p> </p>\n<ul>\n<li>Assess the editorial quality of manuscripts early in the peer-review process</li>\n<li>Manage 10-15 editing assignments per month</li>\n<li>Ensure that suitable expert reviewers are appointed in a timely manner</li>\n<li>Monitor author revisions and obtain reports in time</li>\n<li>Liaise with internal and external teams to ensure process alignment</li>\n<li>Identify and address bottlenecks to make the process faster</li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong>About You </strong></p>\n<p> </p>\n<p>You are a target driven individual with excellent interpersonal and communication skills. You have a methodical approach to work, are confident working with volume and deadlines while maintaining a keen eye of detail and ensuring high quality.</p>\n<ul>\n<li>Educated to a PhD level in oncology or bioinformatic applications in oncology or cancer research or equivalent experience</li>\n<li>Previous experience in an editorial role within STM publishing would be an advantage</li>\n<li>Excellent verbal and written English</li>\n<li>Strong communication skills, decisive and tactful when working with multiple stakeholders</li>\n<li>Ability to work independently, be highly organized and meet deadlines<br><br></li>\n</ul>\n<p><strong>Benefits </strong></p>\n<p><strong>What we Offer</strong></p>\n<p><strong>International environment</strong></p>\n<p>With over 50 nationalities across seven locations around the world, we are certainly a diverse company. You will have the opportunity to work with teammates in other offices, as well as with researchers, editors, and authors from across the globe.</p>\n<p><strong>Key Benefits</strong></p>\n<ul>\n<li>25 annual leave days + 4 well-being days</li>\n<li>Participation in the annual company bonus scheme</li>\n<li>Flexible working framework and remote working opportunities across the United Kingdom</li>\n<li>Extensive learning opportunities through our LinkedIn Learning partnership</li>\n<li>3 volunteer days through our online platform</li>\n<li>Access to Headspace app</li>\n<li>Online Yoga classes</li>\n</ul>\n<p> </p>\n<p><strong>Application Process </strong></p>\n<p>Your application must include:</p>\n<p>1. A tailored cover letter and your last CV</p>\n<p>2. Your notice period</p>\n<p><em>Frontiers actively embraces diversity and is a safe and welcoming workplace. Recruitment is free from discrimination – including based on race, national or ethnic origin, age, religion, disability, sex, gender identity or sexual orientation. With over 600 employees from more than 50 different nations, our diversity creates vibrant teams and constantly challenges us to appreciate multiple perspectives.</em></p>\n"}, {"id": 949848, "url": "https://remotive.io/remote-jobs/writing/crm-copywriter-949848", "title": "CRM Copywriter", "company_name": "Student Beans", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-30T09:43:08", "candidate_required_location": "Anywhere", "salary": "", "description": "<p><strong>About Student Beans</strong></p>\n<p>Student Beans is the world's leading student loyalty network. We produce our award-winning technology for the biggest retailers on the planet, connecting them with the youth market. Featuring in The Sunday Times Tech Track 100 2020, a list of the fastest-growing private tech companies in Britain, Student Beans consistently innovate to offer new solutions that satisfy our consumers, drive ROI for our clients and create an empowering workplace for our employees.</p>\n<p>In the last two years alone, Student Beans has tripled the size of its teams in London, Manchester and New York and opened a brand new office in Melbourne. But we’re not stopping there!</p>\n<p>Student Beans has an incredibly exciting journey ahead, with ambitious goals and endless possibilities. Our success is due to our brilliant people and we are looking for more talented individuals to join us on our journey.</p>\n<p><strong>About the role</strong></p>\n<p>As a result of our incredible success, we are looking for a CRM copywriter to join our Growth Marketing team.</p>\n<p>Responsibilities include:</p>\n<ul>\n<li>Working closely with the members of the CRM team to create compelling copy for emails and app messages, across all touch points, from welcome, onboarding to in-life journeys</li>\n<li>Collaborating with the Brand and Communications team, among others, to create copy for marketing newsletters and big campaigns</li>\n<li>Testing and editing CRM copy, ensuring it is in line with our brand style guidelines</li>\n<li>Assisting with the development of modular email templates and designs</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>About You</strong></p>\n<p>We’d really like to hear from you if you have…</p>\n<ul>\n<li>3+ years of demonstrable experience as an Email Copywriter</li>\n<li>A detailed understanding of email best practices</li>\n<li>You enjoy a fast paced working environment and can work both individually as well as part of a team</li>\n<li>Experience creating copy for Gen-Z/Students</li>\n<li>An engaging writing style and the confidence to share thoughts and ideas</li>\n<li>Ambition to take Student Beans' one-to-one communications to the next level</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>Life at Student Beans</strong></p>\n<p>We are passionate about our mission to empower students to thrive and believe our success is only due to our fantastic team, their different backgrounds, experiences and beliefs. At Student Beans our culture is welcoming and empowering, everyone has a voice and direct impact on our journey.</p>\n<p>Here are just a few things that make Student Beans an awesome place to work:</p>\n<ul>\n<li>Competitive salary.</li>\n<li>Remote first working environment, meaning you are not obligated to come into the office, you can choose the environment you think you excel best in!</li>\n<li>Flexi-time, including Flexi Fri-yay which gives you an opportunity to finish at 1.30pm!</li>\n<li>Vibrant, purposeful and social environment - famous winter parties and summer getaways, regular socials and adventurous activities.</li>\n<li>Focus on welfare - gym membership, wellness challenges, EAP and health cash plan</li>\n<li>Mental Health First Aider</li>\n<li>In house performance and development coaching</li>\n<li>Access to the ‘Student Beans Library’</li>\n<li>Volunteer Days. Student Beans believes in the benefit of volunteering and we believe everyone can play a role in the community!</li>\n<li>Incredible partnership discounts for the biggest brands in the world: Google, Apple, TopShop, Ted Baker, GymShark, Domino's, Uber … to name a few!</li>\n</ul>\n<p>Check out our Careers site to see for yourself! <a class=\"external\" href=\"https://about.studentbeans.com/careers\" rel=\"nofollow\">https://about.studentbeans.com/careers</a></p>\n<p><br>Due to the high volume of applicants we can only respond to shortlisted applicants. By submitting your application, you agree that Student Beans may collect your personal data for recruiting, global organization planning, and related purposes. Our <a class=\"external\" href=\"https://about.studentbeans.com/privacy-policy\" rel=\"nofollow\">Applicant Privacy Notice</a> explains what personal information and where we may process, our purposes for processing, and the rights you can exercise over Student Beans' use of your personal information.</p>\n"}, {"id": 952011, "url": "https://remotive.io/remote-jobs/writing/content-editor-for-spanish-audience-m-f-d-952011", "title": "Content Editor for Spanish Audience (m/f/d)", "company_name": "Social Sweethearts", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-10-29T05:43:28", "candidate_required_location": "Anywhere", "salary": "", "description": "<p>We are a digital media and games company. On a daily basis, we reach millions of users with our content, projects and games, such as the <a class=\"external\" href=\"https://www.facebook.com/Nametests-192875528281228/\" rel=\"nofollow\" target=\"_blank\">Nametests Instant Game</a> on Facebook. We are a creative team pursuing our mission to “make people smile”; we are committed to entertaining people and aim to inspire their world.</p>\n<p>We use the latest technology in order to be highly adaptive. Combined with our agile spirit and great teamwork, this allows us to achieve:</p>\n<ul>\n<li>More than 500 million people who played our games</li>\n<li>More than 120 million fans on Facebook</li>\n<li>Content and mini-games translated into more than 40 different languages</li>\n</ul>\n<p>The Social Sweethearts are looking for passionate and dynamic colleagues who would like to join us in continuing to create a more colorful world.</p>\n<p><br>Become a part of our team as <strong>Content Editor for Spanish Audience</strong> (m/f/d) <strong>Freelance</strong> and take the following responsibilities:</p>\n<ul>\n<li>Localize and create new content for the Spanish audience with the potential to go viral</li>\n<li>Analyze the performance of our Spanish content and draw learning experiences from it</li>\n<li>Optimize our existing content for the best possible user experience</li>\n<li>Share your ideas and brainstorm in an international environment</li>\n<li>Join our team of international editors and mutually grow with multinational and -lingual colleagues</li>\n</ul>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>You love creating written content and have experience appealing to a Spanish audience</li>\n<li>You are a Spanish Native, and your English is fluent</li>\n<li>Ideally, you have first experiences in writing lifestyle / social media / game content and analysing the performance thereof</li>\n<li>You are not afraid of using a custom-built inhouse CMS</li>\n<li>You love to work creatively in a team environment</li>\n<li>You have strong communication skills</li>\n<li>You have an organizational talent</li>\n</ul>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Friendly, collegiate atmosphere with colleagues who complement one another with their skills</li>\n<li>Down-to-earth founders and management, who understand their role as servant leaders</li>\n<li>We are an international and diverse team, which is why our company language is English</li>\n<li>You can have a huge impact on products that are used and downloaded globally by millions of users</li>\n<li>Emphasis on a healthy work-life balance, with flexible working hours and extensive remote work / home-office options</li>\n<li>Focus on knowledge sharing and cross-team-collaboration, with opportunities to share experiences with one another</li>\n<li>Regular team events to be decided on democratically</li>\n<li>A wonderful and growing company library</li>\n</ul>\n"}, {"id": 952010, "url": "https://remotive.io/remote-jobs/writing/content-editor-m-f-d-for-japanese-content-952010", "title": "Content Editor (m/f/d) for Japanese Content", "company_name": "Social Sweethearts", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-10-28T05:40:53", "candidate_required_location": "Anywhere", "salary": "", "description": "<p>We are a digital media and games company. On a daily basis, we reach millions of users with our content, projects and games, such as the <a class=\"external\" href=\"https://www.facebook.com/Nametests-192875528281228/\" rel=\"nofollow\" target=\"_blank\">Nametests Instant Game</a> on Facebook. We are a creative team pursuing our mission to “make people smile”; we are committed to entertaining people and aim to inspire their world.</p>\n<p>We use the latest technology in order to be highly adaptive. Combined with our agile spirit and great teamwork, this allows us to achieve:</p>\n<ul>\n<li>More than 500 million people who played our games</li>\n<li>More than 120 million fans on Facebook</li>\n<li>Content and mini-games translated into more than 40 different languages</li>\n</ul>\n<p>The Social Sweethearts are looking for passionate and dynamic colleagues who would like to join us in continuing to create a more colorful world.</p>\n<p> </p>\n<p>Become a part of our team as <strong>Content Editor (m/f/d) for Japanese Content - Freelance</strong> and take the following responsibilities:</p>\n<ul>\n<li>Localize and create new content for the Japanese audience with the potential to go viral</li>\n<li>Analyze the performance of our Japanese content and draw learning experiences from it</li>\n<li>Optimize our existing content for the best possible user experience</li>\n<li>Share your ideas and brainstorm in an international environment</li>\n<li>Join our team of international editors and mutually grow with multinational and -lingual colleagues</li>\n</ul>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>You love creating written content and have experience appealing to a Japanese audience</li>\n<li>You are a Japanese native, and your English is fluent</li>\n<li>You have experience in app / website localization</li>\n<li>Ideally, you have first experiences in writing lifestyle / social media / game content and analysing the performance thereof</li>\n<li>You are not afraid of using a custom-built inhouse CMS</li>\n<li>You love to work creatively in a team environment</li>\n<li>You have strong communication skills</li>\n<li>You have an organizational talent</li>\n</ul>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Friendly, collegiate atmosphere with colleagues who complement one another with their skills</li>\n<li>Down-to-earth founders and management, who understand their role as servant leaders</li>\n<li>We are an international and diverse team, which is why our company language is English</li>\n<li>You can have a huge impact on products that are used and downloaded globally by millions of users</li>\n<li>Emphasis on a healthy work-life balance, with flexible working hours and extensive remote work / home-office options</li>\n<li>Focus on knowledge sharing and cross-team-collaboration, with opportunities to share experiences with one another</li>\n</ul>\n"}, {"id": 947762, "url": "https://remotive.io/remote-jobs/writing/technical-documentation-writer-947762", "title": "Technical Documentation Writer", "company_name": "Kisi", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-27T01:40:28", "candidate_required_location": "Anywhere", "salary": "", "description": "<p dir=\"ltr\"><strong>About Kisi</strong></p>\n<p dir=\"ltr\"><em>Kisi is a security platform with offices in Brooklyn and Stockholm and a global remote team spanning from America, Europe, Africa and Asia. We create hardware and software that helps businesses connect and control their spaces through the cloud.</em></p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><strong>About the Role</strong></p>\n<p dir=\"ltr\">As a technical writer at Kisi, you’ll be responsible for the external and internal documentation of our products, including API documentation. You’ll work closely with the tech and product teams and learn the ins and outs of the digital access control industry. To be successful in the role, you need to be a talented communicator, have a curious mindset and a strong interest in new technology.</p>\n<p dir=\"ltr\"><strong>Responsibilities:</strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Writing and editing technical and non-technical product documentation for tech and non-tech audiences</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Collaborating with our internal teams of developers and engineers to learn and demonstrate an understanding of product functions and limitations</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Adapting content to suit different audiences and channels</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Improving and updating existing technical documentation</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Requirements:</strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">This position can be for someone technically curious or a seasoned writer</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Excellent written skills in English</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Experience from IT support and/or writing technical documents a plus</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Excited about our product and to learn more about the tech and security industry</p>\n</li>\n</ul>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Interest in cloud-based technology solutions</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">Know how to break down complex topics into easily understandable information</p>\n</li>\n</ul>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><strong>Why Kisi?</strong></p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Real impact</strong>: your contributions matter, and your impact will reach customers within a few weeks of onboarding. We have quick turnaround times and enjoy working under reasonable pressure.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">You’re in for the <strong>full picture</strong>, from understanding and enhancing project requirements to building and verifying that your solutions work.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Work smarter, play better</strong>. Competitive salary, benefits &amp; wellness programs, yearly company bootcamps, but also a lot of heavy lifting and crunching. We want to go above and beyond.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Anything but ordinary</strong>. We’re a fun (&amp; kinda geeky), international crew with offices in Brooklyn and Stockholm as well as teammates all around the world.</p>\n</li>\n</ul>\n"}, {"id": 948805, "url": "https://remotive.io/remote-jobs/writing/copywriter-948805", "title": "Copywriter", "company_name": "Polkastarter", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-24T17:44:12", "candidate_required_location": "Anywhere", "salary": "", "description": "<p>Thank you for your interest in joining the Polkastarter team as a <strong>Copywriter</strong>. Polkastarter is the fully decentralized protocol for launching new ideas. Our curation process and industry access enable us to offer the best new projects in blockchain and digital assets.</p>\n<p>With Polkastarter, decentralized projects can raise awareness, build a loyal community, and receive long-term support. Users of the platform will be able to participate in a secure and compliant environment and use assets both in and beyond the current ERC20 standard.</p>\n<p>As a <strong>Copywriter</strong>, you will be responsible for covering all Polkastarter and blockchain-related topics for our blog, social media and website. You should be a self-starter, capable of delivering brilliant creative ideas, and show amazing attention to detail.</p>\n<p>The position is remote and available in full-time or part-time. Both are possible.</p>\n<div class=\"h1\"><strong>You must have:</strong></div>\n<ul>\n<li>Proficient English language skills (written and spoken)</li>\n<li>Proven experience as a crypto Copywriter/Journalist.</li>\n<li>Be able to write about breaking blockchain topics in an interesting and engaging way that drives readers to our platforms on a regular basis</li>\n<li>Be a team player and execute Polkastarter's content strategies</li>\n<li>Compelling portfolio of work over a wide range of crypto topics</li>\n<li>Good SEO knowledge is a plus.</li>\n</ul>\n<div class=\"h1\"><strong>Responsibilities:</strong></div>\n<ul>\n<li>Write clear and concise articles and copies, with a distinct voice, on the blockchain industry and Polkastarter-related.</li>\n<li>Work closely with the Marketing and Product teams to organize the content strategy, to build marketing projects/campaigns and keep it all consistent with the Polkastarter style.</li>\n<li>Have a deep understanding of crypto markets, as well as the latest trends and technological developments.</li>\n<li>As industry thought leaders, our platforms should be a go-to for our members and followers. So you should be able to bring new and original content ideas, as well as turn complex topics into insightful, useful and interesting articles for the Polkastarter community.</li>\n<li>Prepare rough drafts and present ideas for approval</li>\n<li>Edit and proof content.</li>\n<li>Maximize reach using SEO and social media best practices</li>\n<li>Contribute to team effort by accomplishing related results as needed.</li>\n</ul>\n<div class=\"h1\"><strong>Desired Qualities:</strong></div>\n<ul>\n<li>Updated knowledge on the latest blockchain industry developments</li>\n<li>Strong research skills and a keen eye for details</li>\n<li>Creative thinker, capable of bringing original and engaging content ideas</li>\n<li>Patient and able to take criticism</li>\n<li>The ability to set priorities, meet deadlines and work with minimal supervision</li>\n<li>Excellent communication and interpersonal abilities</li>\n</ul>\n<div class=\"h1\"><strong>Benefits:</strong></div>\n<ul>\n<li>Fully remote working means you can work from wherever you want, no commute and no ties to any particular location</li>\n<li>Work with some of the best digital marketers in the industry and a range of exciting, high-growth companies</li>\n<li>Competitive salary based on experience and the opportunity to grow with clear progression plans</li>\n</ul>\n<p><strong>Please send us your CV and your portfolio of previous work.</strong></p>\n"}, {"id": 935123, "url": "https://remotive.io/remote-jobs/writing/senior-cryptocurrency-editor-breaking-news-935123", "title": "Senior Cryptocurrency Editor – Breaking News", "company_name": "SEEKING ALPHA", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-24T05:40:58", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h1\">Description</div><p><strong>Why we’re a great company to work for</strong></p><ol><li><strong>We have a mission.</strong> Seeking Alpha is about more than helping people make money. People who invest are 24% happier, 19% less stressed, and report a 36% increase in their sense of well-being (<a href=\"https://seekingalpha.com/article/4248687-can-money-make-happier\" rel=\"nofollow\" target=\"_blank\">source</a>). By helping investors to succeed, we help them to send children to college, achieve life goals, afford healthcare, and provide themselves with a secure retirement.</li><li><strong>We’re profitable and growing fast.</strong> We fuel our growth investments with our own capital, leading to greater stability for employees, and an inspiring growth-focused environment. All employees receive equity grants in-line with their cash compensation.</li><li><strong>You’ll work with great people.</strong> We work in small, tight-knit groups of smart, engaged people who bring everything to the table every day.</li><li><strong>We have fun.</strong> We love to get together at company events, which include Alphas who work from home. “Seeking Alpha doesn’t feed me well,” said no one ever.</li><li><strong>You’ll impact the lives of many people.</strong> We have 15 million unique monthly visitors, and 500,000 unique users visit Seeking Alpha every business day.</li></ol><p><br></p><p><strong>What you need to excel</strong></p><p>Further down you’ll find the specifics of the job. The following traits describe the characteristics we look for in all positions.</p><ol><li><strong>Hard working.</strong> Delivering great experiences requires time and painstaking dedication. There are no shortcuts. Be ready to crush it every day.</li><li><strong>Precise.</strong> It is easy to fudge things. We look for people who love being given concrete definitions of success, and utilize their talents and work ethic to exceed them.</li><li><strong>Flexible.</strong> We ask questions more than we assert answers, and we are always open to criticism and changing our views in the face of evidence.</li><li><strong>Lean.</strong> We pride ourselves in getting stuff done efficiently. When we ask, “How can I solve this challenge,” the first answer is never, “Hire someone.”</li><li><strong>Team player.</strong> We look for people who are intellectually stimulating, bring a positive attitude to work, and are fun to be around.</li></ol><p><br></p><br><br>Responsibilities: <br><p>Seeking Alpha is looking for a reporter to cover the exciting and fast-growing cryptocurrency sector. It’s a beat that understands many are skeptics, and strives to educate as much as inform. Coverage includes not just all things Bitcoin, but Ethereum and related assets, DeFi, stablecoins, privacy assets, exchange assets, smart contract platforms, NFTs and yield farming. The reporter must have a strategist’s mindset and be able to follow, keep tabs on, and deconstruct complex investment structures for the novice investor in this nascent sector. </p><p><br></p><p>The ideal candidate will come with or be able to develop industry sources, and will have an excellent handle on who the thought leaders are in crypto and where their discussions are taking place. He/she will go beyond just reporting the news, but will be able to “connect the dots” to how publicly traded non-crypto companies might be affected by crypto developments. They will also have a mindset of an investor, looking to craft and explain different investment methodologies in the segment.</p><p><br></p><p>The cryptocurrency editor will be expected to source, produce, and edit numerous short- to medium-form news items each day. While being part of a sizable news team with a well-established platform and reader audience in the millions, this position is an entrepreneurial one. Are you ready to help create the go-to site for the intersection of Wall Street and crypto?</p><div class=\"h1\">Requirements</div><ul><li>Minimum 2 years of experience as a reporter or editor in the cryptocurrency sector, with a deep understanding of the publicly and non-publicly traded players, regulatory environments, trading, investing, and how crypto and traditional markets function.</li><li>The ability to write quickly, concisely, and accurately about breaking news events, while maintaining a conversational style and not losing sight of the “big picture.”</li><li>The ability to multitask between monitoring news sources, writing short-form and long-form news updates (as needed), while prioritizing and coordinating with fellow team members when needed.</li><li>Comfort with discussing the details of financial statements, SEC filings, earnings and competitors across a diverse array of industries.</li><li>Knowledge of SEO.</li><li>Excellent headline-writing skills. </li></ul><p><br></p><p>Please attach a resume, along with responses to the following:</p><ol><li>How long have you been following financial markets, and what kind of stories tend to draw your attention?</li><li>What drew your interest to crypto markets? How long have you been following and what kind of stories tend to draw your attention?</li><li>Describe Bitcoin to a stock market investor? What makes it an investable asset class? How is it different from the rest of the cryptocurrency universe?</li><li>Name five (non-Bitcoin) cryptocurrencies and/or projects that interest you, and briefly describe why.</li><li>Which sites and/or blogs do you actively follow to stay on top of market trends?</li><li>What are the first market-related items you check out each morning?</li></ol>"}, {"id": 934678, "url": "https://remotive.io/remote-jobs/writing/direct-response-copywriter-934678", "title": "Direct Response Copywriter", "company_name": "10x Incubator", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-23T02:32:47", "candidate_required_location": "USA Only", "salary": "", "description": "<p>10X Incubator is hiring motivated, fearless, and driven people!</p>\n<p><strong>Company Description</strong></p>\n<p>10X Incubator has combined two of the most powerful companies in the tech industry with the mission of launching 10,000 tech companies in 10 years.</p>\n<p>YES, you read that RIGHT.</p>\n<p>NO, that is not a TYPO.</p>\n<p>10,000 tech companies in 10 years!</p>\n<p>10X Incubator takes ideas written on napkins or pitch decks or minimal viable tech products and transforms them into stable, viable, and limitless scale tech companies. By combining a world-class software development team with a top-notch go-to-market and sales division, along with financing, legal support, and business consulting, tech companies in the 10X Incubator are poised for an unprecedented level of growth and success. </p>\n<p>You might be wondering, who are the two companies we are referring to above?</p>\n<p><strong>Cardone Enterprises</strong></p>\n<p>Cardone Enterprises is a privately held company that owns and operates seven companies including Cardone Capital, Cardone Training Technologies, Inc, and Cardone Ventures. Grant Cardone is the CEO of Cardone Enterprises, a sales mogul, real estate fund manager with $2.3B in AUM, the best-selling author of the 10X Rule, and world-renowned speaker &amp; philanthropist. Cardone Enterprises specializes in transforming people's lives through training programs and events focused on business, marketing, sales, scaling and money – all with the same focus , entrepreneurship, and sales training and is committed to teaching strategies that will 10X your business, income, and life.</p>\n<p><strong>CILA Labs</strong></p>\n<p>CILA Labs is a privately owned Tech Incubator based out of the US, Canada, and India with a mission to launch 10,000 tech companies by 2031 with the goal of eliminating at least one inefficiency for every person on the planet. People with tech concepts have the ability to submit their ideas through the CILA Labs process so that the company can determine whether the person, idea, competition, and ability to scale meets the criteria to join the portfolio. If/when a concept and Co-Founder is accepted, CILA Labs becomes a partner in the venture and begins a journey from idea to exit by deploying its fully integrated process of software development, go-to-market, branding, sales, customer support, legal, financial planning, and administrative services at cost. CILA believes that everyone is meant to be a tech entrepreneur and is committed to helping people of all ages and from around the world realize their dreams and aspirations as tech entrepreneurs.</p>\n<p>For the right person, the opportunity to join 10X Incubator is a dream come true. </p>\n<p> </p>\n<p><strong><em>The Single Greatest Creative Career For The Right Person Is Here!</em></strong><br><br></p>\n<p>What would be your absolute DREAM career as a copywriter?<br><br></p>\n<p>Would you have the ability to work on the coolest and most innovative companies around?<br><br></p>\n<p>Would you be helping create companies that matter and will make the world a better place?<br><br></p>\n<p>Would you be compensated based on your contributions with limitless upside potential?<br>Would you be able to work from anywhere you desire?<br><br>If none of this sounds like what you want, please don't waste your time, but if by chance what you just read excites you, intrigues you, and makes you yearn to earn this opportunity then…</p>\n<p>10X Incubator is your dream career!<br>Not only are we a technology incubator, we BUILD ideas by assembling the RIGHT team for each product with extremely talented engineers, architects, marketers, project managers, and business scalers. But it's even more than just building disruptive technology…</p>\n<p>We take a meaningful equity position in each company we support, we become the Co-Founder of each entity, and we are responsible for creating, innovating, launching, and accelerating the entire company forward.</p>\n<p>As a part of 10X Incubator team, you will help support our portfolio companies' business needs. Ideal candidates are organized thinkers who can break down complex problems, build solutions, deliver actionable and process-oriented next steps while working in a dynamic environment. Ideal candidates also are system thinkers who are ready to take execution ownership of key tasks in a workflow. This role will work cross-functionally with Marketing, Product, Software Engineering, Finance, and Analytics teams as well as others.</p>\n<p>At 10X Incubator, we value people more than anything else. It's the single reason why 10X Incubator has become such an impactful force very quickly. We hire committed, driven, entrepreneurial people who LOVE a fast-paced and autonomous environment where they can grow personally and professionally each day. 10X Incubator is the perfect place for the right person and we invite you to apply so that we can consider welcoming you to our 10X Incubator Family!</p>\n<p><strong>Direct Response Marketing Copywriter</strong></p>\n<p>Location: United States (Remote Job)</p>\n<p>Position: Full time</p>\n<p>Experience: 3+ years of experience</p>\n<p>Degree Required: College Degree in Marketing or related field and/or relevant sales/marketing experience</p>\n<p>_______________________________________________________</p>\n<p><strong>Expectations</strong></p>\n<ul>\n<li>Write and develop compelling offers (both short and long-form copy) that builds trust and drives readers to make an immediate purchase</li>\n<li>Ability to write creatively in various brand voices, maintaining consistency for each portfolio company across all content created.</li>\n<li>Develop copy for marketing materials including ads, social media, emails, TV, website, press stories, and more</li>\n<li>Work closely with design, marketing, production, digital and product development teams to develop brand copy across various digital touch points</li>\n<li>Help evolve copy workflows and processes</li>\n<li>Demonstrate strong editing, grammar, and proofreading techniques</li>\n<li>Follow brand guidelines and help enhance them over time</li>\n<li>Execute messaging strategies from conception to commercialization for fully integrated digital campaigns</li>\n<li>Help strategize new opportunities and improvements for advertising across various channels from paid social, email, landing pages, and more</li>\n<li>Continually help to define processes to effectively deliver quality creative in fast-paced environment</li>\n<li>Present creative to teams in a clear and compelling manner</li>\n</ul>\n<p><strong>Required Skills</strong></p>\n<ul>\n<li>3+ years of direct-response copywriting experience</li>\n<li>Organized individual contributor with great communication skills</li>\n<li>Ability to convert data + insights into creative solutions that drive results</li>\n<li>Dynamic portfolio showcasing a wide variety of writing styles for tone and/or brand work</li>\n<li>Experience with email automations, email campaigns, copy for FB ads as needed</li>\n<li>Copywriting Experience - Writing for E-commerce and various Brands</li>\n<li>Impeccable grammar + proofreading skills</li>\n<li>Portfolio with samples</li>\n<li>The ability to craft an offer and pitch on the fly</li>\n<li>Coachable, motivated and entrepreneurial-minded individual</li>\n<li>Couples natural curiosity with a growth mindset for seeking knowledge and creating new business strategies</li>\n<li>Ability to identify problems, risks and issues, mediate and develop solutions, and implement a course of action</li>\n<li>Ability to work independently and remotely, as well as in a team environment</li>\n<li>Willingness to take calculated risks</li>\n<li>Fast and reliable internet connection (not a skill, but we are a fully remote company).</li>\n</ul>\n<p> </p>\n<p><strong>Preferred Skills</strong></p>\n<ul>\n<li>Experience with Google Drive or cloud file management.</li>\n<li>Experience with Asana task manager.</li>\n</ul>\n<p> </p>\n<p><strong>Why 10x Incubator:</strong></p>\n<ul>\n<li>10x Incubator is an exciting place to work, as we are constantly working on innovative product ideas using cutting-edge technologies.</li>\n<li>We have a nurturing environment that breeds creativity and innovation.</li>\n<li>Our Mentorship Program will help you grow professionally.</li>\n<li>Excellent career growth plan.</li>\n<li>Work from anywhere.</li>\n<li>Limitless earning and impact potential.</li>\n<li>Single greatest tech opportunity for the right person.</li>\n</ul>\n"}, {"id": 932367, "url": "https://remotive.io/remote-jobs/writing/senior-copywriter-932367", "title": "Senior Copywriter", "company_name": "Juul Labs", "category": "Writing", "tags": [], "job_type": "", "publication_date": "2021-10-19T17:42:16", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>THE COMPANY:</strong></p>\n<p>Juul Labs’ mission is to impact the lives of the world’s one billion adult smokers by eliminating combustible cigarettes. We have the opportunity to address one of the world’s most intractable challenges through a commitment to exceptional quality, research, design, and innovation. Backed by leading technology investors, we are committed to the same excellence when it comes to hiring great talent.</p>\n<p>We are a diverse team that is united by this common purpose and we are hiring the world’s best engineers, scientists, designers, product managers, operations experts, and customer service and business professionals. If the opportunity to build your career at one of the fastest growing companies is compelling, read on for more details.</p>\n<p><strong>ROLE AND RESPONSIBILITIES:</strong></p>\n<ul>\n<li>\n<p>The Senior Copywriter role is an exciting opportunity to support and evolve the copy discipline at a rapidly developing global consumer brand. This writer will need to navigate a challenging and restrictive category while contributing to both brand development and product marketing.\u2028\u2028</p>\n<p><strong>Responsibilities</strong></p>\n<p>This writer will be a member of the Creative Team within the Brand Management department. The Creative Team works closely with Brand Development, Marketing, Consumer Insights, and cross functionally with other departments.</p>\n<ul>\n<li>Develop copy for marketing assets: ecommerce, SEO, CRM, digital and print advertising, retail point of sale materials, packaging, and research stimulus \u2028</li>\n<li>Align new copy to approved messaging and global brand strategy</li>\n<li>Evolve a narrative voice in multiple markets with different requirements</li>\n<li>Partner cross-functionally to develop copy with departments outside of Brand Management to ensure Brand Guidelines are met</li>\n<li>Champion and enforce global Copy Guidelines, and market and channel-specific exceptions</li>\n</ul>\n<p><strong>\u2028Qualifications</strong></p>\n<ul>\n<li>7+ years of experience concepting, writing, editing, and shipping exceptional consumer focused content\u2028</li>\n<li>Meticulous writer and editor with a command of English grammar, spelling, and punctuation\u2028</li>\n<li>Excellent time management skills and ability to prioritize against hard deadlines\u2028</li>\n<li>Ability to take technical content and make it easily understandable\u2028</li>\n<li>Ability to ideate within extremely strict parameters\u2028</li>\n</ul>\n<p><strong>Education</strong></p>\n<ul>\n<li>Preferred bachelor’s degree in English, Communications, Marketing, Creative Writing, or related field\u2028</li>\n<li>Or equivalent professional experience supported by a strong portfolio of consumer facing work</li>\n</ul>\n</li>\n</ul>\n<p><strong>JUUL LABS PERKS &amp; BENEFITS:</strong></p>\n<ul>\n<li>A place to grow your career. We’ll help you set big goals - and exceed them</li>\n<li>People. Work with talented, committed and supportive teammates</li>\n<li>Equity and performance bonuses. Every employee is a stakeholder in our success</li>\n<li>Boundless snacks and drinks</li>\n<li>Cell phone subsidy, commuter benefits and discounts on JUUL products</li>\n<li>Excellent medical, dental and vision benefits</li>\n</ul>\n<div class=\"h6\">Juul Labs is proud to be an equal opportunity employer and is committed to creating a diverse and inclusive work environment for all employees and job applicants, without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. We will consider for employment qualified applicants with arrest and conviction records, pursuant to the San Francisco Fair Chance Ordinance. Juul Labs also complies with the employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Juul Labs in the US.</div>\n"}, {"id": 930281, "url": "https://remotive.io/remote-jobs/writing/senior-technical-writer-930281", "title": "Senior Technical Writer", "company_name": "Firebolt", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-17T13:45:39", "candidate_required_location": "Anywhere", "salary": "", "description": "<div class=\"h1\">Description</div>\n<p><strong>Who We Are</strong></p>\n<p>Firebolt is a major shake-up to the cloud data warehouse space. So far we’ve built the fastest, most scalable, and most hardware efficient cloud data warehouse in the market, by far, and have helped some of the most data-forward companies in the world with their biggest data challenges. But this is just the beginning. We are a strong team of world-class data experts, led by ex-founders from Sisense and Looker. With $164M of recent funding by top VCs, we are poised to grow quickly and change how we work with data and what can be done with data.</p>\n<p> </p>\n<p><strong>The Team </strong></p>\n<p>The Technical Content team at Firebolt develops and delivers content that helps customers use their data warehouses to create data-driven insight most quickly and cost-effectively. </p>\n<p>Our team: </p>\n<ul>\n<li>Produces technical content in concert with product development and the deliverables of all customer-facing teams</li>\n<li>Develops tools and systems for efficient content delivery, reuse, and measurement</li>\n<li>Enriches the content ecosystem by providing guidance and support that enables other technical content producers</li>\n<li>Uses qualitative and quantitative measurement to analyze and continuously improve content effectiveness</li>\n</ul>\n<p> </p>\n<p><strong>What We’re Looking For</strong></p>\n<p>As a Senior Technical Writer at Firebolt, you drive the development and design of simple, clear, consistent technical content that is laser-focused on helping data engineers and other Firebolt customers get the most out of Firebolt as fast as possible. You collaborate with other writers, Project Managers, Engineers, Solution Architects, and Developer Advocates to identify, plan and deliver the right content at the right time in the right place. You inform and shape the development of content authoring and delivery tools and systems, using deep insight drawn from the customer experience as well as from the experience of content developers as system users.</p>\n<p> </p>\n<p><strong>What You'll Do:</strong></p>\n<ul>\n<li>Independently and collaboratively develop content plans for new features and customer solutions and take ownership of their execution</li>\n<li>Provide governance frameworks, guidance, and coaching to junior writers and content creators throughout Firebolt </li>\n<li>Envision, implement, and evangelize unified information hierarchies and architectures</li>\n<li>Partner with content platform developers to implement structured authoring solutions that improve writer efficiency through content reuse and quality assurance automation</li>\n</ul>\n<div class=\"h1\">Requirements</div>\n<p><strong>Must Have:</strong></p>\n<ul>\n<li>Bachelor’s degree in English, technical writing, human-computer interaction, or a related field or equivalent experience</li>\n<li>5+ years as a content developer, technical writer, instructional designer, or related occupation in a technical role </li>\n<li>Expertise developing content in an XML-based authoring and publishing environment</li>\n<li>Experience working with Git-based version control for continuous integration and delivery </li>\n<li>Experience with agile development practices in a cloud services environment</li>\n</ul>\n<p> </p>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>Experience documenting database products or services</li>\n<li>Working knowledge of SQL</li>\n<li>Experience working with a programming or scripting language</li>\n</ul>\n"}, {"id": 920916, "url": "https://remotive.io/remote-jobs/writing/editor-in-chief-920916", "title": "Editor in Chief", "company_name": "Staking Rewards", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-15T06:00:26", "candidate_required_location": "CET +/- 6", "salary": "", "description": "<div class=\"h1\">Let's bring passive income to the masses! Shall we?</div>\n<p>We believe in a world with a decentralized, open, and transparent financial community. In the emerging ecosystem of Staking, DeFi, and Crypto Interest, we are creating a platform of trusted information and collaboration.</p>\n<p>Are you self-driven, motivated, and love conceptualizing the crypto space? Crypto, Journalism, and Blogging is your daily life? We are looking for a proactive Editor-in-Chief to lead the content and research strategy around yield-generating digital assets.<br><br>The position is fully remote, but restricted to CET +/- 6</p>\n<div class=\"h2\">Optimally you can take the following responsibilities:</div>\n<ul>\n<li>Design a Content Strategy (Articles, Research, Newsletter, Videos, and more)</li>\n<li>Write compelling stories &amp; data-driven research around Staking</li>\n<li>Script videos with high-quality research</li>\n<li>Understand the audience &amp; address different types of persona</li>\n<li>Lead a team of content writers &amp; analysts</li>\n<li>Copy edit and proof check articles</li>\n<li>Promote Staking Rewards as the market leader staking data &amp; research</li>\n</ul>\n<div class=\"h2\">You will find it easier to do your job if you have the following qualities. Needless to say, none of these qualities supersede your intellectual and professional curiosity:</div>\n<ul>\n<li>Strong expertise around crypto, DeFi, and staking markets</li>\n<li>M.A. in Journalism, or Digital Marketing </li>\n<li>Passion for Data, Maths, and in-depth research</li>\n<li>Experience in WordPress, &amp; producing SEO-focused content</li>\n<li>Experience working with a financial news publication or research boutique</li>\n</ul>\n<div class=\"h2\">Our offer to you:</div>\n<ul>\n<li>Be part of a supportive work environment with the opportunity for explosive growth</li>\n<li>Learn a structured research approach for crypto markets</li>\n<li>Gather experience and build your network in the vibrant crypto ecosystem.</li>\n</ul>\n<div class=\"h2\">What we need from you to apply:</div>\n<ul>\n<li>Send us your social profiles for Linkedin, and Twitter</li>\n<li>Write us a brief text about you &amp; your achievements</li>\n</ul>\n"}, {"id": 906259, "url": "https://remotive.io/remote-jobs/writing/technical-writer-906259", "title": "Technical Writer", "company_name": "Zadara", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-09T05:49:29", "candidate_required_location": " Israel only", "salary": "", "description": "<div>Zadara offers cloud infrastructure solutions for MSPs and Enterprises. Our vision is to develop, deploy and operate the largest global Edge Cloud Network, to enable innovative technologies and services that improve the way the world communicates, works, heals, travels and plays.  We are looking for authentic, driven, customer obsessed individuals to join our thriving global team.</div>\n<div> </div>\n<div>Zadara is one of tech's fastest growing companies according to Deloitte’s Technology Fast 500 awards. Since 2011, Zadara has been a disruptor in the technology space, pioneering the first storage-as-a-service technology solutions. Our proprietary storage and compute technology offers the most flexible and resilient infrastructure for service providers, enterprises –designed for any workload, any data type, and any location, on-premises, multi-cloud, hybrid and at the edge. </div>\n<div> </div>\n<div>Zadara’s award-winning cloud services platform brings our proprietary infrastructure technology to where customers need it most. Our global partner network has doubled in the past year to include more than 300 clouds, with the goal of accelerating our global footprint by an order of magnitude. We are endorsed by best-in-class service providers and partners, including  Cyxtera, Sandz, Viatel, CenturyLink, Equinix, NTT Rakuten, Verizon, K3 Starcom, Softcat and Veeam.</div>\n<div> </div>\n<div>At Zadara you will be surrounded by a group of intelligent, open-minded, critical thinkers with diverse backgrounds who are committed to learning and development at every level. Join our growing diverse team and help us achieve many thousands of cloud locations.</div>\n<div> </div>\n<div><span style=\"font-size: 12pt;\">Zadara is looking for a Technical Writer to join our team. In this role, you will promote customer loyalty and success through content development and delivery. The technical writer creates and is responsible for the documentation and premium content that accompany our Edge Cloud services offering. You will work closely with product managers, engineers, and other subject matter experts to create content that helps our customers successfully use our offering. </span></div>\n<p><br><br></p>\n<div class=\"h3\">Primary Job Responsibilities:</div>\n<ul>\n<li>Work closely with global teams, including content strategists, product managers, engineers, and the operations teams, to create and maintain technically accurate, high-quality documentation for product releases and service offerings</li>\n</ul>\n<ul>\n<li>Work with stakeholders to address content gaps, respond to direct customer feedback, and promote continuous improvement of the documentation experience</li>\n</ul>\n<ul>\n<li>Use our documentation toolchain, including the publishing platform and issue-tracking tools</li>\n</ul>\n<ul>\n<li>Research and understand the products and services via training, practical experience, and interviewing subject matter experts to gain product knowledge</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Required Skills:</div>\n<ul>\n<li>3-5 years of experience writing technical documentation including API's, feature descriptions, customer use cases, and release notes</li>\n</ul>\n<ul>\n<li>Hands on experience, the ability to connect to running systems and execute usage scenarios in order to better document the usage flows</li>\n</ul>\n<ul>\n<li>Fluent in written and verbal English</li>\n</ul>\n<ul>\n<li>Familiarity with software and documentation development life cycles</li>\n</ul>\n<ul>\n<li>Familiarity with version control systems</li>\n</ul>\n<ul>\n<li>Familiarity with cloud and infrastructure technologies</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">The following are considered a plus:</div>\n<ul>\n<li>Practical experience with Linux</li>\n</ul>\n<ul>\n<li>Familiarity with storage technologies</li>\n</ul>\n<ul>\n<li>Experience authoring topic-based documentation</li>\n</ul>\n<ul>\n<li>Experience collaborating and directly interacting with globally-distributed stakeholders from diverse cultural backgrounds</li>\n</ul>\n<div>#LI-Remote</div>\n<div> </div>\n<div><span style=\"font-size: 15px;\">Zadara is an equal opportunity employer committed to diversity in the workplace. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, disability, veteran status, and other protected characteristics.</span></div>\n<div> </div>\n<div>Please review Zadara's <a class=\"postings-link\" href=\"https://www.zadara.com/legal/privacy-notice-candidates/\" rel=\"nofollow\">Privacy Policy</a> here</div>\n<div>Please review Lever's <a class=\"postings-link\" href=\"https://www.lever.co/privacy-notice\" rel=\"nofollow\">Privacy Policy</a> here</div>\n<div> </div>\n"}, {"id": 907457, "url": "https://remotive.io/remote-jobs/writing/senior-editor-small-business-907457", "title": "Senior Editor, Small Business", "company_name": "Forbes Media", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-06T22:09:45", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Forbes believes in the power of entrepreneurial capitalism and uses it on various platforms to ignite the conversations that drive systemic change in business, culture and society. We celebrate success and are committed to using our megaphone to drive diversity, equity and inclusion. Forbes has recently announced plans to go public and to be listed on the NYSE via a special purpose acquisition company (or SPAC). This will enable Forbes to further capitalize on its successful digital transformation, using technology and data-driven insights to create more deeply engaged audiences, through editorial, product development and strategic investments.<br></p> <p>Our office is currently remote. Forbes aims to offer employees the flexibility they need in order to be successful. Upon our return to the office, the expectation is that this role can be based out of Jersey City, NJ, offering a hybrid work schedule or be fully remote in the United States.</p> <p>Forbes is looking for the kind of journalist who loves great storytelling in all its forms. Along with discovering the creators, entrepreneurs, and small business leaders we need to know, you’ll have a chance to create new franchises, events, and products that we haven’t even thought of yet. We want a curious self-starter who is excited by the opportunity to be the face and force behind our coverage of a large and fast-growing part of the economy.</p> <p><strong>Responsibilities</strong></p> <ul> <li>Owns the Small Business beat </li> <li>In charge of Next 1000 list and the articles related to it—includes managing a small team to work on list </li> <li>Produces live events related to your lists</li> <li>Writes impactful investigative articles, as well as the second-day analysis of breaking news stories</li> <li>Breaks stories, scooping the competition</li> <li>Writes a biweekly newsletter </li> <li>Moderates on panels</li> <li>Serves as expert of your subject on other media outlets </li> <li>Oversees small business contributors</li> </ul> <p><strong>Requirements:</strong></p> <ul> <li>Bachelor’s Degree</li> <li>5+ years’ experience in journalism</li> <li>Deeply sourced</li> <li>Works independently, coming up with ideas and reporting on stories with little direction</li> <li>Familiarity with finance and comfort with financial figures and terms</li> <li>Ability to delve into financial documents</li> <li>Interest in covering successful entrepreneurs and business leaders</li> <li>Strong analytical and reporting skills</li> </ul> <p><br></p><p>Forbes is an equal opportunity employer.</p>"}, {"id": 911871, "url": "https://remotive.io/remote-jobs/writing/copywriter-911871", "title": "Copywriter", "company_name": "C3 Industries", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-05T13:57:08", "candidate_required_location": "USA Only", "salary": "", "description": "<p><strong>Who we are…</strong></p>\n<p>C3 Industries is led by a passionate, creative, and hardworking team of cannabis cultivation and processing experts. We produce and sell the highest quality, indoor cannabis flower and extracted products (<em>Cloud Cover Cannabis</em>) at our state-of-the-art facilities and retail storefronts (<em>High Profile Boutique Cannabis) </em>throughout Michigan and Oregon, with active expansion underway within Missouri and Massachusetts markets and communities.</p>\n<p>At C3I our product is cannabis, but our most important asset is our people. We believe in hiring locally, offering competitive compensation packages, and giving our employees an opportunity to learn and grow. As a company, we are committed to being active corporate citizens and community members and celebrate diversity and inclusion.</p>\n<p><strong>C3 Industries is looking for an experienced Copywriter </strong>to be responsible for developing clear, compelling copy for our customers while also understanding the business objectives, voice, and strategy for C3 Industries Brands'. </p><p>Headquartered in Ann Arbor, MI. Remote applicants welcome.</p>\n<p><strong>In this role you will….</strong></p>\n<ul><li>Develop      copy along the creative spectrum, from compelling campaign lines to clear      instructional messages, across a range of print and digital deliverables. </li><li>Collaborate      with the internal marketing team, retail and product teams to develop      campaigns and copy for in-store and digital use. </li><li>Write      copy to support product and retail store launches including product detail      pages, and editorial content. </li><li>Write      copy and collaborate with Marketing team on content development for      internal &amp; external newsletters, blogs and social media captions. </li><li>       Collaborate with internal stakeholders to understand the intended audience and the message the company wants to communicate.</li><li>Maintain      the strategic brand voice that strengthens C3 Industries brand, product,      and retail offerings.</li><li>Partner      with creative leaders and design peers to consistently raise the bar for      creative development and execution. </li><li>Maintain      and update copy style guides, creating new ones as needed</li><li>Audit      and provide feedback to external and internal teams who create their own      customer facing copy; providing coaching and documentation that enables them      to uphold our voice and brand standards. </li><li>Track      Project Management System to ensure designs are created within expected      timeframe; collaborate with cross functional leaders to understand      deadline requirements. </li><li>Closely      communicate with cross functional leaders to understand current and future      business demands.  </li><li>Keep      abreast of trends in content and style reflected on various media and      marketing channels.</li></ul>\n<p><strong>Skills and experience you have...</strong><br>\n</p>\n<ul><li>       4+ years of professional experience as a copywriter in advertising and/or in-house.</li><li>       A track record of attracting, retaining, and growing an audience through the use of compelling. content in brand campaigns, direct response advertising, email, and social media.</li><li>       A self-starter who thrives on taking ownership of writing assignments big and small.</li><li>       A strong ability to prioritize work and resources across short and long-term projects with proven ability to prioritize work over different deadlines.</li><li>       An experienced understanding of the writing nuances between B2B and B2C marketing.</li><li>       Proven ability to establish strong credibility and build relationships and operate in an environment of ambiguity.</li><li>       Strong results- orientation and commitment to quality, performance, and deliverables. </li><li>       Excellent written and verbal communication skills with proven ability to influence others. </li><li>       Effective multi-tasker with demonstrated ability to prioritize and problem solve. </li><li>       Must be at least 21 years of age and able to pass a background check.</li></ul>\n<p><strong>You should apply if...</strong></p>\n<ul><li>You are an experienced copywriter with a track record of engaging target audiences.</li><li>You are detailed orientated and are comfortable doing whatever it takes to get the job done.</li><li>You love working in a fast-paced environment and are excited about working for a start- up in a new industry.</li></ul>\n<p>Our mission is to share our love of cannabis with the world.  If you are interested in being part of our journey, we'd love to hear from you!</p><p><em>C3 Industries is not seeking to work with recruitment agencies. Thank you.</em></p>\n"}, {"id": 907138, "url": "https://remotive.io/remote-jobs/writing/writer-907138", "title": "Writer", "company_name": "Newsette", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-10-01T02:20:44", "candidate_required_location": "USA Only", "salary": "", "description": "<p>The Newsette is searching for a full-time writer to join our team. We're a next-gen media company and creative agency that empowers, motivates, and informs women every morning. Our mission is to make women across the globe feel more powerful every single day with engaging and digestible content. We're working on some first-of-their-kind projects with the world's biggest brands that are going to surprise and delight a bunch of people. And that's where you come in. While our company HQ is in New York City, all employees are working remotely until further notice and being based in New York is not a requirement for this position.<br></p>\n<p><strong>About this job:</strong></p>\n<p>You will work closely with our team to create amazing content. You'll collaborate on The Newsette newsletter, but also help support other exciting emerging content verticals. Responsibilities include:</p>\n<ul><li>Aggregating and creating valuable daily content for our audiences</li><li>Planning and writing culture, lifestyle, fashion, beauty, and similar content, while also providing analysis/key learnings</li><li>Helping to craft and shape our editorial voice, ensuring we're always staying mission-focused</li><li>Managing editorial calendars and related processes</li><li>Co-leading new editorial projects and franchises</li><li>Supporting branded content initiatives</li></ul>\n<p></p>\n<p><strong>About you:</strong></p>\n<p>You're a resourceful and witty writer. You're a dreamer. And a curious and organized self-starter. You believe in our mission, have fresh ideas, and are excited to implement them on a nimble platform. You love collaborating with a team but are also focused enough to lead the charge on your own. You want to work in a growing start-up environment and help build something huge with us. We're looking for someone who is passionate about storytelling, but who also understands how the business of media affects content creation.</p>\n<p></p>\n<p><strong>Qualifications:</strong><br></p>\n<ul><li>Ability to write in The Newsette's cheeky and engaging voice/style</li><li>Proven interest in our mission and an understanding of the importance of inclusivity and authenticity </li><li>At least 2 years of professional writing experience</li><li>Knack for sourcing great stories and drawing your own conclusions about them</li><li>Track record of managing projects and strict deadlines</li></ul>\n<p></p>\n<p><strong>NewsPerks</strong>:</p>\n<ul><li>Collaborative and positive team in a work environment that will keep you challenged</li><li>Health insurance plans including vision and</li><li>401(k) plan</li><li>Generous vacation and PTO policy</li><li>Annual Learn-A-Latte lifelong learning stipend</li><li>Unlimited photos requests of Leo the Poodle, our Chief Happiness Officer</li></ul>\n"}, {"id": 898420, "url": "https://remotive.io/remote-jobs/writing/freelance-sports-betting-writer-898420", "title": "Freelance Sports Betting Writer", "company_name": "The HOTH", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-09-28T05:55:49", "candidate_required_location": "Anywhere", "salary": "", "description": "<p>Calling all sports writing fans!<br><br>We're the HOTH.</p>\n<p>No, it's not a Star Wars reference but points for noticing. It stands for Hittem' Over the Head – in other words, to bludgeon with awesomeness.</p>\n<p>We have an AMAZING opportunity to write articles that are focused on sports and sports betting. We are working with an elite sports betting client to provide daily articles centered around NFL, NCAA Football, NHL, NBA, etc! </p>\n<p>We are in full swing of many of the most important sports seasons. You can immediately join our existing team to write articles about real matchups each week. One of the biggest benefits of this position is the ability to do this creating from anywhere, anytime. Another big benefit? Your photo and name will be featured on each article to help you grow your writing career. </p>\n<p>This is a great place to work, and you'll also get the benefit of working with great freelance team members and awesome in-house staff. We offer bonus opportunities, incentives, and we LOVE to promote from within. We have an awesome retention rate, and people truly love working with us.</p>\n<p>Please note that this is a freelance, 1099 position and while it does not qualify for our formal in-office perks and benefits, it comes with incredible flexibility and an awesome culture.</p>\n<p>Are you familiar with basic sports betting terms? Do you love the NFL, NCAA Football, or other big-time sports? Do you want to make good money writing about the sports you already love to follow?</p>\n<p>If so, we'd like to chat with you!</p>\n<div class=\"h1\">Topic Examples:</div>\n<ul>\n<li>NFL Odds This Week: Get the Latest Picks, Predictions, and Point Spreads</li>\n<li>An Early Look at NCAAF Scores and Odds</li>\n<li>Week 3 NCAAF Betting Odds: A Look at the Top Teams</li>\n<li>Detroit Lions Schedule and Betting Guide 2021</li>\n</ul>\n<div class=\"h1\">Time Requirements:</div>\n<ul>\n<li>This position is unique because we are time-bound by actual sporting events that happen daily. You will claim the topics that sound most interesting to you and must turn around multiple 500-1000 word articles within 24-48 hours</li>\n<li>You will have a quota of 5 completed articles per week, but you can complete as many available assignments as you would like</li>\n</ul>\n<div class=\"h1\">Why We're Awesome to Work With:</div>\n<ul>\n<li>You'll fill your portfolio with a variety of professional sports writing samples</li>\n<li>We have high-quality standards, which means awesome training – you'll learn a ton</li>\n<li>Work from wherever you want (as long as we can reach you)</li>\n<li>There is PLENTY of work to go around, and no cap on what you can write</li>\n<li>No need to hustle for clients, chase payments, or pitch with no promise of pay</li>\n<li>We recognize talent and promote from within</li>\n<li>Quick, consistent pay\n<ul>\n<li>500 Word Count (Most common) - $25.00</li>\n<li>750 Word Count - $35.00</li>\n<li>1,000 Word Count - $45.00</li>\n</ul>\n</li>\n</ul>\n<div class=\"h1\">Why We Want to Work With You:</div>\n<ul>\n<li>You're a native English speaker who loves to write</li>\n<li>You have experience working under very tight deadlines</li>\n<li>You are a sports fan and have basic knowledge of sports</li>\n<li>You are familiar with basic sports betting terms</li>\n<li>You have excellent grammar and writing skills</li>\n<li>You understand that great sports writing is informative, factual, and conversational </li>\n</ul>\n<div class=\"h1\">What Our Writers Have to Say About Working at The HOTH:</div>\n<p><em>“Writing for the HOTH allows me the daily flexibility I need, while also offering me the unlimited potential for success. I can write when I want and where I want, and I've learned SO much along the way. I've sharpened my writing skills, improved my critical thinking, and strengthened my researching abilities. Oh, and the team is awesome to work with, always providing guidance, encouragement, and motivation when I need it the most!”</em></p>\n<p><em>“Writing for the HOTH has been a pure pleasure so far. I'm learning so much about a variety of topics, having fun, and earning at the same time. The quality control team is friendly and helpful, as is the content manager. As a freelancer, it's great to know there's plenty of work to be done and that I will enjoy it, and get paid.\"</em></p>\n<p><em>\"The HOTH consistently pays every week– and, as someone who has had to chase down overdue payments in the past, that goes a long way! I love everything about writing for the HOTH and look forward to a long-term relationship with the company.”</em></p>\n<div class=\"h1\">Application Instructions:</div>\n<p>Interested? <strong>Submit your application now with at least one sports writing sample.</strong></p>\n<p>Those who do not include a <strong>sports </strong>sample will not be considered.</p>\n<p> </p>\n"}, {"id": 898399, "url": "https://remotive.io/remote-jobs/writing/english-copywriter-898399", "title": "English Copywriter", "company_name": "Genesis", "category": "Writing", "tags": [], "job_type": "part_time", "publication_date": "2021-09-23T21:51:34", "candidate_required_location": "Europe Only", "salary": "", "description": "<p><strong>Hi!</strong></p>\n<p>We are looking for a proactive and fast-learning <strong>English Copywriter (Remote) </strong>to join our team due to the constant growth of the business.</p>\n<p><strong>Duties and responsibilities:</strong></p>\n<ul>\n<li>Fact-checking and research.</li>\n<li>Creating original content on various topics.</li>\n<li>Working on the quality and uniqueness of texts.</li>\n<li>Rewriting and expanding the existing content on web-pages.</li>\n<li>Sticking to strict deadlines.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul>\n<li>English: Upper-Intermediate/Advanced.</li>\n<li>Experience in copywriting.</li>\n<li>Ability to work remotely.</li>\n<li>Time management skills.</li>\n<li>The knowledge of SEO basics would be a plus.</li>\n</ul>\n<p><strong>Conditions for your success:</strong></p>\n<ul>\n<li>Decent compensation that will allow you to focus on the development of the project and your professional growth.</li>\n<li>Complex and interesting tasks: real practice in building large-scale services, optimization, subtleties of work with loads, distribution of tasks, etc.</li>\n</ul>\n"}, {"id": 891776, "url": "https://remotive.io/remote-jobs/writing/research-editor-891776", "title": "Research Editor", "company_name": "Messari", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-09-22T02:23:18", "candidate_required_location": "Anywhere", "salary": "", "description": "<div><span style=\"font-size: 16pt;\">About Messari</span></div>\n<div> </div>\n<div> </div>\n<div><span style=\"font-size: 11pt;\">Messari is the industry’s leading market intelligence company focused on the digital asset ecosystem. We provide curated insights, market data, and research solutions that empower our customers to form actionable insights to confidently make decisions in the fast-moving cryptoasset space. </span></div>\n<div> </div>\n<div><span style=\"font-size: 11pt;\">At Messari, we believe crypto is the technology of free people, free-thinking, and free markets. We believe that cryptoassets have the potential to revolutionize both technology and finance and improve the lives of people everywhere. </span></div>\n<div> </div>\n<div><span style=\"font-size: 16pt;\">About the Job</span></div>\n<div><span style=\"font-size: 11pt;\">In this role, you will work closely with the </span><a href=\"https://messari.io/research/\" rel=\"nofollow\" style=\"font-size: 11pt;\">Enterprise</a><span style=\"font-size: 11pt;\"> and </span><a href=\"https://messari.io/hub\" rel=\"nofollow\" style=\"font-size: 11pt;\">Hub</a><span style=\"font-size: 11pt;\"> research teams to review written content, establish best practices, and publish reports through our internal content management system. The Research Editor will be responsible for ensuring that all content meets our high quality standards and assist in managing a diverse content calendar. A deep understanding of the crypto space is not needed for this role but it is a great opportunity to work closely with some of the industry’s top analysts and learn more about topics like DeFi, NFTs, Web3, and more.</span></div>\n<p><br><br></p>\n<div class=\"h3\">Responsibilities</div>\n<ul>\n<li>Assist in building an internal style guide for the Enterprise and Hub research teams.</li>\n</ul>\n<ul>\n<li>Review research reports and other short pieces for spelling, grammar, and style.</li>\n</ul>\n<ul>\n<li>Work with research and marketing teams to manage the content calendar.</li>\n</ul>\n<ul>\n<li>Utilize internal content management systems to upload reports and ensure that all content meets style guidelines.</li>\n</ul>\n<ul>\n<li>Build processes for publishing reports including review workflow.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<ul>\n<li>Experience in an editorial capacity such as copy editing, proofreading, or reviewing research reports.</li>\n</ul>\n<ul>\n<li>Ability to communicate across internal teams and with external freelance contributors when needed.</li>\n</ul>\n<ul>\n<li>Time management skills to ensure that all deadlines are met while managing other internal projects.</li>\n</ul>\n<ul>\n<li>An understanding of the crypto industry is a plus but the ideal candidate should at least have a desire to learn more about the space.</li>\n</ul>\n<div><span style=\"font-size: 11pt;\">This position is a full-time role. We are currently a remote company and are open to any remote candidates. Our team is distributed around the world and has the processes in place for productive remote work, but we meet up in person as often as possible.</span></div>\n<div> </div>\n<div><strong style=\"font-size: 18px;\">Our commitments</strong></div>\n<div>Messari is committed to maintaining a workplace where diversity of identity, culture, and life experience is the norm and respected consistently. Diversity of experience drives creativity and innovation, entrepreneurial leadership and integrity, and competitive and collaboration throughout our business and in the market. We depend on our differences to make our team stronger, and have our product reflect the diversity of our customers.</div>\n<div> </div>\n<div>At Messari, we welcome all qualified applicants regardless of race, color, ancestry, national origin, citizenship, socioeconomic status, religion, age, marital or parental status, sex, sexual orientation, gender identity or expression, disability, veteran status, or any other legally protected status. We are proud to be an equal opportunity workplace.</div>\n"}, {"id": 894517, "url": "https://remotive.io/remote-jobs/writing/content-editor-for-french-audience-m-f-d-894517", "title": "Content Editor for French Audience (m/f/d)", "company_name": "Social Sweethearts", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-09-17T14:17:00", "candidate_required_location": "Anywhere", "salary": "", "description": "<p> </p>\n<p>We are a digital media and games company. On a daily basis, we reach millions of users with our content, projects and games, such as the <a class=\"external\" href=\"https://www.facebook.com/Nametests-192875528281228/\" rel=\"nofollow\" target=\"_blank\">Nametests Instant Game</a> on Facebook. We are a creative team pursuing our mission to “make people smile”; we are committed to entertaining people and aim to inspire their world.</p>\n<p>We use the latest technology in order to be highly adaptive. Combined with our agile spirit and great teamwork, this allows us to achieve:</p>\n<ul>\n<li>More than 500 million people who played our games</li>\n<li>More than 120 million fans on Facebook</li>\n<li>Content and mini-games translated into more than 40 different languages</li>\n</ul>\n<p>The Social Sweethearts are looking for passionate and dynamic colleagues who would like to join us in continuing to create a more colorful world.</p>\n<p>Become a part of our team as <strong>Content Editor for French Audience</strong> (m/f/d) and take the following responsibilities:</p>\n<ul>\n<li>Manage, commission and monitor all project-translations into French</li>\n<li>Curate and localize EN content into French for our world wide audience</li>\n<li>Deduct style guide and quality criteria for French translations based on performance</li>\n<li>Implement and ensure best localization measures into the French translation Team</li>\n<li>Ensure daily translation amounts and turnaround times in French are met with the help of our inhouse translation team</li>\n</ul>\n<p><img src=\"https://workablehr.s3.amazonaws.com/uploads/photos/9645/ff3fc955069be02d58700159ab4e0988.jpg\"></p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>You are a Content Editor expert who knows how to appeal to our audience</li>\n<li>You have already experience in app localization</li>\n<li>You have a desire to create positive work experience for your Team</li>\n<li>You are experienced in managing and curating translations on a big scale</li>\n<li>You have good knowledge translation software</li>\n<li>You are not afraid of using a CMS and and custom-built inhouse solutions</li>\n<li>You have a organizational talent</li>\n<li>You have proficient knowledge of the English language and can communicate concisely</li>\n<li>You can send us references with your application documents</li>\n<li>You are reliable, a team player and work enthusiastically</li>\n<li>Entrepreneurial thinking, solution-oriented and independent working round off your profile</li>\n<li>Develop strong knowledge of our technical tools, CMS and our best-practices; share this knowledge with your colleagues and new team members in the editorial team to help them achieve their goals</li>\n</ul>\n<p><img src=\"https://workablehr.s3.amazonaws.com/uploads/photos/9645/43d64199fb7093d961f7f39017b235d9.jpg\"></p>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Friendly, collegiate atmosphere with colleagues who complement one another with their skills.</li>\n<li>Down-to-earth founders and management, who understand their role as servant leaders.</li>\n<li>With an English office language, we are an international and diverse team with people from all over the world.</li>\n<li>Active input on products that are used and downloaded globally by millions of users.</li>\n<li>Emphasis on a healthy work-life balance, with flexible working hours and extensive remote work / home-office options.</li>\n<li>Focus on knowledge sharing and cross-team-collaboration, with opportunities to share experiences with one another.</li>\n<li>Regular team events to be decided on democratically.</li>\n<li>A wonderful and growing company library.</li>\n</ul>\n"}, {"id": 893921, "url": "https://remotive.io/remote-jobs/writing/senior-copywriter-893921", "title": "Senior Copywriter", "company_name": "Hatch", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-09-16T09:54:19", "candidate_required_location": "USA Only", "salary": "", "description": "<div><span style=\"font-size: 16pt\">About Us</span></div><div><span style=\"font-size: 10pt\">At Hatch, we're dreaming up new ways to help everyone sleep better. We’ve helped over a million families get the sleep they need and we’re just getting started. Originally inspired by new parents and their babies, Hatch has evolved our suite of smart sleep products to help humans of all ages and stages develop and maintain natural, healthy sleep habits. </span></div><div><br></div><div><span style=\"font-size: 14pt\">You are:</span></div><div><span style=\"font-size: 11pt\">We’re looking for an experienced Senior Copywriter to help craft and drive the Hatch brand through messaging across all of our products. The ideal candidate will be able to collaborate closely and effectively across marketing and product teams, and is obsessed with bringing brands and product experiences to life through storytelling.</span></div><br><br><div class=\"h3\">What You'll Do: </div><ul><li>Develop and champion Hatch’s brand voice in support of the overall marketing vision and objectives, and channel business needs</li></ul><ul><li>Work closely with design, brand, production, digital and product development teams to develop brand copy across various digital and non-digital touch-points </li></ul><ul><li>Work closely with the marketing and product teams to develop brand copy across various digital and non-digital touch-points  </li></ul><ul><li>Understand our entire customer journey, inclusive of all experiences, from prospecting, onboarding and in-app copy</li></ul><ul><li>Bring informed storytelling and Hatch tone to every touch-point, in collaboration with the greater team</li></ul><ul><li>Drive brand messaging deliverables across all creative efforts to deliver compelling stories that simply and strongly explain the “why” and reasons to believe in a product</li></ul><ul><li>Collaborate effectively as a creative partner with internal cross functional business partners, marketing team, product management, and outside agencies/partners</li></ul><ul><li>Develop and evolve copy workflows and processes</li></ul><ul><li>Be ruthless when it comes to editing, grammar, and proofreading techniques for all incoming copy from external partners and vendors</li></ul><ul><li>Change gears easily, working with different teams and channels in a fast-paced, iterative environment</li></ul><br><br><div class=\"h3\">What You'll Bring: </div><ul><li>6+ years of experience as a brand/marketing copywriter on consumer-facing products, ideally in a start-up environment. </li></ul><ul><li>Hardware experience is a plus. </li></ul><ul><li>A portfolio that shows strategic and conceptual campaign thinking applied across a range of deliverables, including in-app, paid and organic social, product messaging, lifecycle, and brand guidelines</li></ul><ul><li>Strong storyteller with the ability to develop campaigns that get customers' attention and build product brands people love</li></ul><ul><li>Experience driving complex projects in a fast-paced environment</li></ul><ul><li>Excellent organization and prioritization skills, ability to handle multiple projects across several categories/channels</li></ul><ul><li> Possess a creative, positive, and flexible attitude</li></ul><ul><li> Strong editing, grammar, and proofreading techniques</li></ul><br><br><div class=\"h3\">Why You Will Love Working at Hatch!</div><ul><li>We are certified as A Great Place to Work! 96% of our employees have reported that Hatch is a great place to work.</li></ul><ul><li>We have an amazing leadership team that truly values its employees and lives our company values each and every day.</li></ul><ul><li>We delight our customers with something everyone needs; a good night’s sleep!</li></ul><ul><li>Our team is collaborative, fun, and brilliant!</li></ul><ul><li>You have an opportunity to make a large impact in people’s lives</li></ul><ul><li>We are backed by world class investors including True Ventures and have strong revenue growth.</li></ul><ul><li>We take let you take care of what you need by offering a flexible/remote work environment</li></ul><ul><li>We also take care of you through our comprehensive compensation package and many other perks and benefits including 100% paid medical, dental, and vision for employees and 80% for dependents</li></ul><ul><li>Meaningful equity </li></ul><ul><li>401(k) match with no vesting schedule</li></ul><ul><li>Remote office allowance</li></ul><ul><li>Monthly Internet reimbursement allowance</li></ul><ul><li>16 weeks paid parental leave for those important moments in life</li></ul><ul><li>Friends and Family discount</li></ul><ul><li>Many other spontaneous perks</li></ul><div><br></div><div><br></div><div>Designed by experts and loved by parents, our Rest family includes Rest, Rest+, Rest Mini, and Rest (2nd Gen)—all-in-one sleep products designed for babies and kids that can be controlled remotely. Hatch Restore is a fully-customizable product geared toward helping adults sleep well. As an all-in-one sleep assistant, Restore helps people personalize their perfect night of slumber. Launched in 2014 by parent entrepreneurs Ann Crady Weiss and Dave Weiss, and featured on “Shark Tank” in 2016, Hatch is headquartered in Menlo Park, California.</div><div><br></div><div> We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace.</div><div><br></div>"}, {"id": 884460, "url": "https://remotive.io/remote-jobs/writing/entertainment-writer-884460", "title": "Entertainment Writer", "company_name": "forbes-media", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-09-14T05:48:39", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Forbes believes in the power of entrepreneurial capitalism and uses it on various platforms to ignite the conversations that drive systemic change in business, culture and society. We celebrate success and are committed to using our megaphone to drive diversity, equity and inclusion. Forbes has recently announced plans to go public and to be listed on the NYSE via a special purpose acquisition company (or SPAC).  This will enable Forbes to further capitalize on its successful digital transformation, using technology and data-driven insights to create more deeply engaged audiences, through editorial, product development and strategic investments.</p><p>Our office is currently remote. Forbes aims to offer employees the flexibility they need in order to be successful. In September 2021, the expectation is that this role can be based out of Jersey City, NJ, offering a hybrid work schedule or can be remote in the U.S.</p><p>Forbes is looking for a smart, well-sourced Entertainment Writer to cover the business of music, movies, TV, podcasts and celebrities, track trends and write engaging stories on subjects that include uncovering and dissecting the strategies behind billionaire fortunes, innovative startups and entrepreneurs that are transforming the industry. The ideal candidate understands the breadth of the beat, has an interest in markets and entrepreneurism, relentlessly pursues big scoops and thrives in a fast-paced environment, where creativity and teamwork are highly valued. </p><p><strong>Responsibilities</strong><br></p><ul> <li>Covers the world’s most successful entertainers</li> <li>Monitors day-to-day entertainment news</li> <li>Breaks stories and delivers scoops before the competition</li> <li>Contributes to Forbes’ flagship lists </li> <li>Works on Wealth valuations related to Entertainment beat</li> <li>Writes longer-form stories and investigative pieces for the website and the magazine</li> <li>Searches through SEC documents and financial data to aid reporting</li> </ul><p><strong>Qualifications</strong></p><ul> <li>Bachelor's degree</li> <li>Understands financial terms,      markets and international tax laws</li> <li>Has at least five years of      experience in financial/business reporting </li> <li>Shows previous success breaking      news, covering entertainment’s big players and writing thoughtful      investigative pieces </li> <li>Proficient experience reading and      analyzing financial data</li> <li>Be deeply sourced</li> </ul><p><br></p><p>Forbes is an equal opportunity employer.</p>"}, {"id": 883625, "url": "https://remotive.io/remote-jobs/writing/technical-writer-combo-products-medical-devices-883625", "title": "Technical Writer (Combo Products/Medical Devices)", "company_name": "Kymanox", "category": "Writing", "tags": [], "job_type": "contract", "publication_date": "2021-09-13T05:49:15", "candidate_required_location": "USA Only", "salary": "", "description": "<p>We are looking for a Technical Writer to join our team in a long-term contract position.</p>\n<p><strong>Job Description:</strong></p>\n<p>The position will be engaged in leading key aspects of Kymanox’s technical writing and supporting clients on a portfolio of two to three projects covering a wide range of engineering, compliance, and commercialization challenges related to combination products.</p>\n<p>Projects may include any of the following focus areas:</p>\n<ul>\n<li>Combination Product Development and Commercialization (all aspects)</li>\n<li>Design Controls (e.g., expert DHF support)</li>\n<li>Risk Management</li>\n<li>Design Inputs</li>\n<li>Design Verification and Validation (V&amp;V)</li>\n<li>Human Factors Engineering</li>\n<li>Process Improvement and Troubleshooting</li>\n<li>Technology Transfer and Scale-Up</li>\n<li>Validation (e.g., Shipping, Process)</li>\n<li>Data Analysis, Including Statistical Analysis</li>\n<li>Regulatory Submission Authorship and Review</li>\n<li>Project Management Leadership and/or Support</li>\n<li>Technical Report Authorship, Review, and Formatting</li>\n<li>Manufacturing and Complaint Investigations</li>\n<li>Quality Management Systems (QMS) Support</li>\n<li>Process and Product Development (including design)</li>\n</ul>\n<p>Additional responsibilities can include:</p>\n<ul>\n<li>Serve as support for single point-of-contact on projects, executing as technical team lead and assisting other resources.</li>\n<li>Author technically simple and complex documentation to ensure technical competence to relevant local and federal regulations</li>\n<li>Support the completion of gap assessments against industry regulations or standards</li>\n<li>Develop policies or standard operating procedures under some level of direction from senior resources and management</li>\n<li>Others responsibilities as applicable</li>\n</ul>\n<p><strong>Educational Background:</strong></p>\n<ul>\n<li>Bachelor’s degree in any Engineering discipline (prefer Biomedical, Mechanical, or Chemical engineering) from an accredited institution or equivalent. </li>\n</ul>\n<p><strong>Experience:</strong></p>\n<ul>\n<li>1-3 years of experience in development and/or manufacturing, in the pharmaceutical, biotechnology, combination product, and/or medical device sectors is required.</li>\n<li>Experience in Technical Writing within the Pharma, Medical Device or BioTech industries is desired.</li>\n</ul>\n<p><strong>Desired Aptitude and Skill Set:</strong></p>\n<ul>\n<li>Resourceful</li>\n<li>Extremely detail oriented</li>\n<li>Ability to work effectively with remote team members</li>\n<li>Highly organized</li>\n<li>Self-directing, self-pacing</li>\n<li>Excellent written and oral English communication skills</li>\n<li>Understanding of own limitations</li>\n<li>Ability to solicit and utilize subject matter expert input</li>\n<li>Fast learner</li>\n<li>Pleasant and positive communication style</li>\n<li>Strong customer-service aptitude</li>\n<li>Ability to motivate self, team members, and direct reports</li>\n<li>High energy level</li>\n<li>Excellent problem-solving skills</li>\n<li>Seasoned soft skills (i.e., high EQ)</li>\n<li>Team player</li>\n<li>Thrive in a fast-paced, growing, and dynamic work environment</li>\n<li>Technology savvy</li>\n</ul>\n<p><strong>About Kymanox:</strong></p>\n<p>Join Kymanox and tangibly help the world produce modern medicine more quickly, more affordably, and with the highest quality and safety standards possible in today’s biotechnology, pharmaceutical, and medical device industries. With a reputation of providing unparalleled professional services, and our highly collaborative team of engineering, compliance, and project management experts, Kymanox provides an outstanding opportunity for learning and career advancement.</p>\n<p>Kymanox is looking for motivated individuals ready to continue a career in the life sciences and at a higher trajectory. Kymanox provides professional services related to engineering, compliance, and project management; we service clients ranging from Fortune 100 companies to virtual start-up companies to government agencies. The company was founded in 2004 and has been growing steadily since its inception. Our corporate HQ is based in Research Triangle Park, NC, and we have offices in Boston, Chicago, and New Jersey.</p>\n"}, {"id": 890801, "url": "https://remotive.io/remote-jobs/writing/content-strategist-ux-copywriter-890801", "title": "Content Strategist & UX Copywriter", "company_name": "Wordland Design", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-09-12T05:55:33", "candidate_required_location": "USA Only", "salary": "", "description": "<div class=\"h2\"><strong>Content Strategist and UX Copywriter Responsibilities</strong></div>\n<p> </p>\n<ul>\n<li>Research competitive landscapes and identify opportunities for clients to differentiate</li>\n<li>Develop new strategies for the Company and its clients to help them meet business and audience goals</li>\n<li>Write, edit, and lead copywriting and editing projects for websites and other digital products</li>\n<li>Prepare presentations to synthesize and socialize our recommendations using existing templates</li>\n<li>Finalize strategic work and copy based on feedback from internal team members and clients</li>\n<li>Implement strategic plans and copy in the appropriate tools</li>\n</ul>\n<p><em>Further, you will be performing other duties and responsibilities that are reasonable and consistent with your position and/or that may be assigned to you from time to time.</em></p>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>A minimum of 5+ years of content strategy and/or related copywriting experience in U.S. English</li>\n<li>Bachelor's degree or equivalent experience in communication, marketing, or a related field</li>\n<li>Experience producing highly converting copy for multiple audiences and channels</li>\n<li>Experience leading content teams and mentoring more junior team members</li>\n<li>Experience communicating with multiple project stakeholders about copy refinements and project deadlines</li>\n<li>Experience collaborating with designers and developers to deliver copy that works well for all audiences</li>\n<li>Demonstrated commitment to valuing diversity and contributing to an inclusive working and learning environment</li>\n</ul>\n<p><strong>Nice-to-have-skills</strong></p>\n<ul>\n<li>Prior agency experience</li>\n<li>Experience working in a casual small yet productive atmosphere on behalf of multiple clients</li>\n<li>Deep expertise in SEO, social media strategy, UX copywriting, content marketing, SMS marketing, chatbots, or other areas of content specialization</li>\n<li>Experience working in a similar self-driven, service-oriented, collaborative, and creative environment</li>\n<li>A keen eye for detail and appreciation of great design</li>\n<li>Demonstrated commitment to valuing diversity and contributing to an inclusive working and learning environment</li>\n</ul>\n<p><strong><em><u>We work 100% remotely.</u> </em></strong></p>\n<p> </p>\n"}, {"id": 885602, "url": "https://remotive.io/remote-jobs/writing/cv-writer-885602", "title": "CV Writer", "company_name": "James Innes Group", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-09-11T02:32:43", "candidate_required_location": "Europe Only", "salary": "", "description": "<div class=\"h3\">Company Description</div>\n<p>Founded by James Innes in 1998 - over 20 years ago - our mission statement - 'Changing lives, changing the world' - to help our clients be the best they can be and achieve the careers they truly deserve.</p>\n<p>We achieve this by providing a whole host of career and personal branding services;</p>\n<ul>\n<li>\n<p>CV/resume call consultations</p>\n</li>\n<li>\n<p>interview coaching</p>\n</li>\n<li>\n<p>professionally rewritten CVs, Resumes, LinkedIn Profiles and cover letters</p>\n</li>\n<li>\n<p>job application support and guidance</p>\n</li>\n<li>\n<p>profile photo and banner design</p>\n</li>\n<li>\n<p>social scrub (public search background check reporting)</p>\n</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong>We are currently looking for talented, creative writers to join our team - initially in a freelance capacity.</strong></p>\n<p><strong>Initial responsibilities will include;</strong></p>\n<ul>\n<li>\n<p>working with our clients to rewrite their CVs, LinkedIn Profiles and cover letters according to our in-house style and standards</p>\n</li>\n<li>\n<p>speaking with clients over the phone to discuss their requirements and match them up with the correct set of services</p>\n</li>\n<li>\n<p>interacting with the team online in chat and voice messages via our social platform</p>\n</li>\n</ul>\n<p>Remote working but with access to a lively platform for social interaction.</p>\n<p><strong><strong>Here are just a few of the benefits open to our team members as they grow and develop with us:</strong></strong></p>\n<ul>\n<li>Opportunities for career progression, with increased earning potential and benefits</li>\n<li>Progression up the ranks, with potential to join a close-knit, full-time team</li>\n<li>Access to training material and resources developed by bestselling careers author, James Innes</li>\n<li>Ongoing support and mentoring</li>\n<li>Potential to become an expert in a highly specialised field</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<ul>\n<li>\n<p>Excellent spoken and written English (native level).</p>\n</li>\n<li>\n<p>Expertise in using the latest version of Microsoft Word.</p>\n</li>\n<li>\n<p>Passion for helping people (to build their career prospects).</p>\n</li>\n<li>\n<p>Ability to research &amp; apply knowledge (our clients come from all industries and paths of expertise).</p>\n</li>\n<li>\n<p>Prior experience in either CV writing, career guidance or HR-related roles is desirable.</p>\n</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p>Applicants will be invited to an online interview with our management team (conducted via voice call). If successful, we would look to begin working with you immediately in the form of a probation period.</p>\n"}, {"id": 870481, "url": "https://remotive.io/remote-jobs/writing/sr-copywriter-870481", "title": "Sr. Copywriter", "company_name": "Zenreach", "category": "Writing", "tags": [], "job_type": "full_time", "publication_date": "2021-09-08T06:26:03", "candidate_required_location": "USA Only", "salary": "", "description": "<p>Zenreach solves a major problem for brick-and-mortar businesses—the majority of advertising is online, yet over 90% of purchasing still happens offline . Our platform links the two by automatically tracking customer visits, building rich customer profiles, targeting communication more precisely and directly measuring in-store impact.</p><p>We are backed by some of the biggest names in the Silicon Valley. If you’re interested in joining a team that is changing the way the world does business, this might be the place for you.</p><div class=\"h3\"><br></div><div class=\"h3\">THE OPPORTUNITY</div> <p>There has never been a more exciting time to join Zenreach! We are building out our marketing team and are looking for a Sr. Copywriter to create concepts and write clear, colorful, and engaging copy for marketing content of all kinds. You will be responsible for delivering engagement and understanding to Zenreach customers, partners, employees, and prospects. </p><p>In this role you are both a conceptual and a strategic thinker helping to establish the Zenreach tone and voice. That means coming up with brilliant ideas, but also understanding that what makes them truly brilliant is that they solve real business problems. You thrive in a fluid environment. One of the most exciting things about working at Zenreach is that it's constantly evolving. So you should be ready to adapt as the company and team grows. </p><p>Since many of our lead gen clients are marketers, we’re looking for a copywriter with a strong understanding of basic marketing principles who takes pride in turning more complex subjects into digestible, value-driven copy. As a marketing technology company, inherent interest in digital and tech will give you a leg up against other candidates. We need someone who isn’t going to shy away from the technical details, but instead leans in to understand them and leverages their craft to make content simple and appealing.</p><p><br></p><div class=\"h3\">RESPONSIBILITIES </div><ul> <li>Write engaging copy in a conversational, colorful and distinctive style for complete range of marketing content: website, collateral, guides, white papers, advertising, newsletters, articles, etc.</li> <li>Collaborate with design to ensure high quality work across art and copy</li> <li>Assist in defining and mastering our brand tone and voice, and ensure it comes through in all our communication.</li> <li>Understand advertising craft, and write sharp, smart headlines.</li> <li>Attend necessary briefings, meetings, and presentations; ask hard questions.</li> <li>Manage multiple projects, and work with others to meet deadlines.</li> <li>Learn our products, customer use cases and competitors in order to create insightful content that has value.</li> <li>Make sure everything we publish is well-written, organized and free of typos and grammatical errors.</li> </ul><p><br></p> <div class=\"h3\">REQUIREMENTS</div><ul> <li>Experience writing for B2B audiences a plus</li> <li>A solid understanding of technology and marketing solutions</li> <li>You have expert proofreading skills: spelling, grammar, and punctuation</li> <li>Patient and infectious positive attitude</li> <li>You have the ability to handle feedback and edits with grace</li> <li>You are outgoing and team oriented</li> <li>B.A. in English, Journalism, Communications, or related field</li> <li>5-7 years experience writing marketing copy for a broad range of content types. </li> <li>Tech experience helps, but isn’t required.</li> </ul> <div class=\"h3\"><br></div><div class=\"h3\">OUR VALUES</div><ul> <li> <strong>Be Committed:</strong> Work hard, own the problem, learn</li> <li> <strong>Create Trust:</strong> Do what you say, Create trust with our clients and colleagues</li> <li> <strong>Be Bold: </strong>Experiment, speak up, hope is not a plan</li> <li> <strong>Deliver High Performance: </strong>Prepare, commit, (over) deliver</li> </ul><div class=\"h3\"><br></div><div class=\"h3\">PERKS AND BENEFITS</div><ul> <li>Excellent and comprehensive health plans (medical (including HSA/FSA and free access to One Medical), dental, vision, 401K)</li> <li>Flexible work program with the ability to work remotely, or in-office - your choice!</li> <li>Summer Fridays (off) during the months of July and August</li> <li>Laptop and other equipment fundamentals (monitor, keyboard, and mouse if you need it!)</li> <li>Flexible Vacation Policy</li> <li>Enhanced Paternity/Maternity Programs</li> </ul><p><br></p><p><strong>Zenreach is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law.</strong></p><p><strong>*Zenreach is an E-Verify participant</strong></p><p><br><br></p>"}]}